{
  "newspapers": {
    "cnn": {
      "rss": "http://rss.cnn.com/rss/cnn_topstories.rss",
      "link": "http://www.cnn.com/",
      "articles": [
        {
          "link": "http://rss.cnn.com/~r/rss/cnn_topstories/~3/TuDCgYIsuPs/index.html",
          "published": "2021-04-05T02:57:28",
          "title": "George Floyd's family describes heart wrenching experience in the courtroom during Derek Chauvin's trial, attorney says",
          "text": "(CNN) An attorney representing the family of George Floyd told CNN on Sunday being in the courtroom for the trial of the former police officer accused of killing Floyd has been \"heart-wrenching.\"\n\nThe highly anticipated trial of Derek Chauvin began Monday with video showing Floyd's final moments . Chauvin, 45, has pleaded not guilty to second-degree unintentional murder, third-degree murder and second-degree manslaughter charges.\n\nOnly one member from the Floyd and Chauvin families will be allowed to attend the trial in Minneapolis because of Covid-19 pandemic restrictions, a judge ruled in the case\n\nBen Crump, who represents Floyd's family, told CNN's Jim Acosta that as a Black man -- who also has been a civil rights attorney the entirety of his professional life -- he believes Chauvin will be convicted.\n\n\"My heart has been broken before, dealing with the American legal system,\" Crump said.\n\nCrump said he was shocked when defense attorneys started blaming the crowd outside of Cup Foods and that \"the only thing that killed George Floyd was an overdose of excessive force.\" Defense attorney Eric Nelson argued the bystanders at the scene of Floyd's death had morphed into a threatening crowd. This, in turn, distracted officers, Nelson said.\n\nMinneapolis 911 dispatcher Jena Scurry was the first witness in the closely watched trial.\n\nOne thing Crump did find compelling, he said, was the testimony from Jena Scurry , a Minneapolis 911 dispatcher who directed officers to the Cup Foods store, the scene of Floyd's death. Scurry called a police sergeant to voice her concerns about the arrest the day Floyd died, saying \"I don't know if they had to use force or not.\"\n\n\"My instincts were telling me that something's wrong. Something was not right. I don't know what, but something wasn't right,\" Scurry said she thought as she watched the video. \"It was an extended period of time.\"\n\nJUST WATCHED Police lieutenant: Kneeling on Floyd was 'totally unnecessary' Replay More Videos ... MUST WATCH Police lieutenant: Kneeling on Floyd was 'totally unnecessary' 03:27\n\nCrump described Scurry's comments as a \"bombshell testimony.\" Crump also also addressed the testimony of Lt. Richard Zimmerman , the Minneapolis Police Department's top homicide detective, who said Chauvin kneeling on Floyd's neck after handcuffing him was \"totally unnecessary.\"\n\n\"It says something when you have the highest-ranking police officials in Minneapolis Police Department also saying this is a bridge too far,\" Crump said. \"You knew you weren't supposed to keep a human being facedown like that where they could not breathe. And yet, you did it and you did it even after he had become unconscious.\"\n\nJUST WATCHED George Floyd's girlfriend talks about his life as a father and a son Replay More Videos ... MUST WATCH George Floyd's girlfriend talks about his life as a father and a son 04:54\n\nWhat Crump said he did not like during the trial's first week was the defense's strategy to bring up Floyd's drug use. Fentanyl and methamphetamine use were among \"significant conditions\" found in Floyd's autopsy . His girlfriend, Courteney Ross, 45, said in her testimony that she and Floyd were addicted to opioids\n\n\"It's going to antagonize them over and over when (defense attorneys) try to tell them that his cause of death was not what they saw in this video, but some trace amounts of drugs that was found in his system,\" Crump said. The family expects it, he added, and they are prepared for the defense's strategy.\n\nChauvin's trial is scheduled to continue Monday."
        },
        {
          "link": "http://rss.cnn.com/~r/rss/cnn_topstories/~3/N_L96P9FN6w/index.html",
          "published": "2021-04-03T23:51:22",
          "title": "A week of compelling and potentially devastating testimony at Derek Chauvin's murder trial",
          "text": "(CNN) Pain, trauma and regret spilled out from a Minneapolis courtroom during a first week of critical testimony in the murder trial of Derek Chauvin, the former police officer who knelt on the neck of George Floyd.\n\nThe week concluded with potentially devastating testimony from the police department's most senior officer, who called Chauvin's actions on the day of Floyd's death \"totally unnecessary.\"\n\nJurors heard for the first time that Chauvin actually knelt on Floyd for 9 minutes and 29 seconds -- not the 8 minutes 46 seconds that had became a symbol and rallying cry of a worldwide protest movement against police brutality.\n\nProsecutor Jerry Blackwell broke it down: 4 minutes and 45 seconds as Floyd cried out for help, 53 seconds as he flailed due to seizures, and 3 minutes and 51 seconds as Floyd was non-responsive.\n\nBlackwell, in opening statements, said 9-2-9 were the \"three most important numbers in this case.\" That was the time it took for Chauvin to squeeze \"the very life\" out of Floyd. The revised time emerged from a review of officers' body cameras months after May 25, 2020, police encounter.\n\n\"It's heartbreaking to know the torture lasted even longer,\" Chris Stewart, an attorney for Floyd's family, told CNN. \"This isn't the standard situation where an officer has to make a split second decision.\"\n\nThe time difference, which has little impact on the case, was an early highlight of the closely watched criminal trial. Here are others:\n\nEchoes of guilt from the stand\n\nChauvin, 45, has pleaded not guilty to charges of second-degree unintentional murder, third-degree murder and second-degree manslaughter. The ex-cop, in a suit and tie, sat at the defense table most of the week, scribbling notes on a legal pad.\n\nIn opening statements, defense attorney Eric Nelson argued that video evidence failed to fully capture the complexity of the moment. Chauvin followed his police training, the lawyer told the jury.\n\nNelson argued that Floyd's death was the result of drug use and preexisting health issues. A crowd of what the attorney called hostile bystanders had distracted the officer.\n\nJUST WATCHED Witness wipes away tears listening back to his call to 911 Replay More Videos ... MUST WATCH Witness wipes away tears listening back to his call to 911 03:32\n\nMixed martial arts fighter Donald Wynn Williams II was one of the most vocal bystanders that day. He pleaded for Chauvin to get off Floyd. He called the ex-cop a \"bum\" and a \"tough guy.\"\n\n\"I just was really trying to keep my professionalism and make sure I speak out for Floyd's life because I felt like he was in very much danger,\" Williams testified.\n\nUnder cross examination, Williams acknowledged calling Chauvin and another officer names. He yelled at them even after Floyd had been taken away. But, he said, he was not an angry onlooker.\n\n\"You can't paint me out to be angry,\" he said.\n\nWilliams was so disturbed by what he saw he called 911, he said.\n\n\"I called the police on the police,\" he said. \"I believed I witnessed a murder.\"\n\nWitnesses had little in common but trauma united them\n\nThe prosecution witnesses had little in common. A White off-duty firefighter. Some high school students. A 61-year-old man who broke down in tears. A 9-year-old girl. The Black MMA fighter.\n\nBut the trauma of watching an unarmed Black man die under a White cop's knee had brought them together. They spoke of their feelings of helplessness and guilt as Floyd gasped for air and pleaded for his life.\n\n\"These words are going to be churning around in jurors' minds and the question that's going to come out of this is, looking towards Derek Chauvin, the defendant in this case, 'Why didn't you move?'\" CNN senior legal analyst Laura Coates said of the testimony. \"Why didn't this move you the way it obviously moved so many other people?\"\n\nJUST WATCHED Witness testimonies describe details in Floyd death Replay More Videos ... MUST WATCH Witness testimonies describe details in Floyd death 03:20\n\nThe teenager who took the widely known bystander video testified that in Floyd she saw her own Black father, brothers, cousins and friends.\n\n\"I look at that and I look at how that could have been one of them,\" Darnella Frazier said through tears.\n\n\"It's been nights I've stayed up apologizing to George Floyd for not doing more and not physically interacting and not saving his life. But it's not what I should have done, it's what he should have done,\" she added, referring to Chauvin.\n\nFrazier was walking with the 9-year-old girl to the Cup Foods convenience store at the time of the arrest.\n\n\"I was sad and kind of mad,\" the girl testified. \"Because it felt like he was stopping his breathing, and it was kind of like hurting him.\"\n\nMinneapolis firefighter and certified EMT Genevieve Hansen was out for a walk on her day off. She testified that she saw Chauvin kneeling over Floyd's neck. She wanted to render aid and repeatedly asked police to check Floyd for a pulse. They refused.\n\nJUST WATCHED Hear what firefighter says cops told her when she tried to help George Floyd Replay More Videos ... MUST WATCH Hear what firefighter says cops told her when she tried to help George Floyd 06:06\n\n\"I tried calm reasoning, I tried to be assertive, I pled and was desperate,\" said Hansen, who wept on the stand at one point. \"I was desperate to give help.\"\n\nUnder cross, Nelson tried to get Williams and Hansen to agree with his assertion that they and others were angry and threatening.\n\n\"I don't know if you've ever seen someone die in front of you, but it's very upsetting,\" Hansen told the defense lawyer at one point.\n\nAfter dismissing the jury, Judge Peter Cahill admonished Hansen.\n\nCNN legal analyst and defense attorney Mark O'Mara warned against attacks on sympathetic prosecution witnesses.\n\n\"The defense team has to be extraordinarily careful,\" he told CNN. \"If you're losing those 12 people because of your attack ... on one of the witnesses, you may never get that credibility back. This idea of throwing attacks, small as they may be, against whatever witness comes up can really backfire.\"\n\nChristopher Martin, the 19-year-old cashier who suspected Floyd had handed him a counterfeit $20 bill before the police were called, echoed the regret of other witnesses.\n\n\"If I would have just not taken the bill, this could have been avoided,\" said Martin, who was a cashier at Cup Foods, where the initial call to police was made that day.\n\nJury hears Chauvin's perspective\n\nJUST WATCHED 'Oh my God': Trial goes to break after witness breaks down on stand Replay More Videos ... MUST WATCH 'Oh my God': Trial goes to break after witness breaks down on stand 03:43\n\nCharles McMillian, 61, described for the jury how he briefly confronted Chauvin moments after Floyd's limp body was taken away in an ambulance. \"What I watched was wrong,\" he said.\n\n\"That's one person's opinion,\" Chauvin is heard saying as he got into his squad car. \"We had to control this guy because he's a sizable guy. It looks like he's probably on something.\"\n\nThe short body cam clip provided the first public glimpse into the former officer's perspective.\n\n\"If you really think about it, what he was really just explaining away was, 'I would do anything that I needed to do. He's a big guy. He might have been on drugs,' and basically explaining away, in a very non-emotional way, the fact that this had happened to Floyd,\" O'Mara said of Chauvin's statement to the bystander.\n\nMcMillian testified as the prosecution played graphic excerpts of Floyd's final moments. Floyd gasped that he was claustrophobic. He repeatedly said he couldn't breathe. He called for his mother.\n\nMcMillian broke down.\n\n\"I feel helpless,\" he said. \"I don't have a mama either. I understand him.\"\n\nChauvin told supervisor Floyd 'was going crazy'\n\nJUST WATCHED Retired police sergeant describes phone call with Chauvin Replay More Videos ... MUST WATCH Retired police sergeant describes phone call with Chauvin 02:57\n\nThe jury also heard Chauvin's call to his supervisor shortly after kneeling on Floyd to explain his version of events.\n\n\"I was just going to call and have you come out to our scene here,\" Chauvin told Sgt. David Pleoger in a call captured on body camera footage.\n\n\"We just had to hold a guy down. He was going crazy. He wouldn't ... he wouldn't go in the back of the squad -- \"\n\nChauvin said Floyd became combative after officers tried to put Floyd in the car. After a struggle, Chauvin said, Floyd had a medical emergency, according to Pleoger. Chauvin did not mention he held his knee on Floyd's neck and back.\n\nAt the scene later, Pleoger asked officers to speak to witnesses. \"We can try but they're all pretty hostile,\" Chauvin responded.\n\nAt Hennepin County Medical Center later that night, Chauvin for the first time told his supervisor that he had knelt on Floyd's neck, Pleoger testified.\n\nPleoger told the jury that Chauvin's use of force should have ended earlier.\n\n\"When Mr. Floyd was no longer offering up any resistance to the officers, they could have ended the restraint,\" he said.\n\n\"It would be reasonable to put a knee on someone's neck until they were not resisting anymore, but it should stop when they are no longer combative.\"\n\nThe prosecution said Chauvin pressed down on Floyd's neck and back for nearly 4 minutes during which Floyd was non-responsive.\n\nSpeaking of Floyd, paramedic Derek Smith testified, \"I thought he was dead.\"\n\nA pair of Hennepin County paramedics who treated Floyd said he was unresponsive, not breathing and had no pulse when they arrived on the scene.\n\nParamedic Derek Smith checked Floyd's pulse and pupils, with Chauvin still kneeling on him. He believed Floyd's heart had stopped. One paramedic had to motion for Chauvin to lift his knee to lift Floyd onto a stretcher.\n\n\"In layman terms,\" Smith said, \"I thought he was dead.\"\n\nAt one point in the courtroom, Philonise Floyd turned his eyes away from the screen showing video of his brother on a stretcher. Philonise Floyd lowered his head, shaking it. He rubbed his bald head with his hand.\n\nJUST WATCHED George Floyd's brother describes having to relive his death in courtroom Replay More Videos ... MUST WATCH George Floyd's brother describes having to relive his death in courtroom 02:44\n\n\"This life changing,\" he told CNN during a break in the proceedings. \"All this testimony is so hard on everyone.\"\n\nThe first week of testimony has been an \"emotional roller coaster,\" Philonise Floyd said.\n\n\"To everybody else, it was a case and a cause,\" he said. \"To me, it was my brother, somebody that I grew up with.\"\n\nFloyd and girlfriend struggled with addiction\n\nJUST WATCHED George Floyd's girlfriend talks about his life as a father and a son Replay More Videos ... MUST WATCH George Floyd's girlfriend talks about his life as a father and a son 04:54\n\nCourteney Ross, 45, said she met Floyd in 2017 when he worked as a security guard at the Salvation Army. They both were addicted to opioids, which they were initially prescribed to treat chronic pain.\n\nFloyd was a mama's boy who was a \"shell of himself\" after his mother's death in 2018, she said.\n\nIn March 2020, she found Floyd doubled over in pain and took him to the emergency room. He was hospitalized for an overdose, she testified.\n\nRoss testified she believed he had started using again in May 2020.\n\nTop homicide cop says Chauvin's actions were 'totally unnecessary'\n\nJUST WATCHED 'Astounding testimony': Coates reacts to Minneapolis police officer's statement Replay More Videos ... MUST WATCH 'Astounding testimony': Coates reacts to Minneapolis police officer's statement 04:13\n\nThe final witness of the week was Lt. Richard Zimmerman, head of the homicide division for more than 12 years. He joined the department in 1985, making him the most senior officer on the force.\n\nZimmerman said Chauvin's actions after Floyd was handcuffed and in a prone position were \"uncalled for\" and \"totally unnecessary.\"\n\nThe former's officers handling of the encounter violated department use of force policy, according to Zimmerman.\n\nAsked by prosecutor Matthew Frank if he was ever trained to kneel on a person, Zimmerman said no.\n\n\"Because if your knee is on someone's neck -- that could kill them,\" the lieutenant said.\n\nChauvin at that point raised his head at the defense table and shot a look at Zimmerman.\n\nMinneapolis Police Lt. Richard Zimmerman said Chauvin's actions after Floyd was handcuffed and in a prone position were \"uncalled for\" and \"totally unnecessary.\"\n\nUnder cross-examination, Zimmerman agreed that an unconscious person can become combative when revived, kicking and thrashing about.\n\nNelson sought to show that policing has changed significantly since Zimmerman got his training. He drew attention to Zimmerman's limited use of force experience as an investigator in comparison to a patrol officer.\n\nCoates said Zimmerman provided the \"most compelling law enforcement testimony\" in the trial so far. She called it \"damning.\"\n\n\"It blows out of the water any notion that the officer was trained to sustain this level of force on somebody once they were no longer posing any conceivable threat,\" she said."
        },
        {
          "link": "http://rss.cnn.com/~r/rss/cnn_topstories/~3/tLSkbnnMqF0/index.html",
          "published": "2021-04-04T14:33:34",
          "title": "Opinion: The year that's still breaking our hearts",
          "text": "Sign up to get our new weekly column as a newsletter. We're looking back at the strongest, smartest opinion takes of the week from CNN and other outlets.\n\n(CNN) The word \"trauma\" made its way into the English language from the ancient Greek verb that means to \"penetrate.\" The first known use of it came in 1693 when it was described as \"a wound from an external cause.\" But today our notion of trauma goes beyond the physical to include the extreme mental anguish that can penetrate lives.\n\nIn 2020, we had trauma every which way: a deadly pandemic, an economic plunge, a reckoning over race and a fraught election made for a time that will shape history for decades to come. That we are still coming to terms with all of it was clearer than ever this week.\n\nIn a Minneapolis courtroom, witnesses relived the pain of George Floyd's public death, as prosecutors revealed that Derek Chauvin, then a police officer and now on trial for the events of last May, knelt on Floyd's neck for 9 minutes and 29 seconds, even longer than previously thought.\n\n\"What happened to him resembled a public execution, one that echoes for many the anti-Black lynchings that marked the Jim Crow era, \" wrote. A 9-year-old girl was one of the onlookers who testified. \"That an innocent child, teenagers and well-meaning bystanders had to bear witness to his death -- including a firefighter with training that might have saved Floyd's life -- is truly extraordinary.\"\n\nFor all the shock that the testimony produced, Joseph and others noted that Black Americans have become accustomed to such stark injustice.\n\nNia-Malika Henderson recalled her mother's tears in 1992 when violence broke out in Los Angeles after police officers were acquitted of the beating of Rodney King, which had been captured on video. \"'Black people are in so much pain,' she cried, covering her face with her hands and burying her head in her knees.\"\n\nHenderson isn't watching the murder trial of Derek Chauvin. She confessed that despite being a journalist, \"I have never seen the George Floyd video.\" On the trial, she wrote, \"I keep my television muted if it is onscreen. Or I change the channel to avoid seeing anything at all. More specifically, I, like so many others who have seen too much, am avoiding yet another display of Black pain, Black trauma and Black death.\"\n\nHer mother is watching the trial and texted her children, \"We owe George Floyd.\" And Henderson agrees. \"Floyd is owed. But he is not owed by Black people, whose suffering is too often on a constant loop, so much as he is by a nation that so regularly has enabled that suffering to continue.\n\nElie Honig said the defense will \"argue that Chauvin did not cause Floyd's death\" and \"may claim that Chauvin's actions were necessary to physically restrain Floyd and take him into custody.\" The prosecution's case is straightforward, Calling it \"one of the most important trials this country has ever seen,\" legal analystsaid the defense will \"argue that Chauvin did not cause Floyd's death\" and \"may claim that Chauvin's actions were necessary to physically restrain Floyd and take him into custody.\" The prosecution's case is straightforward, \"but the outcome is anything but certain, and the stakes -- for the entire country -- are enormous,\" Honig noted.\n\nElliot Williams noted, many of the witnesses spoke to what they felt and saw without getting at the \"central legal dispute at the heart of the case -- the technical cause of Floyd's death.\" Some \"highlighted the widespread guilt that so many felt over their failure to confront the gross inequalities baked into our daily lives that led to Floyd's death. They wondered whether they were complicit in perpetuating racial injustice, and In a way, there are two trials going on -- a narrow one to determine whether Chauvin is guilty beyond a reasonable doubt and a larger, symbolic one about justice in America. Asnoted, many of the witnesses spoke to what they felt and saw without getting at the \"central legal dispute at the heart of the case -- the technical cause of Floyd's death.\" Some \"highlighted the widespread guilt that so many felt over their failure to confront the gross inequalities baked into our daily lives that led to Floyd's death. They wondered whether they were complicit in perpetuating racial injustice, and whether they could have done anything more to combat it .\"\n\nCapitol police officer killed\n\nThe trauma of Jan. 6, when rioters stormed the Capitol aiming to stop the certification of the 2020 election, also lingers painfully. On Friday, security at the Capitol drew headlines when a driver on Constitution Avenue rammed a barricade. Police officer William \"Billy\" Evans was killed and a second officer was injured. The driver, identified as Noah Green, was shot to death by police, who said he was holding a knife.\n\nThe January attack at the Capitol was deeply personal for Theresa J. Fanone. Her son is a 20-year veteran of the Metropolitan Police Department.\n\nFanone was watching the insurrection on television when she got an \"emotional, tearful\" call from Michael Fanone's police partner informing her he had been injured. \"My first conversation with Michael, who sounded terrified, began with, 'Mom, the hate in those people's eyes, they wanted to kill me, they kept screaming, 'kill him, kill him, get his gun and kill him.' Michael, along with many other officers, had been holding the door to the West Tunnel of the Capitol (the door the President uses when he takes the oath of office) when he was pulled through the doorway by the mob, pushed down the stairs, kicked, beaten, maced, tased repeatedly on his neck, had his face shield ripped off and his badge and radio taken.\"\n\nMichael's injuries resulted in a heart attack, due to trauma, stress and repeated tasing to his neck, burns on his neck and chest, a concussion, a traumatic brain injury and post-traumatic stress disorder.\"\n\nOn March 25, former President Donald Trump called into a Fox News show to say his supporters had posed \"zero threat\" that day in January and had been \"hugging and kissing\" police officers. \"My experience of that day, and every day since, has been significantly different,\" Theresa Fanone wrote.\n\nDean Obeidallah pointed out. \"In the past few days,\" he wrote, \"we've seen the Michigan GOP state chair invoke the specter of violence against those not loyal to Trump and conservative Trump media allies saying on Newsmax that they wished the military would step in and take over from President Joe Biden. Before the attack on the Capitol this type of language was wrong. Today it feels like The febrile political climate in the United States has not gone away, aspointed out. \"In the past few days,\" he wrote, \"we've seen the Michigan GOP state chair invoke the specter of violence against those not loyal to Trump and conservative Trump media allies saying on Newsmax that they wished the military would step in and take over from President Joe Biden. Before the attack on the Capitol this type of language was wrong. Today it feels like a dangerous continuation of the type of incitement that led to the Jan. 6 attack .\"\n\nAsian-American hate\n\nThe wave of anti-Asian American violence that grew after Trump repeatedly labeled Covid-19 the \"Chinese virus\" also hasn't gone away. In one incident, on Monday a 65-year-old woman of Filipino descent was punched and kicked on a New York City street by an attacker shouting anti-Asian slurs.\n\nYumi Hogan, the first lady of Maryland and the first Korean-American first lady in the US, wrote, \"My fellow Asian Americans weep over the rising number of attacks against our people. But in the face of this senseless violence, I see a new strength, determination and resilience in our eyes.\"\n\n\"We will not stay silent anymore,\" Hogan observed. \"But we will also not respond with vengeance. Instead, we will love each other more, we will support each other more, and we will stand together. We will make sure the overwhelming outpouring of support from leaders turns into real and lasting action that protects our children and grandchildren.\"\n\nFor more views on hate and discrimination:\n\nSE Cupp: Hate lives here\n\nA missed birthday\n\nA year ago, Fiana Garza Tulip was sending videos of her seven-month-old daughter to her mother, who was \"filled with such joy every time she received a clip of her only grandchild.\" Tulip's mother, Isabelle Hilton Papadimitriou, was a respiratory therapist, and last June had a confrontation with a hospital visitor who refused to wear a mask, citing Trump's failure to wear one. Covid-19 spread through her hospital department and a few weeks later, Papadimitriou died of the disease. She would have celebrated her 65th birthday this week.\n\nGet our free weekly newsletter Sign up for CNN Opinion's new newsletter. Join us on Twitter and Facebook\n\nTulip noted that former White House Covid-19 coordinator Dr. Deborah Birx said on a CNN documentary that hundreds of thousands may have died needlessly from the disease. \"When the history of the American pandemic is written,\" Tulip wrote, \"my daughter will ask how things got so bad. I will tell her that it was an age of failed leadership, a collapse of moral courage by those who should have spoken out, a distrust of science, and a time when people stopped caring for each other. I will make sure she knows that her grandmother, 'Abuelita Obie,' deserved so much better and she should still be alive today.\n\nDr. Megan Ranney. \"Birx's next error was allowing the regime's lies to go unchecked. It's true that she said many things right, from her first day to her last. And as a White House team member, she would have found it hard to publicly contradict her boss. And it's understandable that she thought she would do more good from inside the administration instead of as an outside observer. She said this herself in January. But still -- she could have drawn the lines of honesty and integrity much earlier.\" Birx had a sterling reputation as a leader of programs to fight HIV/AIDS before she became coronavirus coordinator for the Trump administration. \"Accepting a job working for Donald Trump was her first and worst mistake,\" wrote. \"Birx's next error was allowing the regime's lies to go unchecked. It's true that she said many things right, from her first day to her last. And as a White House team member, she would have found it hard to publicly contradict her boss. And it's understandable that she thought she would do more good from inside the administration instead of as an outside observer. She said this herself in January. But still -- she could have drawn the lines of honesty and integrity much earlier.\"\n\nFor more on Covid-19:\n\nMatthew M. Kavanagh: How to solve the mystery around Covid-19's origin\n\nJill Filipovic: Impending doom? We can avoid it\n\nKent Sepkowitz: Why the first state vaccine pass isn't ready for prime time\n\nJoe Biden in a hurry\n\nJeffrey D. Sachs. \"This is a plan for all Americans in all parts of the country. The time has come to build America's future.\" On the heels of his success with passage of the $1.9 trillion Covid-relief act, President Joe Biden proposed an even bigger investment this week -- in America's infrastructure. \"His new American Jobs Plan is a comprehensive, well-targeted and timely approach to America's many long-term economic ills, responding powerfully to 40 years of federal neglect ,\" observed economist. \"This is a plan for all Americans in all parts of the country. The time has come to build America's future.\"\n\nFrida Ghitis. \"Whether or not you agree with his priorities, it's undeniable that the scope of his actions in the last 70-some days has been enormous. And Biden -- the man Trump frequently derided as 'sleepy' -- is just getting started. His $2 trillion infrastructure proposal is his latest move in what is already one of the most ambitious presidencies in decades. And it's all happening at a dizzying speed.\" At 78, Biden is the oldest President in American history and he faces the possibility of seeing Democrats lose one or both houses of Congress in the November 2022 midterms. Biden is a \"man in a hurry,\" wrote. \"Whether or not you agree with his priorities, it's undeniable that the scope of his actions in the last 70-some days has been enormous. And Biden -- the man Trump frequently derided as 'sleepy' -- is just getting started. His $2 trillion infrastructure proposal is his latest move in what is already one of the most ambitious presidencies in decades. And it's all happening at a dizzying speed.\" At 78, Biden is the oldest President in American history and he faces the possibility of seeing Democrats lose one or both houses of Congress in the November 2022 midterms.\n\nSusan Glasser noted in the New Yorker, Biden is being \"hailed as an aspiring modern-day F.D.R. or L.B.J. who will lead the country out of crisis.\" That may prove premature. \"There is, of course, a key question that remains unanswered in the Capitol: Asnoted in the New Yorker, Biden is being \"hailed as an aspiring modern-day F.D.R. or L.B.J. who will lead the country out of crisis.\" That may prove premature. \"There is, of course, a key question that remains unanswered in the Capitol: Does Biden have the votes?\n\nConservative pundits have kept busy deriding the President's behavior -- his recent stumble on the stairs leading up to Air Force One, using note cards at his press conference, heading home to Delaware on some weekends and owning a dog that bit two federal workers. Focusing on such trivialities is a mistake, argued Lanhee J. Chen:\n\n\"The more important critique is the one that should be leveled at the substance of Biden's presidency -- the massive policy changes that he has already overseen and is proposing in the months and years to come. Republicans in Congress and across the country should be focusing their fire on Biden's policies and, even more importantly, presenting their own plans for solving some of the problems he proposes to address.\n\nFor more on politics:\n\nThomas Balcerski: The roadmap for Biden's infrastructure plan goes back to 1956\n\nCarrie Sheffield: Biden's new plan is an unfocused spending spree\n\nTerence Moore: Sports world should boycott Georgia over racist voting law\n\nMatt Gaetz\n\nA loyal backer of President Donald Trump was drawn into controversy this week. Florida Rep. Matt Gaetz \"is under investigation by the Justice Department, which is reportedly looking into whether he paid for the travel expenses of a 17-year-old girl across state lines to entice her into sexual activity,\" wrote legal analyst Jennifer Rodgers, a former federal prosecutor. Gaetz has lashed out in his defense, saying that \"he and his father are the victims of an extortion plot by individuals who demanded $25 million in exchange for helping Gaetz with the sex trafficking investigation.\"\n\nBut Rodgers observed that Gaetz' response doesn't fully work. \"There is no basis at all to believe that the private citizens alleged to be behind extortion attempts beginning two weeks ago also caused the DOJ investigation into sex trafficking to begin months ago ,\" she wrote.\n\nJulian Zelizer. \"Over the past four-and-a-half years, we have repeatedly witnessed how the If the allegations denied by Gaetz turn out to be true, the \"scandal will be another test to show how far Republicans are willing to go to protect their own,\" noted. \"Over the past four-and-a-half years, we have repeatedly witnessed how the immense power of partisanship within the GOP overwhelms its moral concerns ...\"\n\nCharlie Dent, a moderate Republican, pointed to Boehner's characterization of some Republicans elected in the 2010 midterms as morons. These members \" The extremism of some GOP members of Congress has been blamed on Trump, but a new book by former House Speaker John Boehner says it began well before the 45th president took office. Former Rep., a moderate Republican, pointed to Boehner's characterization of some Republicans elected in the 2010 midterms as morons. These members \" gained an outsized voice within the House GOP conference, bringing their extreme views and conspiracy theories to Congress . They pushed for legislation that had no chance of passing -- including defunding Obamacare while President Barack Obama was in office and Democrats controlled the US Senate -- and attempted to obstruct the raising of the debt ceiling, which would have led to fiscal Armageddon,\" Dent wrote.\n\nSuper Mario lives...and dies\n\nDid you know that Nintendo's Super Mario has a biographer? Jeff Ryan wrote the book on the character's prominence in the video game world and this week addressed the false rumors that \"Super Mario, the mustached video game plumber, was going to be dead the day after March 31.\" In fact, Nintendo is scheduled to release another Super Mario game this year and was just making a few tweaks to its game lineup.\n\nAs Ryan pointed out, Mario \"dies for a living\" in the games. Turns out he is based on the real-life Mario Segale, the landlord of the Seattle-area warehouse where thousands of Nintendo arcade cabinets were waiting to be refitted with a new game four decades ago.\n\nIn 1986, Nintendo launched a home game console in the US, the NES, with Super Mario Bros. It was a huge hit, and many more have followed. Ryan wrote, \"No Mario? Thank God! he lives, and lives forever. A thousand deaths from now, nay, ten times ten thousand deaths from now, Mario will continue to make glad the heart of childhood .\"\n\nDon't miss\n\nBrett Marie Sansbury and Natalia Rivera-Torres: Women are leading the way on biology's frontier. Here's how to open up all of science to them and\n\nDr. Jack Turban: Arkansas anti-trans law is completely unethical\n\nDanielle Campoamor: All pregnant people deserve a law like New Zealand's\n\nAND...\n\nTime for playing\n\nTess Taylor: \"The inner school kid in you (especially the one who has been stuck home for more than a year) would rather be out playing: After a tough year, \"admit it,\" wrote poet: \"The inner school kid in you (especially the one who has been stuck home for more than a year) would rather be out playing: maybe with music, maybe with friends, maybe with mud, maybe with words .\"\n\nPlaying with words is especially apt in April, National Poetry Month. For those sick of being homebound, there's this from a William Butler Yeats poem Taylor cited: (It was put to music by Hamilton Camp and has been performed by Judy Collins .)\n\nI will arise and go now, and go to Innisfree,\n\nAnd a small cabin build there, of clay and wattles made;\n\nNine bean-rows will I have there, a hive for the honey-bee,\n\nAnd live alone in the bee-loud glade.\n\nAnd I shall have some peace there, for peace comes dropping slow,\n\nDropping from the veils of the morning to where the cricket sings..."
        },
        {
          "link": "http://rss.cnn.com/~r/rss/cnn_topstories/~3/GTVF5pnSN2A/will-chauvin-trial-result-in-conviction.cnn",
          "published": "2021-04-03T15:40:43",
          "title": "Former FBI agent: This moment was a huge leap toward a Chauvin conviction",
          "text": "Will the prosecution's 'blue on blue' testimony - police veterans criticizing Derek Chauvin's actions were not defensible police behavior - help convict him? CNN's Michael Smerconish discusses.\n\nSource: CNN"
        },
        {
          "link": "http://rss.cnn.com/~r/rss/cnn_topstories/~3/EMKjn1tkJPo/index.html",
          "published": "2021-04-04T20:04:58",
          "title": "What it's like to be a reporter in the courtroom during the Derek Chauvin murder trial",
          "text": "New York (CNN Business) The Derek Chauvin murder trial is well underway, and CNN correspondent Sara Sidner said it is unlike any other that she's covered as a journalist.\n\nLast week, jurors heard testimony from bystanders who described the moment they witnessed Chauvin kneel on George Floyd's neck.\n\n\"This is the first time an entire trial from start to finish has been filmed,\" Sidner, told CNN's Chief Media Correspondent Brian Stelter on \"Reliable Sources\" Sunday. She added that the entire courthouse and other nearby government buildings are surrounded by security apparatus, including fencing and barbed wire.\n\nAs for the courtroom itself, \"Everyone is paying attention in a way that I haven't seen before,\" Sidner said. \"There is pin drop silence. You can hear yourself breathe.\"\n\nOne reason for the \"extremely quiet\" atmosphere is because attendants are socially distanced, which means the courtroom is not packed with people as it normally would be in a \"trial of this magnitude,\" Sidner said. There are two seats available for family members — one for the Floyd family and one for the Chauvin family.\n\nRead More"
        }
      ]
    },
    "nyt": {
      "rss": "http://rss.nytimes.com/services/xml/rss/nyt/Politics.xml",
      "link": "http://www.nytimes.com/section/politics",
      "articles": [
        {
          "link": "https://www.nytimes.com/2021/04/04/us/politics/guantanamo-bay-prisoners.html",
          "published": "2021-04-05T00:04:12",
          "title": "Military Closes Failing Facility at Guantánamo Bay to Consolidate Prisoners",
          "text": "U.S. military guards have moved Khalid Shaikh Mohammed and other former C.I.A. prisoners to the main part of the prison compound at Guantánamo Bay from a failing secret facility, in a consolidation of detention operations that could cut costs and reduce the troop presence at the base in Cuba, the military said on Sunday.\n\nMr. Mohammed, who is accused of being the mastermind of the Sept. 11 attacks, and other so-called high-value detainees at Guantánamo were moved to Camp 5 as part of the consolidation. The two-story building, a maximum-security facility that cost $17 million to build in 2004, is modeled after a state prison in Bunker Hill, Ind. It has a modest detainee health clinic and a psychiatric ward with a padded cell, but none of the hospice or end-of-life care capacity once envisioned by Pentagon planners.\n\nThe maximum-security facility is designed to keep prisoners confined to their cells except when guards move an individual to showers, outdoor cages that serve as recreation yards or another cell where a single captive can sit in a recliner, one ankle shackled to a bolt on the floor, and watch television.\n\nAs of Sunday, the military said, all 40 so-called war on terror detainees — the 11 men who have been charged with war crimes, as well as others who are held as indefinite detainees — were housed in a compound ringed with razor wire and containing two prison buildings, called Camps 5 and 6."
        },
        {
          "link": "https://www.nytimes.com/2021/04/04/us/politics/biden-hunger-programs.html",
          "published": "2021-04-04T23:00:11",
          "title": "Biden Effort to Combat Hunger Marks ‘a Profound Change’",
          "text": "WASHINGTON — With more than one in 10 households reporting that they lack enough to eat, the Biden administration is accelerating a vast campaign of hunger relief that will temporarily increase assistance by tens of billions of dollars and set the stage for what officials envision as lasting expansions of aid.\n\nThe effort to rush more food assistance to more people is notable both for the scale of its ambition and the variety of its legislative and administrative actions. The campaign has increased food stamps by more than $1 billion a month, provided needy children a dollar a day for snacks, expanded a produce allowance for pregnant women and children, and authorized the largest children’s summer feeding program in history.\n\n“We haven’t seen an expansion of food assistance of this magnitude since the founding of the modern food stamp program in 1977,” said James P. Ziliak, an economist at the University of Kentucky who studies nutrition programs. “It’s a profound change.”\n\nWhile dollars and decisions are flowing from the Agriculture Department, the tone has been set by President Biden, who issued an executive order in January telling aides to “address the growing hunger crisis” and later lamented the car lines “half a mile each, just to get a box of food.”"
        },
        {
          "link": "https://www.nytimes.com/2021/04/04/us/politics/domestic-terrorism-biden.html",
          "published": "2021-04-04T22:18:37",
          "title": "Biden Steps Up Federal Efforts to Combat Domestic Extremism",
          "text": "The Justice Department has unsealed criminal charges against more than 300 individuals for their role in the Capitol riot. The charges range widely and include assaulting police officers, illegally entering the Capitol building and conspiring to interfere in the election certification process. The leaders of the Oath Keepers militia and the far-right Proud Boys group are among the most prominent targets of the sprawling investigation.\n\nCritics of a domestic terrorism statute say it could expand the government’s surveillance authorities too much and be used against minority communities.\n\nA letter signed by Representatives Rashida Tlaib of Michigan, Alexandria Ocasio-Cortez of New York and eight other Democrats said the intelligence failure surrounding the Capitol breach reflected a reluctance by law enforcement to crack down on white nationalist groups, not a lack of government tools to monitor them.\n\nOne homeland security official involved in the department’s review of how to handle domestic terrorism said the agency did not need new laws but should instead employ the tools that have long been used against foreign terrorism.\n\nOne strategy is to analyze federal travel data to trace the patterns of possible militia members and extremists, especially as American groups increasingly establish connections to Europe, the official said. Members of the groups can then be added to so-called no-fly lists, he said.\n\nThe department’s review is focused not only on clear acts of terrorism but also on those who are pushed to commit attacks because of a combination of mental health issues, grievances and ideologies that provide a perceived justification for violence. Officials are also evaluating how to prevent attacks similar to the one at the Capitol on Friday, where a man crashed his vehicle into two officers at a barricade outside the building before getting out and charging them with a knife.\n\nThe suspect, who was shot and killed by the police after the attack, was identified by law enforcement officials as Noah Green, 25, of Covington, Va. Friends and family say he struggled with isolation and mental health issues. The police have not categorized the attack as “terrorism related,” and investigators continue to scour Mr. Green’s social media posts that showed an intensifying interest in the Nation of Islam."
        },
        {
          "link": "https://www.nytimes.com/2021/04/03/us/politics/emergent-vaccine-plant-johnson-johnson.html",
          "published": "2021-04-04T02:59:12",
          "title": "U.S. Taps Johnson & Johnson to Run Troubled Vaccine Plant",
          "text": "WASHINGTON — The Biden administration on Saturday put Johnson & Johnson in charge of a troubled Baltimore manufacturing plant that ruined 15 million doses of the Johnson & Johnson coronavirus vaccine and moved to stop the plant from making another vaccine by AstraZeneca, senior federal health officials said.\n\nThe extraordinary move by the Department of Health and Human Services came just days after officials had learned that Emergent BioSolutions, a contract manufacturer that has been making both the Johnson & Johnson and the AstraZeneca vaccines, mixed up ingredients from the two, which led regulators to delay authorization of the plant’s production lines.\n\nBy moving the AstraZeneca vaccine out, two senior federal health officials said, the plant can be solely devoted to the Johnson & Johnson single-dose vaccine and avoid future mishaps.\n\nThe Department of Health and Human Services directed Johnson & Johnson to install a new leadership team to oversee all aspects of production and manufacturing at the Emergent Baltimore plant, the officials said. The company said in a statement that it was “assuming full responsibility” for the vaccine made at the Emergent plant."
        },
        {
          "link": "https://www.nytimes.com/2021/04/03/us/politics/capitol-suspect-noah-green.html",
          "published": "2021-04-04T00:55:58",
          "title": "Capitol Suspect Struggled Before Attack, but Motive Remains Unclear",
          "text": "On the football field at Christopher Newport University in Virginia, Noah R. Green was No. 21, a dependable and good-natured, if soft-spoken, presence in the defensive backfield. Off the field, he was laser-focused on Black economic empowerment, counseling teammates on financial management and plotting a career helping close the racial wealth gap.\n\nBut by late March, after a bruising pandemic year that friends and family said left him isolated and mentally unmoored, Mr. Green’s life appeared increasingly to revolve around the Nation of Islam and its leader Louis Farrakhan, who has repeatedly promoted anti-Semitism. “Follower of Farrakhan,” Mr. Green labeled himself on Facebook, where he described leaving his job and grappling with “some of the biggest, unimaginable tests in my life.”\n\nNone of it appeared to hint at what he would do next. On Friday afternoon, law enforcement officials said, Mr. Green, 25, drove a dark blue Nissan sedan from nearby Virginia to the United States Capitol and plowed into two police officers protecting the grounds, killing one and injuring another. He then got out of the car brandishing a knife and lunged at officers. Police shot and mortally wounded him.\n\nThe attack, which pierced through the calm of a spring afternoon on Capitol Hill, halted the return to normalcy that had slowly begun to take hold there following the deadly Jan. 6 riot. It sent the police force that protects the Capitol into a fresh round of mourning and further complicated a raging debate over how to secure the seat of Congress at a time of increasing threat."
        }
      ]
    },
    "politicus_usa": {
      "rss": "http://www.politicususa.com/feed",
      "link": "http://www.politicususa.com/",
      "articles": [
        {
          "link": "https://www.politicususa.com/2021/04/04/republican-math-fail-infrastructure.html?utm_source=rss&utm_medium=rss&utm_campaign=republican-math-fail-infrastructure",
          "published": "2021-04-04T21:31:32",
          "title": "Republican Math Fail: Mississippi Gov. Tells Democrats To Pay For Infrastructure With Tax Cuts",
          "text": "Mississippi Gov. Tate Reeves suggested that Biden pay for infrastructure by cutting taxes on the wealthy and corporations.\n\nVideo:\n\nMississippi Gov. Tate Reeves says infrastructure is \"something the federal government, the state government and local government should spend more of our resources on but we don't have to hike taxes by $2 trillion to do it\" #CNNSOTU https://t.co/cPul2rjoL1 pic.twitter.com/i1NSryMKrR — State of the Union (@CNNSotu) April 4, 2021\n\nGov. Reeves said on CNN’s State of the Union:\n\n\n\nWell, I think you pay for it in a number of different ways.\n\nOne way you pay for it is by seeing significant improved economic growth. We saw that throughout the Trump administration because the policies were pro-business, they were pro-growth, and revenues improved.\n\nNow, unfortunately, during those four years, like the four years before that, they did not in Washington get control of spending. They feel as if the debt doesn’t matter. You’re looking at a debt burden today of nearly $30 trillion for Americans.\n\nAnd what’s ultimately going to happen — and it’s already happening — as interest rates rise, the share of our annual budget that goes to pay for interest expense is going to rise from what is already an enormous level of 15 to 20 percent of all federal revenues goes to pay interest expense.\n\nGov. Reeves was lying about the reason why the national debt exploded under Trump. It wasn’t spending that caused the debt to grow. It was the tax cuts for the wealthy and corporations that caused a hole in the national debt that it will take decades to repair.\n\nThe Trump tax cut alone caused the federal budget deficit to soar by 31%.\n\nThe Trump tax cut for the wealthy did not increase revenue. It blew a hole in the federal debt that it will take generations to fix. The Trump tax cut did not grow the economy or raise wages.\n\nRepublicans have subscribed so deeply to the fallacy that tax cuts for the wealthy generate revenue that they have deluded themselves into believing that they can pay for programs by taking revenue away from the treasury.\n\nRepublicans can no longer do basic math. Two minuses do not equal a plus.\n\nThe worst thing that Joe Biden could do would be to follow any economic policy of Donald Trump.\n\nFor more discussion about this story join our Rachel Maddow and MSNBC group.\n\nFollow and Like PoliticusUSA on Facebook"
        },
        {
          "link": "https://www.politicususa.com/2021/04/04/michigan-confront-right-wing-extremeists.html?utm_source=rss&utm_medium=rss&utm_campaign=michigan-confront-right-wing-extremeists",
          "published": "2021-04-04T20:33:15",
          "title": "Michigan Man Confronts Gun Toting Right Wing Extremists, “Get Your F*cking Guns Out Our Town.”",
          "text": "3.6k SHARES Facebook Twitter Whatsapp Pinterest Reddit Print Mail Flipboard\n\nFar-right gun-toting “boogaloo” right-wing extremists were publicly carrying their guns when they were confronted by residents telling them to get their guns out of their town.\n\nVideo of an Ann Arbor, Michigan resident not being intimidated by domestic terrorists:\n\n“Get your fucking guns out of here, man!” — a angry bystander to Boogaloos carrying long guns in Ann Arbor, Michigan (video via @FordFischer) pic.twitter.com/sAszD1cCDY — Aaron Rupar (@atrupar) April 4, 2021\n\nThe boogaloos are fight right-extremists who have sprouted off from white supremacy,neo-nazis, and, more recently, libertarianism. The militias have a stated goal of starting a second civil war.\n\nThe reason why they carry long guns in public is to intimidate people, but the Ann Arbor resident wasn’t having it. He told the extremists, “We don’t need this. We’ve been through a pandemic. Get your f*cking guns out of here, man.”\n\nHe continued, “The law is they (the police) are in charge, not you. Get the f*ck out of our town.”\n\nThe bystander asked the right-wing militia if they were a part of the Capitol attack, and they answered, “The Trumpers? No. God no.”\n\nThe American people have had enough. They are no longer going to be intimidated by right-wing extremists carrying guns and trying to play cop or soldier on America’s streets. Ann Arbor is one of the most liberal college towns in America.\n\nAfter years of Trump and right-wing extremism, something has changed, as there is growing evidence that most Americans have had enough and aren’t going to be bullied by the extreme right anymore.\n\nFor more discussion about this story join our Rachel Maddow and MSNBC group.\n\nFollow and Like PoliticusUSA on Facebook"
        },
        {
          "link": "https://www.politicususa.com/2021/04/04/trump-scam-64-million.html?utm_source=rss&utm_medium=rss&utm_campaign=trump-scam-64-million",
          "published": "2021-04-04T17:40:44",
          "title": "Trump Scammed His Supporters Out Of $64 Million, And They Want Their Money Back",
          "text": "5.6k SHARES Facebook Twitter Whatsapp Pinterest Reddit Print Mail Flipboard\n\nTrump duped his supporters into unwittingly giving weekly contributions that totaled over $64 million and refunds have been demanded\n\nThe New York Times reported on how the scam worked:\n\nContributors had to wade through a fine-print disclaimer and manually uncheck a box to opt out.\n\nAs the election neared, the Trump team made that disclaimer increasingly opaque, an investigation by The New York Times showed. It introduced a second prechecked box, known internally as a “money bomb,” that doubled a person’s contribution. Eventually its solicitations featured lines of text in bold and capital letters that overwhelmed the opt-out language.\n\nThe tactic ensnared scores of unsuspecting Trump loyalists — retirees, military veterans, nurses and even experienced political operatives. Soon, banks and credit card companies were inundated with fraud complaints from the president’s own supporters about donations they had not intended to make, sometimes for thousands of dollars.\n\nTrump was broke, so he scammed his supporters out of tens of millions of dollars to keep his campaign afloat. According to The Times, at its peak, one-third of all fraud complaints to banks were from supporters of Trump’s campaign who were scammed. The campaign had to issue refunds to 10.7% of its donors.\n\nIt was widely reported that Trump’s election challenge was a con to raise money for his PAC, but the idea that his campaign wasted a billion dollars in less than a year, and they responded by fraudulently bilking Trump’s supporters of tens of millions of dollars is the best argument that might ever be made for campaign finance reform.\n\nCampaign finance reform is not just getting rid of Citizens United and dark money out of politics. It is also ending the corruption and fraud that comes with a campaign finance system that is virtually lawless and robbing the people of their voice in the electoral process.\n\nThe Trump cons are endless, and his fundraising scam showed why he must be indicted and kept away from ever being able to run for office again.\n\nFor more discussion about this story join our Rachel Maddow and MSNBC group.\n\nFollow and Like PoliticusUSA on Facebook"
        },
        {
          "link": "https://www.politicususa.com/2021/04/04/ted-lieu-mike-huckabee.html?utm_source=rss&utm_medium=rss&utm_campaign=ted-lieu-mike-huckabee",
          "published": "2021-04-04T16:50:30",
          "title": "Rep. Ted Lieu Obliterates Mike Huckabee For Racist Attack On Asians",
          "text": "4.7k SHARES Facebook Twitter Whatsapp Pinterest Reddit Print Mail Flipboard\n\nMike Huckabee spent his Easter weekend in totally un-Christian fashion attacking Asians, and Rep. Ted Lieu (D-CA) took him down.\n\nHuckabee tweeted:\n\nI’ve decided to “identify” as Chinese. Coke will like me, Delta will agree with my “values” and I’ll probably get shoes from Nike & tickets to @MLB games. Ain’t America great? — Gov. Mike Huckabee (@GovMikeHuckabee) April 3, 2021\n\nRep. Lieu responded:\n\nHey Mike Huckabee, I asked around and Coke likes me, Delta agrees with my values, I wear Nikes and my hometown Dodgers won the World Series. But it’s not because of my ethnicity. It’s because I’m not a sh*thead like you who is adding fuel to anti-Asian hate.#StopAAPIHate https://t.co/Zs9spYu9GL — Ted Lieu (@tedlieu) April 4, 2021\n\nHuckabee was doing what he does, claiming that he is “Christian” while lobbing racist attacks and trying to divide America with hate and culture war issues. Mike Huckabee is a multi-time failed presidential candidate and Fox News bottom feeder who now spends his time doing his best Donald Trump Twitter troll impression.\n\nThis is how Republicans spend Easter, dividing America and spreading hate.\n\nRep. Lieu was right, and Twitter should ban Huckabee for racist hate speech.\n\nFor more discussion about this story join our Rachel Maddow and MSNBC group.\n\nFollow and Like PoliticusUSA on Facebook"
        },
        {
          "link": "https://www.politicususa.com/2021/04/04/pete-buttigieg-republicans-water.html?utm_source=rss&utm_medium=rss&utm_campaign=pete-buttigieg-republicans-water",
          "published": "2021-04-04T16:27:44",
          "title": "Pete Buttigieg Speaks Slowly And Explains To Republicans That Humans Need Water To Live",
          "text": "5.7k SHARES Facebook Twitter Whatsapp Pinterest Reddit Print Mail Flipboard\n\nTransportation Secretary Pete Buttigieg explained to Republicans who oppose money for pipes in the infrastructure bill that humans need water to live.\n\nVideo of Buttigieg:\n\nTransportation Secretary Pete Buttigieg explains to Republicans that people need water to live, so pipes are infrastructure. pic.twitter.com/b4xHnnuh5s — Sarah Reese Jones (@PoliticusSarah) April 4, 2021\n\nSec. Buttigieg said on ABC’s This Week:\n\n\n\nLet’s be clear. There’s a lot more than roads and bridges that are part of infrastructure. I heard the governor of South Dakota recently saying this isn’t infrastructure. It’s got money for pipes. We believe that pipes are infrastructure because you need water to live, and too many families now live with the threat of lead poisoning.\n\nThat’s absolutely infrastructure, you know, you talk about roads and bridges, but also airports and ports. We need to make sure that we have broadband. I know that traditionally the internet wasn’t considered infrastructure because in the Eisenhower years, of course, it didn’t exist, but infrastructure investment has to include looking to the future. Railroads seemed futuristic, and then we actually built them. Now they’re considered traditional infrastructure. You could say the same about highways, and I’ve got a lot of respect for senator blunt, but I’m going to work to try to persuade him that electrical charging infrastructure is absolutely a core part of how Americans are going to need to get around in the future, and not the distant, far-off future, but right now.\n\nThere are places in this country at any given moment of the day that don’t have water due to problems with pipes. Flint wasn’t an isolated incident as far as lead poisoning is concerned due to dangerous water pipes.\n\nThe state and condition of America’s infrastructure is a disgrace.\n\nThe coronavirus pandemic is proof that Republicans fundamentally do not care about the public good or if human beings live or die.\n\nRepublicans will oppose the infrastructure bill because it helps Americans not die from lack of access to safe drinking water.\n\nHuman beings need water to live, but Republicans don’t care if the American people get it.\n\nFor more discussion about this story join our Rachel Maddow and MSNBC group.\n\nFollow and Like PoliticusUSA on Facebook"
        }
      ]
    },
    "fox": {
      "rss": "http://feeds.foxnews.com/foxnews/politics",
      "link": "http://www.foxnews.com/",
      "articles": [
        {
          "link": "http://feeds.foxnews.com/~r/foxnews/politics/~3/kzQAWLzz-W8/biden-in-easter-message-calls-getting-vaccine-a-moral-obligation",
          "published": "2021-04-05T00:04:19",
          "title": "Biden in Easter message calls getting vaccine a 'moral obligation'",
          "text": "President Biden and First Lady Jill Biden released an Easter video Sunday in which the president insisted that Americans get vaccinated against COVID-19, calling it a \"moral obligation.\"\n\nThe Easter video, released on the president's official Twitter account, has references to God, Pope Francis, and the New Testament, but it does not mention Jesus.\n\n\"We share the sentiments of Pope Francis, who has said that getting vaccinated is a moral obligation, one that can save your life and the lives of others,\" the President said. \"By getting vaccinated and encouraging your congregations and your communities to get vaccinated, we not only can beat this virus, we can also hasten the day when we can celebrate the holidays together.\"\n\nThe president emphasized that \"the virus is not gone\" and noted that many continue to experience hardship as a result of the pandemic.\n\nHOW HUNTER BIDEN PLEADED FOR DAD'S HELP AFTER HIS AFFAIR WITH BROTHER'S WIDOW WAS LEAKED TO MEDIA\n\n\"As we celebrate this most holy day, we know many are still going without familiar comforts of the season,\" he said. \"The virus is not gone, and so many of us still feel the longing and loneliness of distance. For a second year, most will be apart from their families, friends, the full congregations that fill us with joy.\"\n\nBut the Bidens expressed optimism that Easter presents hope for better times.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n\"And yet as the Gospel of John reminds us, the light shines in the darkness and the darkness has not overcome it,\" the president said.\n\nMrs. Biden said: \"The traditions of Holy Week take us on a journey from sorrow to salvation, reminding us that with faith, hope and love, anything is possible.\""
        },
        {
          "link": "http://feeds.foxnews.com/~r/foxnews/politics/~3/GCk5M7YXKWg/chris-chistie-stacey-abrams-georgia",
          "published": "2021-04-04T22:10:24",
          "title": "Chris Christie calls out Stacey Abrams for praising NJ law that allows less early voting than Georgia's",
          "text": "Former New Jersey Gov. Chris Christie Sunday called out Georgia Democrat Stacey Abrams for praising a New Jersey in-person early voting law that provides fewer days of pre-Election Day in-person voting than a Georgia measure President Biden has compared to Jim Crow laws.\n\nThe New Jersey bill was signed last week by Democratic Gov. Phil Murphy, while the Georgia bill became law with the signature of Republican Gov. Brian Kemp on March 25.\n\n\"Stacey Abrams was in New Jersey, in my state, praising Phil Murphy this week for a voting law where New Jersey early voting is nine days — half of what Georgia’s is,\" Christie said during an appearance on \"This Week with George Stephanopoulos.\"\n\n\"Yet she’s on TV in New Jersey — I saw it myself — saying that this is one of the greatest voting expansion bills we’ve ever seen,\" Christie said.\n\nThe New Jersey legislation allows nine days of in-person early voting at a limited number of polling places, beginning on the tenth day before an election and ending on the Sunday before Election Day.\n\nGEORGIA GOV. KEMP HITS MLB, BIDEN AFTER ELECTION LAW PROMPTS ALL-STAR MOVE: NOTHING MORE THAN 'POLITICAL PLAY'\n\nGeorgia's new voting law provides a minimum of 17 days of early in-person voting and a maximum of nineteen days, according to the Atlanta Journal-Constitution.\n\nAbrams, who waged a failed campaign for governor against Kemp in 2018, did a virtual appearance with Murphy Tuesday, the day he signed the voting bill into law. She praised the state for \"leading the way on automatic voter registration.\"\n\nAbrams touted the benefits of in-person early voting.\n\n\"I am so excited to be looking up, looking at New Jersey, knowing that New Jersey is taking us in the right direction,\" she said.\n\nCLICK HERE FOR THE FOX NEWS APP\n\n\"To Governor Murphy, to the state legislature, to the secretary of state, and to all the allies who made this possible, you have my heartiest not only congratulations, but you have my gratitude because you are showing the way to a better democracy and a better future for us all.\"\n\n\"While it is difficult for some folks to comprehend, leaders in states who expand rights should be praised, and leaders in states who restrict rights should not be,\" said Seth Bringman, spokesman for Fair Fight Action, a voting rights group launched by Abrams in 2018.\n\n\"I missed the part of the New Jersey bill that criminalized handing a voter a bottle of water,\" he said. \"We are thrilled Republicans now believe access to democracy should not depend on the state in which Americans live, so we look forward to their support of the For the People Act and the John Lewis Voting Rights Advancement Act.\""
        },
        {
          "link": "http://feeds.foxnews.com/~r/foxnews/politics/~3/fhy-9FZB3L0/texas-ag-paxton-public-charge-rule-immigrants-public-assistance",
          "published": "2021-04-04T21:02:32",
          "title": "Texas AG defends 'public charge' rule on immigrants, public assistance dropped by Biden",
          "text": "Texas Attorney General Ken Paxton is defending a rule that limits entry for immigrants and their likely use of public benefits.\n\n\"It cost the country billions of dollars,\" Paxton stated on \"Sunday Morning Futures,\" on Fox News, \"If we're going to invite people in, we've got to make sure they can take care of themselves and that they're not going to end up on food stamps and Medicaid and health care insurance from our country.\"\n\nPaxton explained that the \"public charge\" rule, put in place to set boundaries on public assistance for immigrants, was never official until the Clinton administration federally enforced it. The rule was halted in 2020 after a court order.\n\nHOW WILL TRUMP'S 'PUBLIC CHARGE' RULE AFFECT IMMIGRANTS?\n\nNow, President Biden has dropped the rule, prompting Paxton to the Supreme Court to defend the rule in court.\n\nPaxton stressed that even the impact of surging migration on small border towns has been intense.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n\"It’s very unfair to these border towns. A lot of these towns are smaller,\" said Paxton, \"there’s so many people coming across....there’s so much demand on their services, especially with these children.\"Plus, added Paxton, \" throw in the mix of COVID and other potential communicable diseases and they are overwhelmed and they are at risk.\"\n\nSimply put, Paxton said what is happening at the border \"is a humanitarian disaster\" and it is the border towns that \"are suffering more than any others.\""
        },
        {
          "link": "http://feeds.foxnews.com/~r/foxnews/politics/~3/tBb95lLlgeA/georgia-voting-law-read-full-text",
          "published": "2021-04-04T20:56:06",
          "title": "Georgia voting law: Read full text",
          "text": "Georgia Gov. Brian Kemp signed a new voting bill, SB 202, into law on March 25.\n\nThe election law has sparked a backlash from Democratic officials and activists, not least of whom is President Biden, who called the legislation \"Jim Crow in the 21st century.\"\n\nCorporations spoke out against the law, and Major League Baseball decided to move its 2021 All-Star Game out of Atlanta because of it. But Kemp and other Republicans say the harsh response shows that critics have not actually read the law.\n\nREAD THE FULL TEXT HERE"
        },
        {
          "link": "http://feeds.foxnews.com/~r/foxnews/politics/~3/30BHcpLfuSI/ilhan-omar-breaks-with-stacey-abrams-over-georgia-boycotts",
          "published": "2021-04-04T20:23:39",
          "title": "Ilhan Omar breaks with Stacey Abrams over Georgia boycotts",
          "text": "Rep. Ilhan Omar said Sunday she supports boycotts in Georgia over the state’s new voting laws — breaking with activist Stacey Abrams on the issue.\n\nSpeaking to CNN’s \"State of the Union,\" Omar (D-Minn.) was asked if she agreed with Major League Baseball’s decision to pull its All-Star Game from Atlanta in protest of the law.\n\n\"We know that boycotts have allowed for justice to be delivered in many spaces. The civil rights movement was rooted in boycotts. We know that, you know, apartheid ended in South Africa because of boycotts,\" the progressive Minnesota congresswoman said.\n\n\"So our hope is that, you know, this boycott will result in changes in the law because we understand that when you restrict people’s ability to vote, you create a democracy that isn’t fully functioning for all of us, and if we are to continue to be beacon of hope for all democracies around the world, we must stand our ground,\" she continued.\n\nMLB SAYS ALL-STAR GAME WILL BE RELOCATED FROM GEORGIA IN RESPONSE TO VOTING LAW\n\nAbrams, the state’s failed 2018 Democratic gubernatorial candidate, made her case against a boycott in an op-ed published Wednesday by USA Today, following weeks of public outrage, including from Hollywood and numerous corporations.\n\n\"[B]oycotts are complicated affairs that require a long-term commitment to action. I have no doubt that voters of color, particularly Black voters, are willing to endure the hardships of boycotts. But I don’t think that’s necessary — yet,\" she wrote in the piece.\n\nThe legislation in question, signed by Gov. Brian Kemp late last month, overhauls election protocols in the Peach State, placing new restrictions on voting by mail and increases legislative control over the voting process.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nPresident Biden initially referred to the bill as \"Jim Crow on steroids\" the day after its signing, but went even further last Wednesday, saying he would \"strongly support\" moving the MLB’s mid-summer classic in protest.\n\n\"I think today’s professional athletes are acting incredibly responsibly,\" Biden said in an interview with ESPN. \"I would strongly support them doing that. People look to them. They are leaders.\"\n\nTo read more from The New York Post, click here."
        }
      ]
    },
    "epoch": {
      "rss": "http://www.theepochtimes.com/c-us/feed",
      "link": "http://www.theepochtimes.com/",
      "articles": [
        {
          "link": "https://www.theepochtimes.com/delta-cancels-over-100-flights-opens-some-middle-seats_3762053.html",
          "published": "2021-04-05T02:10:54",
          "title": "Delta Cancels Over 100 Flights, Opens Some Middle Seats",
          "text": "Delta Cancels Over 100 Flights, Opens Some Middle Seats\n\nDETROIT—Delta Air Lines canceled about 100 flights Sunday due to staff shortages, and it opened up middle seats a month earlier than expected in order to carry more passengers.\n\nThe airline says it had over 1 million passengers during the past few days, the highest number since before the coronavirus pandemic began last year.\n\n“We apologize to our customers for the inconvenience, and the majority have been rebooked for the same travel day,” the airline said Sunday in a statement.\n\nDelta took steps to increase passenger capacity, including opening middle seats on Sunday and Monday, in an effort to accommodate passengers.\n\nOn Wednesday, the airline announced that it would stop blocking off middle seats starting in May. The move was made last April to keep passengers farther apart, a policy that Delta’s CEO had repeatedly cited as raising trust in the airline. The seats would be reopened as air travel recovers and more people become vaccinated against COVID-19, the airline said.\n\nDelta said the middle seats were opened just for Sunday and Monday, and its seat-blocking policy has not changed. Where needed, seats could be unblocked in order to get customers to their destinations on the same day.\n\n“Delta teams have been working through various factors, including staffing, large numbers of employee vaccinations and pilots returning to active status,” the airline said in the statement. Some employees were having adverse side effects from being vaccinated.\n\nOn Sunday, websites at three Delta hubs showed 33 canceled arriving or departing flights. There were 19 at Atlanta’s Hartsfield-Jackson International Airport, another 11 at Detroit Metropolitan Airport and three more at Minneapolis-St. Paul Airport.\n\nDelta said Wednesday that nearly 65 percent of people who flew on Delta last year expect to have at least one dose of the new vaccines by May 1. That gave Delta the assurance to end seating limits, it said.\n\nThe airline industry was divided over the utility of blocking middle seats to reduce the risk of spreading COVID-19 on a flight. Airlines including Delta, Southwest, Alaska and JetBlue limited seating for months, while United Airlines never did and American did so only briefly.\n\nSocial-distancing is hard if not impossible on an airplane, even with middle seats empty—a point that United CEO Scott Kirby made many times to explain his airline’s resistance to seat-blocking.\n\nAir travel in the United States is recovering from pandemic lows. More than 1 million travelers have gone through U.S. airports for each of the last 20 days, although March traffic remains down nearly half from the same month in 2019.\n\nThe numbers are rising heading into the crucial summer vacation season. Last summer was a catastrophe for the airlines, contributing to Delta’s full-year loss of more than $12 billion. The airlines are eager to boost revenue as quickly as possible, and that means selling more seats.\n\nBy Tom Krisher"
        },
        {
          "link": "https://www.theepochtimes.com/tesla-files-a-petition-against-us-labor-board-order_3761228.html",
          "published": "2021-04-04T23:42:33",
          "title": "Tesla Files a Petition Against US Labor Board Order",
          "text": "The Tesla Motors logo is seen on the hood of a car at Tesla Motors headquarters, in Palo Alto, Calif., in May 20, 2010. (Justin Sullivan/Getty Images)\n\nTesla Files a Petition Against US Labor Board Order\n\nTesla Inc. has filed an appeal on a U.S. National Labor Relations Board (NLRB) ruling that the electric-car maker had violated U.S. labor law, and on the agency’s order that Chief Executive Officer Elon Musk delete a tweet from the account.\n\nThe electric-car maker filed a petition on Friday with the New Orleans-based U.S. Court of Appeals to review the NLRB’s decision and order issued on March 25.\n\nIn the petition, Tesla asked the court to review the order and grant Tesla “any further relief which the Court deems just and equitable.”\n\nLast month, the NRLB ordered Tesla to direct Musk to delete the tweet and to post a notice addressing the unlawful tweet at all of its facilities nationwide and include language that says “WE WILL take appropriate steps to ensure Musk complies with our directive.”\n\nIn the 2018 tweet, Musk wrote: “Nothing stopping Tesla team at our car plant from voting union. Could do so tmrw if they wanted. But why pay union dues & give up stock options for nothing? Our safety record is 2X better than when plant was UAW & everybody already gets healthcare.”\n\nThe NLRB also directed Tesla to offer one former employee reinstatement as well as to rescind 2017 rules that prohibited distributing union literature in its parking lot on non-work time and rules that barred distributing union stickers, leaflets, and pamphlets without first obtaining permission."
        },
        {
          "link": "https://www.theepochtimes.com/us-shuts-once-secret-guantanamo-prison-unit-moves-prisoners_3761919.html",
          "published": "2021-04-04T23:33:48",
          "title": "US Shuts Once-Secret Guantanamo Prison Unit, Moves Prisoners",
          "text": "A guard tower stands at the entrance of the U.S. prison at Guantanamo Bay, also known as \"Gitmo\", at the U.S. Naval Station at Guantanamo Bay, Cuba, on Oct. 23, 2016. (John Moore/Getty Images)\n\nUS Shuts Once-Secret Guantanamo Prison Unit, Moves Prisoners\n\nWASHINGTON—A once-secret unit within the Guantanamo Bay detention center that had fallen into disrepair has been closed and the prisoners moved to another facility on the American base in Cuba, the U.S. military said Sunday.\n\nThe prisoners at Camp 7 were transferred to a facility adjacent to where the other detainees on the base are held as part of what U.S. Southern Command said in a statement was an effort to “increase operational efficiency and effectiveness.”\n\nMiami-based Southern Command, which oversees the detention center at the southeastern edge of Cuba, did not say how many prisoners were moved. Officials have previously said about 14 men were held in Camp 7. There are 40 prisoners at Guantanamo.\n\nSouthern Command said the Camp 7 prisoners were moved to Camp 5 “safely and without incident,” but did not say when the transfer occurred. Camp 5, which was largely empty, is next to Camp 6, where the other detainees are held.\n\nCamp 7 opened in December 2006 for prisoners previously held in a network of clandestine CIA detention facilities, often referred to as “black sites,” where they were subjected to brutal interrogation techniques. The military ran it under an agreement with the CIA, and Southern Command said intelligence agencies were involved with the transfer.\n\nThe military long refused to even acknowledge the location of Camp 7 on the base and has never allowed journalists to see the inside of the facility. Officials had said that unit, which was never designed to be permanent, had structural issues and needed to be replaced, but the Pentagon dropped plans to seek money for the construction.\n\nAmong those held at Camp 7 were the five prisoners charged with war crimes for their alleged roles planning and providing logistical support for the Sept. 11, 2001, terrorist attacks.\n\nPresident Joe Biden has said he intends to close Guantanamo, but that would require approval from Congress to move some prisoners to the United States for trial or imprisonment."
        },
        {
          "link": "https://www.theepochtimes.com/new-staff-deploy-to-border-processing-facilities-as-crisis-worsens_3761795.html",
          "published": "2021-04-04T23:32:02",
          "title": "New Staff Deploy to Border Processing Facilities as Crisis Worsens",
          "text": "Chief Border Patrol agent Jason Owens speaks to Border Patrol Processing Coordinator trainees at the Border Patrol training facility in Artesia, New Mexico, on April 1, 2021. (Charlotte Cuthbertson/The Epoch Times)\n\nNew Staff Deploy to Border Processing Facilities as Crisis Worsens\n\nARTESIA, N.M.—As illegal border crossings continue to escalate, a crop of newly trained processing coordinators are being sent to El Paso and the Rio Grande Valley in Texas to help get Border Patrol agents back out on the line.\n\nThe 39 Border Patrol processing coordinators spent eight weeks training in first aid, processing, transportation, basic firearms, detainee care, and other skills. The new role was developed under the Trump administration in response to large numbers of Border Patrol agents being pulled away from border security to deal with humanitarian issues.\n\nThe new coordinators are “trained specifically to be able to care for the detainee population—identifying the sensitive populations, the at-risk populations, making sure that the medical care that is needed is open to them,” said Jason Owens, chief patrol agent of the Border Patrol training academy in Artesia, New Mexico.\n\nThe coordinators won’t be armed or have arrest authority, as it’s not a law enforcement position, but some of the graduates, such as Marco Mena, have a desire to eventually train as an agent.\n\nMena, 27, is one of 19 graduates who will begin work inside the El Paso temporary processing facility on April 5. The other 20 will deploy to the Donna, Texas, facility.\n\nMena was working in IT for Best Buy when a friend told him about the job.\n\n“I’ve always liked working with people,” Mena told The Epoch Times on April 2. “And that caregiver side of me, I want to go ahead and help. There’s a lot of unaccompanied minors, and I’d like to be able to lend a helping hand in making sure that they feel safe, that they have somewhere where they are sheltered, where they have meals, where they can rest.”\n\nA record high of more than 19,000 unaccompanied minors crossed the border illegally during the month of March, according to reports of preliminary numbers from Customs and Border Protection (CBP).\n\nBy law, unaccompanied children are meant to be processed through CBP facilities within 72 hours, before being transferred to Health and Human Services (HHS). However, the facilities are so overwhelmed that some children remain in CBP custody for a week or more.\n\nOn April 2, CBP was holding more than 5,380 unaccompanied minors, while HHS had more than 13,000 minors in custody.\n\nThe Biden administration has opened emergency HHS facilities in San Diego; Fort Bliss, Texas; and several other locations.\n\nKarina Garza, 31, heard about the processing job from her neighbor, who’s a Border Patrol agent in the Rio Grande Valley.\n\nGarza has a bachelor’s degree in psychology, majoring in child psychology, but she was working in retail management before being accepted into the processing position.\n\n“It’s something that I know is beneficial to our country. It’s just something that I look forward to, to just help assist our country,” Garza told The Epoch Times. “From what we’re seeing and what we’re being told, we’re very much needed at the moment because of the influx.”\n\nShe said the instructors and other agents have told her how instrumental her role will be in alleviating the pressure at the facilities.\n\nOwens said agents are now going to be able to return to patrol duty quicker.\n\n“You’re about to hit the field at a time when we need you the most,” Owens said during the class graduation on April 2. “We’re going to be able to do a better job at border security. We are better able to serve the American people.”\n\nOwens said five more classes are scheduled to be completed this fiscal year at a facility in Charleston, South Carolina. In total, Border Patrol hopes to train 1,200 processing coordinators within the next four years. The job is guaranteed for 13 months but can be extended for up to four years.\n\nThe federal training facility in Artesia trains about 1,750 Border Patrol agents per year."
        },
        {
          "link": "https://www.theepochtimes.com/study-cites-childhood-tumor-risk-for-pesticide-exposure-during-pregnancy_3762007.html",
          "published": "2021-04-04T23:13:52",
          "title": "Study Cites Childhood Tumor Risk for Pesticide Exposure During Pregnancy",
          "text": "Study Cites Childhood Tumor Risk for Pesticide Exposure During Pregnancy\n\nLOS ANGELES—Pesticide exposure during pregnancy might lead to the development of central nervous system tumors during childhood, according to a study involving researchers from the University of California–Los Angeles (UCLA), University of Southern California and Cedars-Sinai Medical Center.\n\nThe increased risk of these tumors, estimated as much as twice to 2.5 times higher for some pesticides, occurs even if the mother is not a farmworker, or lived as far as 2.5 miles from the field where the pesticides are sprayed, researchers found.\n\n“Exposure to certain pesticides, simply through residential proximity to agricultural applications during pregnancy, may increase the risk of childhood central nervous system tumors,” said Beate Ritz, a professor of epidemiology at UCLA’s Fielding School of Public Health and one of the study’s co-authors. “Policy interventions to reduce pesticide exposure in individuals residing near agricultural fields should be considered to protect the health of children.”\n\nThe research team, which also included the University of North Texas, analyzed cases of childhood central nervous system tumors in California between 1998 and 2013, with a focus on those living near agricultural fields. It tracked exposure and estimate risks for 77 separate and specific pesticides.\n\n“This study is the first, to our knowledge, to estimate effects for a large number of specific pesticides in relation to CNS tumor subtypes,” said Julia Heck, associate dean for research at the University of North Texas College of Health and Public Service and an associate professor of epidemiology.\n\n“California’s agricultural work force numbers more than 800,000, according to state estimates,” said Dr. Christina Lombardi, a co-author and epidemiologist with the Samuel Oschin Comprehensive Cancer Institute at Cedars-Sinai. “In addition to the negative health effects of pesticides on workers\n\nthere are large numbers of pregnant women and young children living adjacent to treated fields who may experience detrimental health effects as well.”\n\nThe research is being published in an upcoming edition of the peer-reviewed journal Environment Research, and is available online.\n\nPesticides have been investigated as possible risk factors for childhood cancer since the 1970s, and the U.S. Environmental Protection Agency has classified more than 100 as possible or probable carcinogens, based on toxicological and epidemiological data."
        }
      ]
    },
    "blaze": {
      "rss": "http://www.theblaze.com/feeds/feed.rss",
      "link": "http://www.theblaze.com/",
      "articles": [
        {
          "link": "https://www.theblaze.com/news/warnock-easter-salvation-heresy-twitter",
          "published": "2021-04-05T02:30:00",
          "title": "Raphael Warnock politicizes the meaning of Easter and gets a swift theological lesson",
          "text": "Democratic Sen. Raphael Warnock of Georgia tried to twist the meaning of Easter to fit his liberal political agenda and got a swift lesson in theology in response.\n\nWarnock, who served as a senior pastor at Ebenezer Baptist Church in Atlanta, tweeted that the meaning of Easter transcended beyond the resurrection of Jesus Christ. Traditional Biblical Christianity that the meaning of the faith is summed up by the resurrection of Jesus, who died on the cross for the suns of humanity.\n\n\"The meaning of Easter is more transcendent than the resurrection of Jesus Christ,\" said Warnock in the Tweet on Easter Sunday.\n\n\"Whether you are Christian or not, through a commitment to helping others we are able to save ourselves,\" he added.\n\n\n\nSome Christians were quick to pounce on the theologically questionable pronouncement from the reverend.\n\n\"No, actually, that's the meaning,\" replied Dan McLaughlin of National Review.\n\n\"What kind of Reverend would say something like this. Jesus Christ died and then rose again to take the sins of the world away. You are poisoning the minds of Christians for political purposes,\" responded Samuel Williams, a disabled veteran.\n\n\"With all due respect, this is literally the opposite of what the Gospel says. Ephesians 2 states that clearly. Faith alone, Christ alone,\" responded former ESPN producer Jason Romano. \"We should always help others. But man that's now how we're saved. Romans, Ephesians, the Gospels all make it clear we can't save ourselves. If we could, then Jesus dying on the cross for nothing.\"\n\n\"This is a great example of the classic heresy of Pelagianism: humans have the free will to achieve human perfection without divine grace,\" replied another critic.\n\nWarnock was called out by black pastors in December for supporting abortion in what they saw as a betrayal of traditional Christian and Biblical values.\n\n\"We implore you to uphold the Biblical defense of life and to fight against the systemic racism of abortion,\" read the letter from 25 black pastors.\n\nHere's more about Warnock's religious views:"
        },
        {
          "link": "https://www.theblaze.com/news/dean-obeidallah-trump-terrorism",
          "published": "2021-04-05T01:00:00",
          "title": "Muslim comedian compares Trump to terrorist Osama Bin Laden",
          "text": "Muslim comedian and national talk radio host Dean Obeidallah compared former President Donald Trump to terrorist Osama Bin Laden in a bid to pressure the media to stop covering the former president's statements.\n\nObeidallah, who is a frequent guest on MSNBC and CNN, said on Easter Sunday that Trump was comparable to Bin Laden in that they both inspired terror attacks on the U.S.\n\n\"Every Trump statement he puts out should be covered by the media the same way they covered Bin Laden's tapes in the year after 9/11,\" tweeted Obeidallah.\n\n\"Both Trump and Bin Laden incited terrorist attacks on our nation designed to destroy our democracy. Anything else by media is normalizing terrorism,\" he added.\n\nIn an earlier tweet, Obeidellah explains that he is referring to the rioting on Jan. 6 at the U.S. Capitol that led to numerous deaths including that of Capitol officer Brian Sicknick. Democrats have charged that the charged rhetoric of the former president led directly to the attack by some of his supporters.\n\n\"Would any reporter do a story about Osama Bin Laden or Timothy McVeigh without mentioning their role in deadly terrorist attacks? Of course not,\" he tweeted.\n\n\"Same rule MUST apply to Donald Trump for his role as the inciter of the Jan 6 terrorist attack. Anything less is normalizing terrorism,\" he added.\n\n\n\nTrump had released a short statement earlier on Easter Sunday where he excoriated liberals and continued claiming that the election had been stolen from him.\n\n\"Happy Easter to ALL, including the Radical Left CRAZIES who rigged our Presidential Election, and want to destroy our Country!\" he said in the written statement.\n\nPrior to that statement he advocated that conservatives boycott Major League Baseball and other corporations who cave to demands from liberal activists and the media.\n\nOthers voices on the left have lamented that the news media continues to circulate the former president's statements despite Trump being banned from most popular social media platforms. He himself has said that Twitter did him a favor by banning him since his statements are getting more coverage than the tweets from his suspended account.\n\nHere's more on big tech banning Trump:"
        },
        {
          "link": "https://www.theblaze.com/news/former-president-donald-trump-shreds-cancel-culture-encourages-supporters-republicans-to-boycott-woke-companies",
          "published": "2021-04-04T23:00:00",
          "title": "Trump encourages conservatives, Republicans to boycott 'woke' companies that oppose Ga. voting law: 'We will not become a socialist nation!'",
          "text": "Former President Donald Trump is urging people to boycott \"woke\" companies amid changes that were made to early voting in Georgia.\n\nNew state law requires a voter provide a drivers' license or state identification number when voting via absentee ballots, expanded early voting for both primary and general elections, and put in place additional security measures for ballot drop boxes.\n\nDemocrats have claimed, without evidence, that the new law restricts voting rights.\n\nWhat are the details?\n\nOn Saturday night, Trump encouraged people to boycott companies and organizations that are kowtowing to what he suggests are liberal agendas. His remarks also came after the MLB announced it was moving its 2021 all-star game out of Georgia in response to the new law.\n\n\"For years the Radical Left Democrats have played dirty by boycotting products when anything from that company is done or stated in any way that offends them,\" the former president said in a statement. \"Now they are going big time with WOKE CANCEL CULTURE and our sacred elections. It is finally time for Republicans and Conservatives to fight back — we have more people than they do — by far!\"\n\nHe continued, \"Boycott Major League Baseball, Coca-Cola, Delta Airlines, JPMorgan Chase, ViacomCBS, Citigroup, Cisco, UPS, and Merck. Don't go back to their products until they relent. We can play the game better than them.\"\n\nHe concluded, \"Never submit, never give up! The Radical Left will destroy our Country if we let them. We will not become a Socialist Nation. Happy Easter!\"\n\nOn Saturday, Georgia Gov. Brian Kemp (R) said that the state was a victim of \"cancel culture\" following the law and ensuing backlash from the MLB and other companies like Delta Airlines and Coca-Cola.\n\nIn a news conference, Kemp said, \"Yesterday, Major League Baseball caved to fear and lies from liberal activists. In the middle of a pandemic, Major League Baseball put the wishes of Stacey Abrams and Joe Biden ahead of the economic well-being of hard-working Georgians who were counting on the All-Star game for a paycheck.\"\n\nTrump on Saturday also called for people to boycott the MLB, and in a statement said, \"Baseball is already losing tremendous numbers of fans, and now they leave Atlanta with their All-Star Game because they are afraid of the Radical Left Democrats who do not want voter I.D., which is desperately needed, to have anything to do with our elections. Boycott baseball and all of the woke companies that are interfering with Free and Fair Elections. Are you listening Coke, Delta, and all!\"\n\n"
        },
        {
          "link": "https://www.theblaze.com/news/trump-easter-crazies-radical-left",
          "published": "2021-04-04T20:45:00",
          "title": "Trump bashes 'Radical Left CRAZIES' in statement celebrating Easter",
          "text": "Former President Donald Trump released a short statement celebrating Easter Sunday while bashing the \"Radical Left CRAZIES\" who he claimed rigged the election.\n\nTrump repeated the claim that led to his social media accounts being suspended in January after the lethal rioting at the U.S. Capitol.\n\n\"Happy Easter to ALL, including the Radical Left CRAZIES who rigged our Presidential Election, and want to destroy our Country!\" said the short message.\n\nThe former president had previously weighed in on the controversy over Major League Baseball pulling the 2021 All-Star Game out of Georgia over controversial voted security laws backed by Republicans.\n\n\"Baseball is already losing tremendous numbers of fans, and now they leave Atlanta with their All-Star Game because they are afraid of the Radical Left Democrats who do not want voter I.D., which is desperately needed, to have anything to do with our elections,\" said Trump in a statement released on Friday.\n\nHe expanded on those comments on Saturday in a longer written statement.\n\nTrump has taken up residence at his Mar-a-Lago Club in Palm Beach, Florida, after he moved out of the White House in January. He has made occasional appearances on cable news and released various statements on politics. During one interview on Tuesday he said that he was considering running for president again in 2024.\n\n\n\nHere's Trump's Easter statement from 2020:"
        },
        {
          "link": "https://www.theblaze.com/shows/glenn-beck-podcast/dallas-jenkins-the-chosen-",
          "published": "2021-04-04T18:53:46",
          "title": "Who is the REAL Jesus? THIS is what America needs to hear today",
          "text": "Dallas Jenkins is a storyteller — and he's telling the most important story of all time in a way that many believed was impossible.\n\nJenkins is the creator of \"The Chosen,\" a free, crowdfunded series about the life of Jesus that rivals Hollywood productions. And Season 2 could not have arrived at a better time — on Easter weekend 2021. Church attendance has dropped, people are hungry for something bigger than all of us, and many are choosing social justice activism, political parties, or even the climate change movement as \"religions\" over God.\n\nThis Easter weekend, Jenkins joined Glenn on the \"Glenn Beck Podcast\" to discuss the aspects of Jesus that often get overlooked and break through the misconceptions about who Jesus really is to paint a clear picture of why America needs Emmanuel, \"God with us,\" now more than ever.\n\nWatch the full podcast below:\n\nWant more from Glenn Beck?\n\nTo enjoy more of Glenn's masterful storytelling, thought-provoking analysis and uncanny ability to make sense of the chaos, subscribe to BlazeTV — the largest multi-platform network of voices who love America, defend the Constitution and live the American dream."
        }
      ]
    },
    "tgp": {
      "rss": "http://trendingpolitics.com/feed/",
      "link": "http://trendingpolitics.com/",
      "articles": [
        {
          "link": "https://trendingpolitics.com/new-report-biden-administration-busing-thousands-of-illegals-aliens-to-red-states-to-get-permanent-status-knab/?utm_source=rss&utm_medium=rss&utm_campaign=new-report-biden-administration-busing-thousands-of-illegals-aliens-to-red-states-to-get-permanent-status-knab",
          "published": "2021-04-04T19:33:14",
          "title": "New Report: Biden Administration Busing ‘Thousands’ of Illegals Aliens to Red States to Get Permanent Status",
          "text": "Biden’s border crisis is spreading nationwide, according to a new report from the Center for Immigration Studies. The new administration is pursuing an immigration policy dubbed “catch-and-bus” with the aim of establishing undocumented immigrants in states in the interior of the United States.\n\nThe Biden “smuggling routes” have gone largely unreported by media outlets that are fixated on the disastrous border crisis, where children are being kept in unsanitary conditions within detention facilities that violate COVID protocols.\n\nAccording to an original investigation by CIS, a veritable “conveyor belt” of busesfrom Texas, Arizona and California are transporting “thousands” of undocumented immigrants into America’s heartland.\n\n“The buses rolling in a steady daily succession out of Del Rio — one charter a day, seven days a week, and before that weeks of filling Greyhound buses — represent a microcosm of a much broader aspect of the unfolding mass-migration crisis at the southern border that has attracted limited media coverage and occurs largely outside public view,” CIS stated. “Tens of thousands of immigrants caught illegally crossing the border and then released under the new leniency policy of President Joe Biden are now dispersing to four corners of the United States on buses, with some of the more moneyed ones taking passenger jets.”\n\n“As best as the Center for Immigration Studies can determine from interviews and scattered media reporting, the buses are leaving regularly from Del Rio, the Texas Rio Grande Valley communities, and Laredo, but the busing also appears to be going on in Arizona, as well as in California,” the report continued.\n\n“Where are the buses going?” the CIS rhetorically asked. “They often drop their Haitian, Venezuelan, and Cuban passengers in Florida and New Jersey. Those from Nicaragua and other Central American nations have been delivered to Tennessee, Massachusetts, Indiana, Michigan, North Carolina, Georgia, Kentucky, and to large cities in Texas such as Dallas and Houston.”\n\nThe estimates square with other Border Patrol estimates, The Blaze corroborates.\n\n“Todd Bensman, senior national security fellow for the center, estimated that roughly 30,000 migrants who entered the country illegally have been bused directly into the country since the start of the year,” The Blaze reported. “That figure matches Border Patrol estimates TheBlaze reported on earlier this week.”\n\nThe Center for Immigration Studies describes the “catch-and-bus” process for many illegal migrants.\n\n“According to Ortiz, Burrow, Border Patrol agents, and several migrants, many turn themselves into Border Patrol voluntarily after their illegal crossings, knowing well the good things that will follow,” the CIS reports. “They are taken to a Border Patrol processing facility on the outskirts of town, where their fingerprints and identifiers are registered.”\n\n“In the first months of November, December, January, and February, no one was getting tested for Covid,” it adds. “But after a public outcry, DHS contracted a private company to conduct Covid-19 tests inside the Del Rio area Border Patrol facility. Every immigrant is now tested, Burrow said.”\n\n“DHS then provides many immigrants with an administrative document titled ‘Order of Release on Recognizance’, which grants them the legal right to be present inside the United States, according to two such documents that immigrants on the buses agreed to share,” the report continues. “These require the immigrants to self-report to a deportation officer in their destination cities by a specific date provided.”\n\n\n\n\n\n\n\n“One Nicaraguan migrant showed CIS a DHS document titled ‘Interim Notice Authorizing Parole’, which grants him a renewable one-year term to live legally inside the country,” the report went on, adding, “Most will likely use their time to apply for asylum, a lengthy, back-logged process that allows for work authorization and Social Security cards during an adjudication process that can drag on for years.”\n\nThe Biden “catch-and-bus” policy is an escalation of the Democratic Party’s open borders policy. Even if a state is not on the southern border, an illegal migrant can walk across it and get a free bus ride from the Biden administration to any place it chooses.\n\nAs seen on Becker News. Follow Kyle Becker and Becker News on Twitter."
        },
        {
          "link": "https://trendingpolitics.com/trump-releases-laugh-out-loud-easter-message-trolls-democrats/?utm_source=rss&utm_medium=rss&utm_campaign=trump-releases-laugh-out-loud-easter-message-trolls-democrats",
          "published": "2021-04-04T19:16:51",
          "title": "Trump Trolls Democrats In LAUGH OUT LOUD Loud Easter Message",
          "text": "On Easter Sunday, former President Donald Trump released a hilarious Easter message and even trolled the liberal “CRAZIES” in the process.\n\n“Happy Easter to ALL, including the Radical Left CRAZIES who rigged our Presidential Election, and want to destroy our Country!” the former President wrote in his statement.\n\nPresident Trump also released a separate message on Friday where he wished the American people a happy Easter while calling out voter fraud.\n\n***BRAND NEW Trump 2024 Hat Is Your FREE – Just Cover Shipping!***\n\n“Statement by Donald J. Trump, 45th President of the United States of America,” read the headline of the announcement.\n\n“Why is it that every time the 2020 ELECTION FRAUD is discussed, the Fake News Media consistently states that such charges are baseless, unfounded, unwarranted, etc.?” the former President said. “Sadly, there was massive fraud in the 2020 Presidential Election, and many very angry people understand that. With each passing day, and unfortunately for the Radical Left CRAZIES, more and more facts are coming out.”\n\nPresident Trump finished: “Other than that, Happy Easter!”\n\n***Help Us Take Down The Liberal Media With Our FREE News App!***\n\nWhat are your thoughts? Let us know in the comments below!"
        },
        {
          "link": "https://trendingpolitics.com/donald-trump-and-joe-bidens-easter-messages-reveal-everything-you-need-to-know-about-the-presidents-knab/?utm_source=rss&utm_medium=rss&utm_campaign=donald-trump-and-joe-bidens-easter-messages-reveal-everything-you-need-to-know-about-the-presidents-knab",
          "published": "2021-04-04T18:59:56",
          "title": "Donald Trump and Joe Biden’s Easter Messages Reveal Everything You Need to Know About the Presidents",
          "text": "Donald Trump and Joe Biden gave messages to Americans on Easter, the Christian religious holiday that celebrates the resurrection of Jesus Christ.\n\nThe 45th President of the United States gave the salutation “Happy Easter” and then decried that he lost the U.S. election.\n\n“Happy Easter to ALL, including the Radical Left CRAZIES who rigged our Presidential Election, and want to destroy our Country,” Trump wrote.\n\nThis follows on Trump blasting the companies criticizing Georgia’s election integrity laws in a statement he delivered on Saturday.\n\n“For years the Radical Left Democrats have played dirty by boycotting products when anything from that company is done or stated in any way that offends them. Now they are going big time with WOKE CANCEL CULTURE and our sacred elections,” Trump said. “It is finally time for Republicans and Conservatives to fight back—we have more people than they do—by far! Boycott Major League Baseball, Coca-Cola, Delta Airlines, JPMorgan Chase, ViacomCBS, Citigroup, Cisco, UPS, and Merck. Don’t go back to their products until they relent. We can play the game better than them.”\n\nJoe Biden, on the other hand, delivered an Easter Message that preached about the coronavirus, mentioning it 7 times, but failed to mention Jesus Christ even once.\n\nFrom our family to yours, we wish you health, hope, joy, and peace. Happy Easter, everyone! pic.twitter.com/3NHPrbFCVt — President Biden (@POTUS) April 4, 2021\n\n“We share the sentiments of Pope Francis who said that getting vaccinated is a moral obligation, one that can save your life and the lives of others,” Biden said. “By getting vaccinated and encouraging your congregations and your communities to get vaccinated, we not only can beat this virus, we can also haste the day when we can celebrate the holidays together.”\n\nThe coronavirus pandemic is gradually dissipating in terms of daily deaths due to the combination of herd immunity and vaccinations. The CDC recently clarified that vaccinated people do not spread COVID-19, which conflicts with its insistence that people should wear masks and social distance even after being vaccinated.\n\nPresident Trump is currently blocked by most social media platforms from issuing a fuller statement to the American People on Easter Sunday. When he was allowed to deliver video messages on social media, he went into the meaning of the religious holidays of Passover and Easter, such as in 2018.\n\n“During the sacred holiday of Passover, Jewish families around the world give thanks to God for liberating the Jewish people from bondage in Egypt and delivering them to the promised land of Israel,” Trump said.\n\n“For Christians, we remember the suffering and death of God’s only son and his glorious resurrection on the third day. On Easter Sunday, we proclaim with joy, ‘Christ is risen.'”\n\n\n\n\n\n\n\n“In America, we look to the light of God to guide our steps, we trust in the power of the Almighty for wisdom and strength, and we praise our heavenly Father for the blessings of freedom and the gift of eternal life.”\n\nThat is quite the remarkable contrast with what Americans saw from President Biden today.\n\nAs seen on Becker News. Follow Kyle Becker and Becker News on Twitter."
        },
        {
          "link": "https://trendingpolitics.com/charles-barkley-blames-politicians-for-stoking-racial-division-to-keep-their-grasp-of-money-and-power-knab/?utm_source=rss&utm_medium=rss&utm_campaign=charles-barkley-blames-politicians-for-stoking-racial-division-to-keep-their-grasp-of-money-and-power-knab",
          "published": "2021-04-04T15:42:18",
          "title": "Charles Barkley Blames Politicians for Stoking Racial Division to ‘Keep Their Grasp of Money and Power’",
          "text": "During the Final Four coverage on Saturday night, Charles Barkley slammed America’s politicians for stoking racial division for political gain. It is important to note that this take is exceptionally rare to hear on corporate television and diverges from the rabid left-wing political messaging that has now become ubiquitous in sports broadcasting.\n\nBREAKING: Charles Barkley says racial division is driven by politicians pic.twitter.com/otD5hxt4k9 — Jack Posobiec (@JackPosobiec) April 4, 2021\n\n“Man, I think most white people and black people are great people,” Barkley said. “I really believe that in my heart, but I think our system is set up where our politicians, whether they’re Republicans or Democrats, are designed to make us not like each other so they can keep their grasp of money and power. They divide and conquer.”\n\n“I truly believe in my heart most white people and black people are awesome people, but we’re so stupid for following our politicians, whether they’re Republicans or Democrats, and their only job is, ‘Hey, let’s make these people not like each other. We don’t live in their neighborhoods, we all got money, let’s make the whites and blacks not like each other, let’s make rich people and poor people not like each other, let’s scramble the middle class. I truly believe that in my heart.”\n\nCharles Barkley has a history of having some of the most level-headed takes on race relations in America. He has even hosted a six-part series on race relations called “Race in America.” And while most of his sports broadcaster colleagues our unleashing ill-informed, partisan talking points that tow the party line, Barkley has been known to speak his own mind.\n\nIn September 2020, for example, Barkley riled up left-wing CNN for questioning the narrative on the Breonna Taylor shooting. Barkley hilariously dismantled the race hoaxer Jussie Smollett for staging an event with “two black guys beating a black guy up,” and added, “If you’re going to break the law, don’t write a check.” He also angered local Baltimore residents by not feeding into the media narrative about the death of Freddie Gray.\n\n“America discriminates against poor people, whether you’re white, black, Hispanic, whatever,” Barkley said. “Poor people are dealt a crappy hand.”\n\nWe have gotten to the point in America where people need to hear common sense. It is not clear, however, exactly how Republicans feed instead racial division, except by being accused of ‘racism’ by Democrats for political gain. But Charles Barkley is spot on for the overall point. If Americans really think about the issue, they can figure out on their own who is stoking racial division in the country.\n\nAs seen on Becker News. Follow Kyle Becker and Becker News on Twitter."
        },
        {
          "link": "https://trendingpolitics.com/new-data-youtube-has-been-scrubbing-millions-of-dislikes-from-bidens-videos-knab/?utm_source=rss&utm_medium=rss&utm_campaign=new-data-youtube-has-been-scrubbing-millions-of-dislikes-from-bidens-videos-knab",
          "published": "2021-04-03T23:26:18",
          "title": "New Data: YouTube Has Been Scrubbing Millions of ‘Dislikes’ from Biden’s Videos",
          "text": "The social media platform YouTube is engaging in the duplicitous practice of scrubbing dislikes from Biden videos to protect the president’s political image, new data reveals.\n\nThe data, obtained by the Epoch Times, shows that YouTube has deleted an astounding 2.5 million dislikes from Biden’s videos.\n\n“YouTube has deleted about 2.5 million ‘dislikes’ from videos on the official White House channel of President Joe Biden, according to data collected and posted online by a researcher who wished to remain anonymous,” the Epoch Times reported. “YouTube recently announced that it’s testing a new page design that hides the dislike count.”\n\n“The Google-owned video platform allows users to give videos either a thumb up (like) or thumb down (dislike),” the report continued. “For at least two years, it’s had a policy to remove likes and dislikes it considers spam.”\n\n“We have policies and systems in place to ensure that the engagement on YouTube is authentic, and remove any fraudulent metrics,” a YouTube spokesperson told The Epoch Times but “wouldn’t go into details on what criteria it uses to make these calls.”\n\n“The White House videos have seen these kinds of interventions on an ongoing basis, but it appears it’s only the dislikes that are disappearing,” the publication added.\n\nYouTube users have long noticed the phenomenon of the overwhelming number of dislikes disappearing from the videos of a president who reportedly got 82 million votes in the 2020 election — by far the most in U.S. history.\n\nThe following screenshots of Biden videos shows that the dislikes tend to far outnumber the likes.\n\nHere is another screenshot of wreath-laying ceremony that had 22K dislikes compared to 2.9K likes.\n\nA screenshot of the same video from today shows the video has 19K likes.\n\n\n\n\n\n\n\nBiden’s first executive order signing ceremony video garnered an unbelievable 31K dislikes to 5.8K likes. It is now up to 43K dislikes with only 7.5K likes, suggesting that the deletion mechanism is inconsistently applied.\n\nThe National Pulse website catalogued other examples of Biden video dislikes. It also notes the huge disparity between Trump videos and Biden videos:\n\nIn contrast, President Trump’s latest address – live-streamed on the Right Side Broadcasting Network account – has over 145,000 likes and just 4,500 dislikes.\n\nNumerous observers early on in Biden’s administration noted there appeared to be a scrubbing of dislikes.\n\nThe technocrats overlords are going to censor and \"correct\" absolutely everything now. YouTube dislikes, comments, whatever. If they are willing to fake the vote they are willing to fake everything. And it will be justified with rationalizations just like ones used for AA. pic.twitter.com/A2Eo3GRk5A — ChadWolf Gardening Specialist (@ChadSpecialist) January 22, 2021\n\nYouTube erasing dislikes for Joe Biden’s administration. pic.twitter.com/4zmd1MkxJx — Zach Vorhies (@Perpetualmaniac) January 21, 2021\n\nWait……… is this really true? did Youtube get ride of the number of dislikes on Joe Biden's first video? and then later private the video to hide it? pic.twitter.com/vltq9FAufA — Luke Rudkowski (@Lukewearechange) January 21, 2021\n\nThere you have it: Youtube is removing millions of dislikes for Biden, who entered office with one of the lowest approval ratings on record. YouTube is the same company that has not only banned Donald Trump videos, but has even has deplatformed and censored pro-Trump content.\n\nIt makes you wonder all of the other ways the Big Tech is protecting Biden and ‘fortifying’ our nation’s elections.\n\nAs seen on Becker News. Follow Kyle Becker and Becker News on Twitter."
        }
      ]
    },
    "trend": {
      "rss": "http://www.thegatewaypundit.com/feed/",
      "link": "http://www.thegatewaypundit.com/",
      "articles": [
        {
          "link": "https://www.thegatewaypundit.com/2021/04/president-trump-family-receives-standing-ovation-mar-lago-easter-weekend-video/",
          "published": "2021-04-05T02:51:25",
          "title": "President Trump and His Family Receives a Standing Ovation at Mar-a-Lago on Easter Weekend (Video)",
          "text": "On Friday night President Trump, former First Lady Melania Trump and Barron Trump appeared together for the first time since leaving the White House.\n\nAnd President Trump received a standing ovation at Mar-a-Lago.\n\nTRENDING: What's He Hiding? Georgia's Secretary of State Raffensperger Petitions Court - Prefers State Not be Forced to Hand Over Ballots for Audit\n\nThe Daily Mail reported:\n\nDonald Trump has been spotted at Mar-a-Lago with wife Melania and son Barron in the family’s first appearance together since he left office.\n\nVideo posted to Instagram on Friday shows the Trump family strolling through an outdoor dining area at the club in Palm Beach, Florida, where the former president has made his home after leaving the Oval Office.\n\n‘Mr. President!’ one supporter is heard to shout, as the club members cheer and applaud, some rising to their feet."
        },
        {
          "link": "https://www.thegatewaypundit.com/2021/04/task-force-pictures-hate-crime-suspects-behind-series-violent-attacks-asian-americans/",
          "published": "2021-04-05T02:08:22",
          "title": "Task Force Pictures Hate Crime Suspects Behind Series of Violent Attacks on Asian Americans",
          "text": "The New York Hate Crime Task Force is currently looking for four individual suspects connected to hate crimes on Asian Americans in New York City.\n\nIt is safe to say these suspects are not likely members of The Proud Boys.\n\nSuspect 1: This suspect started screaming anti-Asian slurs at an Asian woman and her three children on the downtown 5 train.\n\nKnow him? Please help us identify him.\n\nOn 3/30, on a downtown “5” train approaching Times Square, an unidentified man began yelling anti-Asian slurs at a woman and her 3️⃣ children. He then knocked the woman’s phone to the floor & kicked it off the train. ☎️ 800-577-TIPS w/ info pic.twitter.com/SrAvxzEo6K — NYPD Hate Crimes (@NYPDHateCrimes) April 4, 2021\n\nTRENDING: What's He Hiding? Georgia's Secretary of State Raffensperger Petitions Court - Prefers State Not be Forced to Hand Over Ballots for Audit\n\nSuspect 2: This suspect pushed an Asian male on Lennox Avenue in Manhattan and made anti-Asian statements & punched him in the face.\n\nKnow him? Please help us identify him.\n\nOn 3/30, on a downtown “5” train approaching Times Square, an unidentified man began yelling anti-Asian slurs at a woman and her 3️⃣ children. He then knocked the woman’s phone to the floor & kicked it off the train. ☎️ 800-577-TIPS w/ info pic.twitter.com/SrAvxzEo6K — NYPD Hate Crimes (@NYPDHateCrimes) April 4, 2021\n\nSuspect 3: The individual was wanted for the vicious assault of a 65 year-old Asian female, at 360 West 43rd St. He was later arrested and charged with Felony Assault as a Hate Crime.\n\nThanks to assistance from the public and excellent investigative work by @NYPDHateCrimes Detectives, the individual wanted for Monday’s assault of a 65 year-old Asian female, at 360 West 43rd St, was arrested and charged with Felony Assault as a Hate Crime. pic.twitter.com/ZQRVGZEAb2 — NYPD Hate Crimes (@NYPDHateCrimes) March 31, 2021\n\nSuspect 4: This violent perpetrator assaulted a male victim on the J train. He beat him in the face and choked him unconscious.\n\nNeed MORE info re: Sat, 3/27/21, approx. 8:00 PM, ‘J’ Train at Kosciuszko Station, the perpetrator ⬇️ assaulted a male victim. Call 1-800-577-8477. Reward up to💲2,500 payable by Crime Stoppers upon arrest and indictment of the person(s) responsible for the above listed crime. pic.twitter.com/fLz6ThHgxy — NYPD Hate Crimes (@NYPDHateCrimes) March 30, 2021\n\nThe perpetrators in this series of anti-Asian hate crimes in New York City were all minority suspects.\n\nSadly you did not see this important news in the mainstream media.\n\nIt did not fit their narrative."
        },
        {
          "link": "https://www.thegatewaypundit.com/2021/04/national-assistance-minister-defense-brother-aj-not-brandishes-guns-georgia-capital-also-stacy-abrams-fan/",
          "published": "2021-04-04T22:35:13",
          "title": "Black Panther Minister of Defense ‘Brother AJ’ Not Only Brandishes Guns at the Georgia Capitol He Is Also a Stacy Abrams Fan",
          "text": "Earlier today we reported on armed gunmen who were present at the Georgia Capitol early last week. We have now identified the name of one of the gunmen and the group he’s affiliated with.\n\nWe reported earlier that BLM members were present at the Georgia state Capitol last week and they were armed and dangerous.\n\nNow we know that one of the members is known as National Assistance Minister of Defense, Brother AJ. He has been pictured at other events as well, armed and ready. Brother AJ and his friends are supporters of Georgia Gubernatorial candidate Staci Abrams.\n\nTRENDING: What's He Hiding? Georgia's Secretary of State Raffensperger Petitions Court - Prefers State Not be Forced to Hand Over Ballots for Audit\n\nIf these people wore MAGA hats they’d be in jail."
        },
        {
          "link": "https://www.thegatewaypundit.com/2021/04/frauds-mlb-boycotted-georgia-allstar-game-day-expanding-deal-communist-chinese/",
          "published": "2021-04-04T22:16:50",
          "title": "FRAUDS: MLB Boycotted Georgia Allstar Game a Day After Expanding Deal with Communist Chinese",
          "text": "Major League Baseball expanded its contract with the Chinese firm Tencent, which has significant ties to the Chinese Communist Party.\n\nThe announcement was made on April 1st.\n\nOn April 2nd Major League Baseball moved the All-Star Game out of Georgia after state leaders passed a new election law that requires a photo ID to vote absentee in the state.\n\nMLB said it was undemocratic.\n\nWhat frauds.\n\nTRENDING: What's He Hiding? Georgia's Secretary of State Raffensperger Petitions Court - Prefers State Not be Forced to Hand Over Ballots for Audit\n\nThe Epoch Times reported:\n\nMajor League Baseball had extended and expanded its contract with a Chinese telecommunications giant shortly before boycotting the state of Georgia over the league’s disagreement with the election reforms recently enacted by the Peach State’s democratically elected governor and legislature. Chinese state media reported on April 1 that the MLB will continue to be aired on the streaming platform operated by Chinese tech giant Tencent, which has significant ties to the Chinese Communist Party (CCP). Tencent is of the Chinese companies that had temporarily dropped NBA games as a form of censorship after former Houston Rockets general manager Daryl Morey spoke out in support of the pro-democracy protests in Hong Kong. On April 2, the day after the announcement of the Chinese deal, the MLB moved its annual All-Star game out of Atlanta, Georgia, in response to a set of election reforms signed by Georgia Gov. Brian Kemp last month.\n\nPresident Trump was right to push for a boycott of Major League Baseball.\n\nEnough is enough."
        },
        {
          "link": "https://www.thegatewaypundit.com/2021/04/cnn-talking-potato-brian-stelter-jim-acosta-spend-easter-sunday-discussing-post-trump-stress-disorder-video/",
          "published": "2021-04-04T21:50:24",
          "title": "CNN Talking Potato Brian Stelter and Jim Acosta Spend Easter Sunday Discussing Their “Post-Trump Stress Disorder” (VIDEO)",
          "text": "CNN’s talking potato Brian Stelter spent Easter Sunday discussing his “post-Trump stress disorder” with CNN’s resident clown Jim Acosta.\n\nStelter asked Jim Acosta how he’s “adjusting” to the Biden era.\n\nAcosta said, “Well I think we are all dealing with some post-Trump stress disorder…”\n\nBrian Stelter specializes in three things. Complaining about Trump, complaining about FOX News, and targeting conservatives for cancellation.\n\nTRENDING: What's He Hiding? Georgia's Secretary of State Raffensperger Petitions Court - Prefers State Not be Forced to Hand Over Ballots for Audit\n\nThat business model doesn’t seem to be working anymore in the Biden era.\n\nStelter’s show “Reliable Sources” has reportedly lost a million viewers since this past January.\n\nWATCH:"
        }
      ]
    },
    "cdm": {
      "link": "http://creativedestructionmedia.com/",
      "articles": [
        {
          "title": "Salvini Hits Back Against Leftist Criticism Over Meeting With Orban",
          "text": "Screenshot\n\nPlease Follow us on Gab, Parler, Minds, Telegram, Rumble\n\nItalian populist Senator Matteo Salvini has hit back against criticism from Italian leftists over his recent meeting with Hungarian prime minister Viktor Orbán and Polish prime minister Mateusz Morawiecki.\n\nMember of the Italian Democratic Party (PD) attacked Salvini over the meeting, accusing him of doing a “U-turn” on Prime Minister Mario Draghi, whose pro-European Union government Salvini currently supports.\n\nEnrico Letta, a former Prime Minister of Italy and secretary of the PD, stated that Salvini’s move was akin to a football fan put on the shirt of a rival club, claiming Salvini was not credible, newspaper Il Giornale reports…\n\nTo read more visit Breitbart.\n\nYou Won’t Get Anywhere Else What You Get From CDMedia! Donate!",
          "link": "https://creativedestructionmedia.com/news/europe/2021/04/04/salvini-hits-back-against-leftist-criticism-over-meeting-with-orban/",
          "published": "2021-04-04T00:00:00"
        },
        {
          "title": "GA SoS Raffensperger Files Legal Brief To Prevent Real Audit Of Ballots From 2020 Election",
          "text": "Old Proverb – Those With Nothing To Hide Don’t Try To Hide Things\n\nGA SoS Brad Raffensperger\n\nImage by Nydia Tisdale\n\nPlease Follow us on Gab, Parler, Minds, Telegram, Rumble\n\nGA Secretary of State Brad Raffensperger seems like he has a secret. The man in charge of ensuring fair elections in the Peach State really doesn’t want anyone looking at the actual ballots from the Nov 3rd U.S. general election.\n\nThere is an old proverb — those with nothing to hide don’t try to hide things.\n\nFair election activists from VoterGA.org have worked hard and succeeded in gaining access to ballots from Fulton County, GA for a forensic audit. A judge will rule on the procedures later this month.\n\nThis is scaring the pants off those who enabled the massive election fraud in November’s general election and the GA Senate run-off in January.\n\nWe have seen the same obstruction of justice in Maricopa County, AZ and other swing-states which were hit by fraud.\n\nThe GA Secretary of State’s office filed an amicus brief yesterday in support of corrupt Fulton County election officials.\n\nYou can read the brief in the file below.\n\n—————————\n\nHere are some amazing highlights from the legal filing:\n\nRaffensperger suggests he is simply ‘protecting the public’s interest’ in allowing on the ballot images to be used, and not the actual paper records.\n\nThe Secretary respectfully requests that the Court permit Petitioners to inspect ballot images only, and deny Petitioners’ request to inspect and scan ballots.\n\nPetitioners have submitted to the Court a proposed order granting their Motion to Unseal,\n\nwhich would grant Petitioners sweeping and unprecedented access to all ballots. (the horror)\n\nRaffensperger also told an ‘alternative fact’ in his brief, claiming VoterGA wants to move the ballots from their secure location for the audit. CDMedia spoke to VoterGA and this is simply not true.\n\nFirst, it is important to clarify the difference between “ballots” and “ballot images.”\n\n“Ballots” include (1) paper ballots produced by ballot marking devices (“BMDs”) used in in-person advanced voting and election-day voting; 1 (2) absentee-by-mail paper ballots; and\n\n(3) UOCAVA paper ballots. Ballots are then scanned through optical voting scanners selected\n\nand furnished by the State of Georgia pursuant to O.C.G.A. § 21-2-300. Once scanned, an\n\nelectronic ballot image is created and stored on a memory card (“ballot images”).\n\nSo in short, Raffensperger wants VoterGA to only have access to the ‘images’ that were created by equipment furnished by the GA Secretary of State’s office and not the actual ballots that show the intended anonymous vote of GA citizens.\n\nThe arrogance is quite shocking; although, after Nov 3rd, we shouldn’t be shocked at anything.\n\nRaffensperger declares that only he is allowed to see what actually happened.\n\nThe Elections Code is furthermore clear that it is only authorized elections officials who\n\nare legally permitted to verify and tabulate ballots in an election.\n\nAnd, he doesn’t want any outside technology that can detect counterfeit ballots.\n\nMoreover, the scanning and tabulation of ballots is only permitted under Georgia law to\n\nbe conducted on the equipment selected and furnished by the State of Georgia.\n\nThere is simply no legal basis for unauthorized third parties such as Petitioners to electronically scan ballots using their own equipment in order to conduct their own independent tabulation of ballots.\n\nAllowing Petitioners to conduct their own scan on uncertified and unknown equipment is contrary to law and would set a new and dangerous precedent going forward.\n\nPerhaps Raffensperger should add to his brief that only Chinese equipment is allowed to scan American ballots.\n\nFinally, Raffensperger declares its simply too late for anyone to do anything about the massive election fraud which occurred on Nov 3rd.\n\nTo the extent that Petitioners are using this open records act enforcement action as a pretext for challenging the legality of ballots cast in the general election, it is too late for them to assert such a challenge now, and any request for relief would be barred by the applicable statute of limitations.\n\nAfter reading the amicus brief in full filed by the GA Secretary of State’s office, we believe any intellectually honest person would now want to scan the real ballots, and not just the ‘ballot images’ created by machines.",
          "link": "https://creativedestructionmedia.com/news/politics/2021/04/04/ga-sos-raffensperger-files-legal-brief-to-prevent-real-audit-of-ballots-from-2020-election/",
          "published": "2021-04-04T00:00:00"
        },
        {
          "title": "The US Congress Reacts To Iran’s Social Dilemma And The Nuclear Deal",
          "text": "Image by Hesam404\n\nPlease Follow us on Gab, Parler, Minds, Telegram, Rumble\n\nIn today’s Iranian society, rising prices, unemployment, a sharp decline in the value of the currency, government corruption, protests by retirees, teachers, workers, and farmers, and long queues to buy food can clearly be seen. Many experts say the economic and living conditions of Iranians cannot easily be measured and calculated by the usual classic criteria, and the danger of the collapse of the Iranian economy sparking an explosion of fury from the distressed people will be seen in the near future.\n\nAfshin Kolahy, a private sector activist, told the Iranian Labour News Agency (ILNA) on March 22, 2021, “Even with the JCPOA agreement,” an extraordinary event “will not happen in Iran, and by the end of 2021 Iran will experience 65% inflation and a dollar equivalency above 35,000 Tomans… In the last few years, we have had a lot of setbacks.”\n\nThe supreme leader Khamenei is constantly running to the scene to control the situation. Speaking on March 21st, 2021 about the country’s production in the past year, he said: “To be fair, there was progress in important sectors of production. In some cases, we could even call it a jump in production, in others, even though there is no jump, there is definitely progress in production.”\n\nHe continued: “Automobile tires, aluminum, petrochemicals, steel, commodities like these, have had progress and growth”.\n\nKhamenei, of course, refers to industries such as the production and distribution of drugs, production, and exploitation of metal and nonmetal mines, the oil, petrochemical, gasoline, diesel, and steel industries, and agro-industrial companies, etc., which are exclusively in the hands of the Supreme Leader Khamenei and the IRGC affiliated mafia whose profits have skyrocketed at the expense of the closure of hundreds of factories and bankruptcy of small workshops.\n\nMohsen Dehnavi a member of parliament told the Khane Mellat state-run newspaper on September 8, 2020, that “more than 45,000 industrial and production units are located in industrial parks, of which 21% have been completely shut down,” meaning that about 9,450 production units in industrial parks have been closed.\n\nTasnim News Agency wrote on January 13, 2021, “More than 2,000 production units have been repossessed and closed by banks.”\n\nOne of the consequences of the closure of this number of factories and workshops and the disappearance of many side jobs of these work units is the further impoverishment of the poor and the disappearance of the middle class as they join the deprived classes (Hamdeli State-run newspaper July 15, 2020). This same newspaper on July 18, 2020, quoting Javad Hosseinzadegan, head of the Statistics Center of Iran wrote: “The increase in population of people living in city outskirts, the budget deficit of households, the slipping of the middle class into the poor and even the evaporation of this class are among the thousand and one other harms that feed on poverty.”.\n\nShargh newspaper, June 24, 2020 wrote, “Households, step by step, are going down from every level of income and we are clearly facing an increase in population of people in city outskirts living in dilapidated structures.”\n\nIbtekar Newspaper on July 6, 2020, wrote “The collapse of the middle class will have many consequences for the regime. The set of logic governing economic conditions in Iran …. has increased the class distance and removed the middle layer from the top to the bottom of society.”\n\nThe result of such an economy is an increase in popular discontent, which led to protests in 200 cities in November 2019 and continues. During February and March 2021, protests peaked in Saravan, Balochestan, Gonbad Kavus, and Zahedan and led to the setting fire of security forces vehicles making them flee the scene. Government officials, however, resorted to crackdowns, intimidation, and censorship of the Internet, shooting protesters, and arresting and hanging popular young people, such as Navid Afkari, the Iranian wrestling hero, and Ruhollah Zam, an Iranian journalist.\n\nSome experts consider the pain of ordinary people to be a time bomb that the Iranian government ultimately has no power to neutralize. In such circumstances, the Iranian regime is significantly weak and incapable of protecting and securing its interests. Government newspapers now report the smuggling of weapons into Iranian cities on a daily basis..\n\nOn March 1, 2021, the Deputy Commander of Khuzestan Police announced the discovery of more than 4,800 illegal weapons in the province since the beginning of the year.\n\nOn February 22, 2021, the police commander of West Azerbaijan announced the discovery of weapons and ammunition and the arrest of two members of a gang carrying weapons and ammunition on the Urmia-Tabriz road.\n\nHowever, with Biden coming to the White House, Iran’s currency rose against the dollar by 20%. Many Iranian officials had hoped that Biden’s victory would mean a return to the 2015 JCPOA but despite Washington’s soft policy toward Tehran, Iran enhanced its nuclear ambitions. When the US foreign minister said we have a long way to go before rejoining the JCPOA, the dollar climbed again against Iran’s currency.\n\nGlobal condemnation of Iran increased in 2020 as a result of the regime’s handling of the November 2019 uprising. At the United Nations, Canada proposed a resolution condemning the regime’s human rights record that was successfully passed.\n\nIn a letter to Biden, 158 members of Congress condemned the Iranian government’s crackdown on the November 2019 Iranian protests and other human rights abuses and called for a firm policy against the regime.\n\nOn March 25, 2021, 43 senators from both parties also wrote to Biden reminding him of the need to use all the tools of Washington’s diplomatic and economic power to prevent Iran from acquiring a nuclear weapon and furthering its destabilizing activities in the region.\n\nAll these difficulties highlight the basic and inevitable reality for Iran in 2021, a fact that Iranians have highlighted on social media. It shows the prospect of a severe economic crisis, with dried-up trade and collapsed industry, effectively a country in international isolation.\n\nYou Won’t Get Anywhere Else What You Get From CDMedia! Donate!",
          "link": "https://creativedestructionmedia.com/news/middle-east/2021/04/04/the-us-congress-reacts-to-irans-social-dilemma-and-the-nuclear-deal/",
          "published": "2021-04-04T00:00:00"
        },
        {
          "title": "Gab CEO Andrew Torba: Facebook Is Developing Mind Control Technology Using Your Data",
          "text": "Please Follow us on Gab, Parler, Minds, Telegram, Rumble\n\nKeep The Truth Bombs Coming From CDMedia! Donate!",
          "link": "https://creativedestructionmedia.com/news/business/2021/04/04/gab-ceo-andrew-torba-facebook-is-developing-mind-control-technology-using-your-data/",
          "published": "2021-04-04T00:00:00"
        },
        {
          "title": "War Room Pandemic Saturday Show Recap 4/3",
          "text": "Please Follow us on Gab, Parler, Minds, Telegram, Rumble\n\n“When you’re on Facebook or you’re on Twitter you are their lab rat,” said Torba. “You are feeding data and information to train their artificial intelligence to train their machine learning to get them one step closer to their transhumanism goal of becoming gods.” Our guests are: Andrew Torba, Patrick Wood.\n\n“These are not new ideas,” he said. “This kind of thinking has gone on throughout all recorded history.” Our guests are: Mark Jeftovic, Jason Jones, Cheryl Chumley, Rabbi Spero.\n\nRabbi Spero: We Must Fight Transhumanism Like Socialism and Communism.\n\nGoogle Executives Dream of ‘Super AI’ to Rule the World.\n\nGab CEO Andrew Torba: Transhumanism is Good vs. Evil, Tech Oligarchs Want to Be Gods.",
          "link": "https://creativedestructionmedia.com/news/politics/2021/04/04/war-room-pandemic-saturday-show-recap-4-3/",
          "published": "2021-04-04T00:00:00"
        }
      ]
    },
    "fte": {
      "rss": "http://fivethirtyeight.com/politics/feed/",
      "link": "http://fivethirtyeight.com/",
      "articles": [
        {
          "link": "https://fivethirtyeight.com/features/americans-oppose-many-voting-restrictions-but-not-voter-id-laws/",
          "published": "2021-04-02T11:00:00",
          "title": "Americans Oppose Many Voting Restrictions — But Not Voter ID Laws",
          "text": "Welcome to Pollapalooza, our weekly polling roundup.\n\nLast week, Gov. Brian Kemp signed a sweeping package of voting restrictions into law in Georgia. The new regulations — including a ban on giving food and water to voters in line and an ID requirement for absentee voting — drew harsh condemnation from Democrats, voting-rights advocates and corporations for making voting more arduous, particularly for Black voters who will be disproportionately affected. And alarmingly, the laws appear to be inspired by a baseless belief in rampant voter fraud in the 2020 election and designed to make it easier for Republicans to win elections in the future.\n\nThe new voting restrictions many states are considering\n\nBut how many Americans buy into the Republican argument that more “election security” is needed, and how many believe that these laws are undemocratic? On the surface, at least, they are closely divided on the issue of voting access. According to a YouGov/The Economist poll from March 20-23, Americans narrowly oppose “laws that would make it more difficult to vote,” 44 percent to 39 percent. But of course, that’s an extremely broad categorization that covers everything from laws cleaning up the voter rolls to those outright banning no-excuse absentee voting and slashing polling places. Reality is more nuanced: Americans are fine with some voting restrictions but balk at others.\n\nrelated: The States Where Efforts To Restrict Voting Are Escalating Read more. »\n\nFor instance, public opinion is strongly against perhaps the most controversial provision of Georgia’s new law: the prohibition on giving food or water to people waiting in line to vote. In a different, March 29 poll, YouGov found that only 18 percent of Americans thought handing out food and water should be illegal, while 69 percent thought it should be allowed.\n\nLikewise, in the most recent YouGov/The Economist poll (conducted March 27-30), only 33 percent of Americans agreed with the part of Georgia’s new law that makes ballot drop boxes only accessible during early-voting hours. By contrast, 44 percent thought drop boxes should be open at all times. Drop boxes were also popular within Georgia itself. Back in January, a University of Georgia/Atlanta Journal-Constitution poll found that Georgia registered voters opposed banning them 59 percent to 37 percent. While the new law didn’t go that far, it did make them a lot less useful by mandating that they be located inside early-voting centers.\n\nOn the other hand, the public strongly supports one of the other major stipulations of Georgia’s new law: the ID requirement for absentee voting. That latest YouGov/The Economist poll found that Americans support requiring a photo ID in order to vote absentee, 53 percent to 28 percent. And Georgians are even more supportive: 74 percent of registered voters in the UGA/AJC poll backed requiring voters to include a copy of their photo ID or other documentation in order to vote by mail. Only 22 percent were opposed.\n\nIndeed, voter ID laws — which Republicans have pushed for years — are quite popular in general. In another national poll out this week from Selzer & Co./Grinnell College, 56 percent of adults favored keeping laws that require people to show a photo ID before voting, while just 36 percent wanted to eliminate them. And this isn’t an opinion Americans suddenly adopted amid 2020’s specious claims of voter fraud. In fall 2018, the Pew Research Center found that 76 percent of Americans favored requiring everyone to show a government-issued photo ID in order to vote, versus only 23 percent who opposed it.\n\nOne voting restriction that Georgia did not end up enacting was requiring voters to have an excuse in order to vote absentee. Politically, it seems to have been a wise choice to kill that: According to the UGA/AJC poll, Georgians opposed the proposal 55 percent to 43 percent. Nationally, YouGov/The Economist found a nation divided over whether anyone should be able to vote by mail (44 percent) or only people who are unable to vote in person (42 percent), but that poll is an outlier. Selzer/Grinnell found that Americans favor keeping laws that allow mail voting 56 percent to 34 percent, and Pew last year found that 65 percent of the country believed that voters should not need a documented reason to be allowed to vote early or absentee. That wasn’t just because of the pandemic, either: In Pew’s 2018 poll, that number was 71 percent.\n\n‘There’s a reason why … (GOP has) tried to make it harder for people to vote’: Silver\n\nThat said, Georgia’s new law does prevent election officials from actively encouraging absentee voting by prohibiting mailing absentee-ballot applications to voters who don’t request them — something the secretary of state did in last year’s primary in order to encourage mail voting amid the pandemic. According to the UGA/AJC poll, Georgia seems to be split right down the middle on this prohibition: 49 percent are against it and 47 percent are for it. But the public is more firmly against more aggressive promotions of absentee voting, at least on the national level. For example, respondents to the YouGov/The Economist poll opposed mailing absentee ballots to all registered voters (which nine states and Washington, D.C., did in 2020), 59 percent to 24 percent. And per Pew, back in 2018, Americans opposed conducting all elections by mail, 65 percent to 34 percent.\n\nGeorgia is hardly the only state where legislators are considering changing voting laws — either to make them stricter or, in many cases, more accessible. But the complicated public opinion on voting issues just goes to show that not all voting reforms are viewed the same way — and neither party should assume the public is fully on their side.\n\nOther polling bites\n\nWashington’s consternation over potentially abolishing the Senate filibuster doesn’t appear to be shared by the American people. According to a YouGov/Yahoo News poll, 36 percent of adults support ending the filibuster, while only 27 percent oppose it. A whopping 37 percent are unsure. That may be because only 34 percent of adults say they know “a lot” about how the filibuster works; 40 percent say they’ve heard of the filibuster but don’t know how it works, while 26 percent say they know “nothing” about the filibuster.\n\nFor the first time in more than 80 years of Gallup polling, fewer than half of Americans say they are a member of a church, synagogue or mosque: 47 percent, down from 70 percent as recently as 1999. The drop is driven by generational change: While 66 percent of those born before 1946 are still members of a house of worship, only 36 percent of millennials (born 1981-1996) are. That’s roughly the same as the share of millennials with no religious affiliation (31 percent).\n\nIt’s not news that Americans are frustrated with government, but it’s still sobering to see it quantified. According to the Pew Research Center, 53 percent of Americans are “not too” or “not at all” satisfied with the way democracy is working in the U.S. (only 45 percent of Americans are at least somewhat satisfied with it). In addition, 67 percent of Americans think the phrase “most politicians are corrupt” describes their country well. Both numbers are higher in the U.S. than in the three other countries Pew surveyed: the United Kingdom, France and Germany.\n\nThursday was the first day of the 2021 Major League Baseball season, which will look pretty different from past seasons thanks to the coronavirus pandemic. To the approval of 62 percent of MLB fans (per a recent Ipsos poll), every team except the Texas Rangers and Houston Astros will open stadiums to less than half capacity to start the season. But MLB will not mandate proof of vaccination or a negative COVID-19 test in order to attend a game, despite 67 percent of fans supporting such a requirement.\n\nThursday was also April Fool’s Day, a day that this year saw Bud Light “introduce” a pizza-flavored seltzer and the Chicago Bears “trade for” a star quarterback. Probably only about half of Americans appreciated these gags, though: According to YouGov, only 45 percent of adults think April Fool’s Day pranks are generally funny, while 47 percent are no fun and think they’re mostly just annoying.\n\nBiden approval\n\nAccording to FiveThirtyEight’s presidential approval tracker, 54.0 percent of Americans approve of the job Biden is doing as president, while 39.6 percent disapprove (a net approval rating of +14.4 points). At this time last week, 54.3 percent approved and 39.9 percent disapproved (a net approval rating of +14.4 points). One month ago, Biden had an approval rating of 53.9 percent and a disapproval rating of 37.1 percent, for a net approval rating of +16.8 points.\n\nElections to watch in 2021| FiveThirtyEight Politics Podcast\n\nWhat are pollster ratings? | Polling 101 from FiveThirtyEight"
        },
        {
          "link": "https://fivethirtyeight.com/videos/the-2021-elections-that-will-show-us-where-the-parties-are-headed/",
          "published": "2021-04-02T03:02:28",
          "title": "The 2021 Elections That Will Show Us Where The Parties Are Headed",
          "text": "In this installment of the FiveThirtyEight Politics podcast, the crew discusses the 2021 gubernatorial elections in Virginia and New Jersey and California’s likely gubernatorial recall election. They also look at mayoral elections, which are taking place in more than two dozen major cities, and special elections for a handful of vacant House seats."
        },
        {
          "link": "https://fivethirtyeight.com/features/politics-podcast-elections-to-watch-in-2021/",
          "published": "2021-04-01T22:32:59",
          "title": "Politics Podcast: Elections To Watch In 2021",
          "text": "Typically, high-profile election news is scarce the year after a presidential election. The midterms are more than a year away, and the presidential primaries won’t really get underway until after the midterms. Still, there are a number of contests to pay attention to in 2021.\n\nIn this installment of the FiveThirtyEight Politics podcast, the crew discusses the 2021 gubernatorial elections in Virginia and New Jersey and the very likely recall election in California. They also look at the mayoral races taking place in more than two dozen major cities as well as the special elections for a handful of vacant House seats.\n\nYou can listen to the episode by clicking the “play” button in the audio player above or by downloading it in iTunes, the ESPN App or your favorite podcast platform. If you are new to podcasts, learn how to listen.\n\nThe FiveThirtyEight Politics podcast is recorded Mondays and Thursdays. Help new listeners discover the show by leaving us a rating and review on iTunes. Have a comment, question or suggestion for “good polling vs. bad polling”? Get in touch by email, on Twitter or in the comments."
        },
        {
          "link": "https://fivethirtyeight.com/features/why-the-recent-violence-against-asian-americans-may-solidify-their-support-of-democrats/",
          "published": "2021-04-01T11:00:00",
          "title": "Why The Recent Violence Against Asian Americans May Solidify Their Support Of Democrats",
          "text": "Even before the coronavirus became a worldwide pandemic, some astute observers of racial and ethnic politics feared that the emerging outbreak in China would lead to (and were already contributing to) a rise in anti-Asian sentiment in America. After all, the United States has a long and ugly history of scapegoating racial and ethnic groups for diseases in ways that are used to justify xenophobia.\n\nSadly, it didn’t take long for those fears to be realized. Racist harassment online, verbal attacks in public and physical assaults against Asian Americans all surged in the early days of the pandemic and have remained alarmingly high ever since. In fact, anti-Asian hate crimes in the U.S. increased by nearly 150 percent from 2019 to 2020.\n\nHow the Atlanta attacks may activate Asian Americans politically\n\nBut it took the murder of six Atlanta women of Asian descent in March for many to finally realize the seriousness of the problem. According to Google Trends data, Google searches like “Asian Americans” and “violence against Asian Americans” skyrocketed after the shooting. Similarly, the share of respondents in last week’s YouGov/Economist poll who said there is “a great deal” of discrimination against Asian people (33 percent) doubled since YouGov asked this question in March 2020 after reports of COVID-19-related backlash against Asian Americans had initially surfaced.\n\nRelated: The U.S. Has A Long-Standing History Of Vilifying Minority Groups During Times Of Crisis Read more. »\n\nOf course, as the targets of this hatred, Asian Americans have been much more aware of the growing problem. In a June 2020 Pew Research Center poll, 58 percent of Asian Americans said it was more common for people to express racist or racially insensitive views about people who are Asian than it was before the coronavirus outbreak, compared to just 39 percent of all adults. And about half of those surveyed in AAPI Data’s 2020 Asian American Voter Survey also said they worried “very often” or “somewhat often” about experiencing hate crimes, harassment and discrimination because of COVID-19.\n\nThe effect of this hatred has partisan ramifications, too. Asian Americans’ escalating fears of discrimination and harassment during the pandemic will likely solidify their already strong support of Democrats.\n\nThat’s true for a couple of reasons. First, perceptions of discrimination and feelings of social exclusion are strongly linked with how Asian Americans vote. Take, for example, the relationship between Asian Americans who said they perceived discrimination and how they said they would vote in the 2020 presidential election.\n\nOver three-quarters of Asian American and Pacific Islanders voters who thought there was “a great deal” or “a lot” of anti-Asian discrimination in the U.S. supported Joe Biden over Donald Trump in weekly Democracy Fund + UCLA Nationscape surveys conducted from April to September 2020. But only 37 percent of Asian Americans who didn’t think there was any anti-Asian discrimination preferred Biden to Trump in the presidential election.\n\nPolitical scientists Alexander Kuo, Neil Malhotra and Cecilia Mo have argued that Asian Americans who experience discrimination are more likely to support Democrats because they associate social exclusion based on their ethnic background with the predominantly white Republican Party. Take, for example, what Kuo, Malhotra and Mo found in one experiment. Some participants were randomly subjected to a microaggression from a white lab assistant who questioned their citizenship before having them answer a survey that measured political attitudes. The Asian Americans subjected to the microaggression were 13 percentage points more likely than the control group to view the Democratic Party in a positive light.\n\nThis uptick came at the expense, too, of how respondents thought about the Republican Party. That is, the Asian Americans who were subjected to the microaggression were more likely to say that Republicans were close-minded and associate the party with exclusionary treatment. That is something that has been made much more explicit during the pandemic.\n\nrelated: Women Of Color Were Shut Out Of Congress For Decades. Now They’re Transforming It. Read more. »\n\nDemocratic politicians, for instance, have consistently shown far greater concern than their Republican counterparts over the rise in hate directed against Asian Americans during the pandemic— differences that were clearly on display in the 2020 presidential campaign. Then-candidate Joe Biden forcefully condemned President Trump’s repeated use of terms like “Chinese virus” and “kung flu” to describe the coronavirus, warning that such language could endanger Asian Americans.\n\nThere’s evidence to support those concerns, too. Two recent studies found that online animosity and offline hate incidents against Asian Americans heightened after Trump linked China and COVID-19 in his tweets; another study found that Trump’s framing of the pandemic as China’s fault increased anti-Asian sentiments and xenophobia in survey experiments; and there’s evidence, too, that rank-and-file Republicans have become much more hostile toward China during the pandemic — views that experts warn pose a threat to all Asian Americans.\n\nIn total, the prejudice Asian Americans have experienced during the pandemic does seem to have further solidified their already strong support of the Democratic Party. Analyzing data from weekly Nationscape surveys conducted between July 2019 and May 2020, political scientists Nathan Chan, Jae Yeon Kim and Vivien Leung show that Asian Americans moved more toward the Democratic Party than other racial and ethnic groups after Trump first made ethnically inflammatory remarks about the coronavirus. Chan and his colleagues concluded from their findings that exclusionary rhetoric from partisan elites “further cement[s] Asian Americans as Democrats.”\n\nThis certainly doesn’t mean that social exclusion and experiences with discrimination are the only reasons why Asian Americans have overwhelmingly supported Democrats. Nor is it possible to precisely predict how the rise in anti-Asian hate during the pandemic will affect Asian American partisanship in the long run. But, at the very least, Republican rhetoric about the pandemic and the rise in anti-Asian hate over the past year seems to have solidified the longstanding link between Asian Americans’ feelings of social exclusion and their support for the Democratic Party.\n\nPolice misconduct trials are rare. Instead, cities pay millions to settle claims\n\nThe new voting restrictions many states are considering"
        },
        {
          "link": "https://fivethirtyeight.com/features/why-democrats-werent-going-to-reverse-the-result-in-iowa/",
          "published": "2021-03-31T23:35:48",
          "title": "Why Democrats Weren’t Going To Reverse The Result In Iowa",
          "text": "That whoosh you just heard? That was House Democrats breathing a sigh of relief now that Democrat Rita Hart has withdrawn her challenge to contest the result in Iowa’s 2nd Congressional District, which she lost to Republican Mariannette Miller-Meeks by just six votes last November — one of the closest federal elections in U.S. history.\n\nDemocrats were reportedly worried at the prospect of having to vote on whether to unseat Miller-Meeks, especially considering how loudly they protested former President Trump and Republicans’ attempts to overturn the 2020 election earlier this year. Additionally, there were concerns it would undermine Democrats’ efforts to pass a massive voting rights and election reform bill. That, along with the Democrats’ narrow majority, suggested it was going to be very challenging for Democrats to reverse the outcome — even if they felt Hart had a valid case.\n\nThe new voting restrictions many states are considering\n\nMoreover, Republican messaging had put Democrats on the defensive. For instance, House Minority Leader Kevin McCarthy claimed they were trying to “steal” the election, while Senate Minority Leader Mitch McConnell pointedly asked major businesses and organizations that were critical of GOP objections to the Electoral College on Jan. 6 to hold Democrats to “the same standard” for contesting the Iowa result.\n\nRelated: Why Joe Manchin Is So Willing And Able To Block His Party’s Goals Read more. »\n\nThe Iowa situation was pretty unusual, as contested elections are fairly uncommon nowadays — and reversing election outcomes is even rarer. As the table below shows, contested House elections were once a regular occurrence, especially in the years following the Civil War, when many disputes centered on congressional races in the South, according to data compiled by Jeffery Jenkins at the University of Southern California. But now the number has tailed off considerably, averaging barely one case every five congresses.\n\nContested elections used to be far more common Average share of U.S. House seats contested, by decade Years Congresses No. Contested Avg. Seats/Congress Avg. % contested 1789–1798 1–5 18 90 4.0% 1799–1808 6–10 10 128 1.6 1809–1818 11–15 14 167 1.7 1819–1828 16–20 9 202 0.9 1829–1838 21–25 11 230 1.0 1839–1848 26–30 36 233 3.1 1849–1858 31–35 14 234 1.2 1859–1868 36–40 50 205 4.9 1869–1878 41–45 75 273 5.5 1879–1888 46–50 60 312 3.8 1889–1898 51–55 85 347 4.9 1899–1908 56–60 34 375 1.8 1909–1918 61–65 36 418 1.7 1919–1928 66–70 29 435 1.3 1929–1938 71–75 30 435 1.4 1939–1948 76–80 17 435 0.8 1949–1958 81–85 12 435 0.6 1959–1968 86–90 15 436 0.7 1969–1978 91–95 15 435 0.7 1979–1988 96–100 9 435 0.4 1989–1998 101–105 6 435 0.3 1999–2008 106–110 8 435 0.4 2009–2020 111–116* 4 435 0.2 *Includes data for six congresses instead of five.\n\nA contested election indicates a result that was formally disputed in the House. Not all contested races resulted in a different winner. The House reached its current size of 435 seats after the 1910 census, except for the 86th and 87th congresses (1959-1962), when it expanded to include at-large seats from Alaska and Hawaii. The House then returned to 435 seats after the 1960 census and the subsequent reapportionment before the 1962 election. Source: Jeffery Jenkins\n\nIn the past 50 years, the House has voted to reverse an election outcome only once: In 1985, the Democratic-controlled House investigated and recounted the votes in the 1984 election for Indiana’s 8th Congressional District and determined that Democratic Rep. Frank McCloskey had won by four votes after the Republican candidate had led by 418 votes following a state-run recount. The House then voted 236 to 190 to seat McCloskey, prompting House Republicans to stage a walk-out.\n\nBut Democrats had a much larger majority in 1985 than they do today, so they could have afforded 30 or more defections when they voted to seat McCloskey. By comparison, fewer than five Democratic “nays” could have sunk an attempt to seat Hart because Democrats currently hold only a 219-to-211 seat majority. And some Democrats had privately — and even publicly — let it be known they didn’t want to vote to unseat Miller-Meeks.\n\nIn the end, the math wasn’t there for Democrats to reverse the outcome, and the potential fallout doesn’t seem to have been worth it, either.\n\nConfidence Interval: Republicans Will Win Back Congress In 2022 | FiveThirtyEight\n\nPolice misconduct trials are rare. Instead, cities pay millions to settle claims"
        }
      ]
    },
    "wayne": {
      "rss": "http://www.waynedupree.com/feed/",
      "link": "http://www.waynedupree.com/",
      "articles": [
        {
          "link": "https://www.waynedupree.com/2021/04/joe-biden-ga-county-all-star/",
          "published": "2021-04-05T02:02:11",
          "title": "GA County That Voted For Biden Will Now Lose $100 Mil After His Irresponsible MLB Remarks - WayneDupree.com",
          "text": "Joe Biden actively campaigned against the state of Georgia the moment the new election integrity law passed.\n\nTIRED OF THE ADS? BECOME A PREMIUM USER TODAY!!\n\nHere’s what Biden said, leading up to the MLB ultimately deciding to pull their all-star game out of Atlanta.\n\nMORE NEWS: President Trump Just Released an Easter Statement That Sounds Exactly Like a Hilarious Tweet\n\nFrom Forbes Last week, Tony Clark, the executive director of the Major League Baseball Player Association, told the Boston Globe the union was open to having a “conversation” with the league about moving the game out of Georgia in response to the state’s voting legislation.\n\nAsked about Clark’s comments in an interview with ESPN Wednesday evening, Biden said he would “strongly support” MLB changing the location of the game.\n\nPeople look up to athletes for guidance, Biden said, adding: “They’re leaders.”\n\nWill you join President Trump's new social platform when it comes out? Yes No Email Address (required) By completing the poll, you agree to receive emails from WayneDupree.com and that you've read and agree to our privacy policy and legal statement Results Vote\n\nClose More from Wayne Dupree\n\nThe so-called “president” actively campaigned to destroy a state’s economy.\n\nWhat a guy…\n\nI wouldn’t be surprised if Joe’s handlers were the ones behind the entire plot to pull the all-star game, to begin with.\n\n>>>FOLLOW US ON GAB<<<\n\nBut, in a real twist of political irony, a GA county that voted for Joe Biden will now lose $100 million dollars, thanks to Joe’s calculated remarks.\n\nFrom Daily Wire The Georgia county that was set to host the 2020 Major League Baseball All Star Game said over the weekend that it will lose more than $100 million after the league pulled the game and draft out of the state — a decision that comes after Democrats Madeline number of false claims about the state’s new election law and signaled they would support the league boycotting the state. Holly Quinlan, president and CEO of Cobb Travel and Tourism, said that the “estimated lost economic impact” for the county was more than $100 million. “This event would have directly impacted our county and the state, as visitors spend their dollars on local accommodations, transportation, entertainment and recreation, food and retail throughout the county,” Cobb County Travel and Tourism said. “This would have been a big boost to Cobb businesses and help with recovery after the COVID-19 pandemic.” The Atlanta Braves released a statement following the league’s announcement, saying that they did not support the decision and that they were “saddened that fans will not be able to see this event in our city.” “Unfortunately, businesses, employees, and fans in Georgia are the victims of this decision,” the team added.\n\nWow, Joe, that’s a real “Build Back Better” move, Joe.\n\nWhen was the last time you saw a “president” try and destroy a state, out of spite?\n\nHeck, California always trashed President Trump, and he still rushed to their aide whenever they needed help after a devastating wildfire.\n\n***FOLLOW US ON TELEGRAM***\n\nBut Joe and his handlers don’t think that way – it’s all about power and control for them.\n\nHow many American jobs has this bumbling doofus killed?\n\nAt this point, Joe is the #1 Pretend President “job killer” of all time\n\nAttn: Wayne Dupree is a free speech champion who works tirelessly to bring you news that the mainstream media ignores. But he needs your support in order to keep delivering quality, independent journalism. You can make a huge impact in the war against fake news by pledging as little as $5 per month. Please click here Patreon.com/WDShow to help Wayne battle the fake news media."
        },
        {
          "link": "https://www.waynedupree.com/2021/04/hunter-joe-smartest-man-parm/",
          "published": "2021-04-05T01:24:19",
          "title": "The Smartest Man Joe Ever Met Accidentally Smoked \"Parmesan Cheese\" Thinking it Was Crack Cocaine - WayneDupree.com",
          "text": "Remember when Joe Biden said that Hunter was the “smartest man” he’s ever met?\n\nTIRED OF THE ADS? BECOME A PREMIUM USER TODAY!!\n\nHe’s so smart that he doesn’t know “for sure” if the laptop (that has all of his stuff on it) is actually his.\n\nWatch:\n\nJoe Biden: Hunter is the smartest man I know! 🙄 Let that sink in. https://t.co/PqGkUrE7Af — TwitFelon 🐵🙈🙉 (@FelonTwit) April 4, 2021\n\nOf course he knows…they all know that’s Hunter’s laptop.\n\nWill you join President Trump's new social platform when it comes out? Yes No Email Address (required) By completing the poll, you agree to receive emails from WayneDupree.com and that you've read and agree to our privacy policy and legal statement Results Vote\n\nClose More from Wayne Dupree\n\nMORE NEWS: President Trump Just Released an Easter Statement That Sounds Exactly Like a Hilarious Tweet\n\nBut, I want you to think back to that moment when Joe said that Hunter was the smartest man he knows, as I share this new humdinger story with you.\n\nRight now, Hunter is out and about giving lots of interviews.\n\nNo, he didn’t have a change of heart, and decide to come clean about what a sleazeball he is – not even close – he’s just trying to sell his new book.\n\nTypical Biden, always looking to line their pockets, rights?\n\nThe book is a “memoir” about his drug addiction – and a “Dear diary, I’m a poor victim” type book.\n\n>>>FOLLOW US ON GAB<<<\n\nBut during these interviews, Hunter is admitting some pretty humiliating stuff – anything to make a buck, right?\n\nWell, his latest admissions is a real humdinger.\n\nHunter is now admitting before God and country that he once smoked Parmesan cheese because he thought it was crack cocaine.\n\n“Smartest man in the world.”\n\nFrom Breitbart President Joe Biden’s son Hunter Biden admitted during a CBS News interview that he smoked Parmesan cheese after mistaking it for crack cocaine during the height of his addiction. Reporter Tracy Smith said, “You wake up some mornings — I shouldn’t even say some mornings because you slept 15 minutes at a time and be looking for crack and to smoke whatever was there?” Biden said: “I spent more time on my hands and knees picking through rugs smoking anything that resembled crack cocaine. I probably smoked more Parmesan cheese than anyone – than anyone you know, Tracy.” Smith said, “Because there would will be crumbs mixed in?” Biden said, “Yeah, I went one time for 13 days without sleeping, and smoking crack, and drinking vodka exclusively throughout that entire time.\n\nAt this point, it seems almost fitting that Joe thinks Hunter is the “smartest man he knows.” I mean, it all makes perfect sense.\n\nA guy smoking a crack pipe filled with Parm is Joe’s “idol.”\n\n***FOLLOW US ON TELEGRAM***\n\nNow that we know what a buffoon Joe is, doesn’t that just make perfect sense?\n\nI’ll tell you what, I’d be scared to eat pasta with Hunter and Joe – God only knows what they’re sprinkling on their spaghetti…I’m sure it’s NOT parmesan, folks.\n\nAttn: Wayne Dupree is a free speech champion who works tirelessly to bring you news that the mainstream media ignores. But he needs your support in order to keep delivering quality, independent journalism. You can make a huge impact in the war against fake news by pledging as little as $5 per month. Please click here Patreon.com/WDShow to help Wayne battle the fake news media."
        },
        {
          "link": "https://www.waynedupree.com/2021/04/trump-easter-statement-twitter/",
          "published": "2021-04-05T01:03:05",
          "title": "President Trump Just Released an Easter Statement That Sounds Exactly Like a Hilarious Tweet - WayneDupree.com",
          "text": "We all miss having President Trump on Twitter.\n\nTIRED OF THE ADS? BECOME A PREMIUM USER TODAY!!\n\nWe miss his humor, and his wisdom, and all his common-sense insight.\n\nThe good news is that President Trump has started a website where he’s issuing statements almost daily, and his new social media website will be ready by this summer.\n\nMORE NEWS: [VIDEO] Chris Christi Just Dropped a “GA Truth Bomb” on Everyone at ABC News\n\nBut in the meantime, his statements are lighting up the internet – and this one for Easter was probably one of his best ones yet.\n\nTrump’s latest statement has those warm and fuzzy funny feelings from his Twitter days – and he took a massive dig at the liberals…which is always good fun!\n\n>>>FOLLOW US ON GAB<<<\n\nDo you agree Fox News has gone too far to the left Strongly Agree Agree Disagree Strongly Disagree Email Address (required) By completing the poll, you agree to receive emails from WayneDupree.com and that you've read and agree to our privacy policy and legal statement Results Vote\n\nClose More from Wayne Dupree\n\nI think you’ll love it.\n\nTake a look.\n\nAnd don’t you love how he threw in that dig about the election?\n\n***FOLLOW US ON TELEGRAM***\n\nYou know the liberals are tearing their blue hair out over that one!\n\nHappy Easter, everyone!\n\nAttn: Wayne Dupree is a free speech champion who works tirelessly to bring you news that the mainstream media ignores. But he needs your support in order to keep delivering quality, independent journalism. You can make a huge impact in the war against fake news by pledging as little as $5 per month. Please click here Patreon.com/WDShow to help Wayne battle the fake news media."
        },
        {
          "link": "https://www.waynedupree.com/2021/04/chris-christi-ga-vote-abc/",
          "published": "2021-04-04T20:25:51",
          "title": "[VIDEO] Chris Christi Just Dropped a \"GA Truth Bomb\" on Everyone at ABC News - WayneDupree.com",
          "text": "The disinformation that’s coming from the left about the GA voting bill is bordering on a complete “fake news propaganda” campaign.\n\nTIRED OF THE ADS? BECOME A PREMIUM USER TODAY!!\n\nIt’s absolutely ludicrous.\n\nAnd it’s ironic, that the media and social media were so hell-bent on shutting down supposed “fake news” about Hunter Biden’s laptop (it wasn’t fake news, by the way), that they silenced anyone and everyone they could get their communist mitts on.\n\nMORE NEWS: There’s a Very Strategic Reason Why The Royals Are Refusing to Speak to Meghan\n\nNow, we have the MLB pulling out of GA, which will destroy their economy — all based on misinformation.\n\nIt’s a total shambles and just shows what an absolute disgrace our media is.\n\n***FOLLOW US ON TELEGRAM***\n\nWill you join President Trump's new social platform when it comes out? Yes No Email Address (required) By completing the poll, you agree to receive emails from WayneDupree.com and that you've read and agree to our privacy policy and legal statement Results Vote\n\nClose More from Wayne Dupree\n\nAnd today. on ABC News, the fake news started up again, but thankfully this time Chris Christi was there and he shut it all down.\n\nYou can watch the video below:\n\nChris Christie fact checks Democrat mistruths about the Georgia election bill: “that’s just wrong”https://t.co/73HDTRLWDs pic.twitter.com/R5ursK5ynV — RNC Research (@RNCResearch) April 4, 2021\n\nIt’s sad that we need to do this – that we have to do the media’s “supposed” job for them.\n\nWe’re in a propaganda war – and almost everyone in the country is against us.\n\n***FOLLOW US ON TELEGRAM***\n\nKeep fighting – we’ll win in the end. The truth always prevails.\n\nAttn: Wayne Dupree is a free speech champion who works tirelessly to bring you news that the mainstream media ignores. But he needs your support in order to keep delivering quality, independent journalism. You can make a huge impact in the war against fake news by pledging as little as $5 per month. Please click here Patreon.com/WDShow to help Wayne battle the fake news media."
        },
        {
          "link": "https://www.waynedupree.com/2021/04/meghan-royals-wont-speak/",
          "published": "2021-04-04T18:58:31",
          "title": "There's a Very Strategic Reason Why The Royals Are Refusing to Speak to Meghan - WayneDupree.com",
          "text": "A royal expert is speaking out this week to say that there is a reason why the royal family has not reached out to Meghan Markle and Prince Harry in the wake of their explosive tell-all interview with Oprah Winfrey last month.\n\nTIRED OF THE ADS? BECOME A PREMIUM USER TODAY!!\n\nLast month, Oprah’s best friend Gayle King revealed on “CBS This Morning” that Harry had spoken with his father Prince Charles and brother Prince William after the interview aired.\n\n“Well, I’m not trying to break news, but I actually did call them to see how they were feeling, and it’s true, Harry has talked to his brother and he has talked to his father too,” King said. “The word I was given was that those conversations were not productive. But they are glad that they have at least started a conversation.”\n\nMORE NEWS: Right After Posting “He Is Risen” Marjorie Taylor Greene Gets a Disgusting Surprise From Twitter\n\n“And I think what is still upsetting to them is the palace keep saying they want to work it out privately, but yet, they believe these false stories are coming out that are very disparaging against Meghan, still,” she added, “no one in the royal family has talked to Meghan yet, at this particular time.”\n\n.@GayleKing checked in with Prince Harry & Meghan this weekend: “Harry has talked to his brother and he has talked to his father, too. The word I was given was those conversations were not productive. But they are glad that they have at least started a conversation.” pic.twitter.com/fe0ATukkYw — CBS This Morning (@CBSThisMorning) March 16, 2021\n\nWill you join President Trump's new social platform when it comes out? Yes No Email Address (required) By completing the poll, you agree to receive emails from WayneDupree.com and that you've read and agree to our privacy policy and legal statement Results Vote\n\nClose More from Wayne Dupree\n\nAnna Pasternak explained to Fox News that nobody in the royal family has contacted Meghan because they feel that they can’t trust her, as any conversations they have with her would likely be leaked to the press.\n\n>>>FOLLOW US ON GAB<<<\n\n“They don’t trust her,” Pasternak claimed. “They don’t trust that if they do get in touch with her, that’s not going to be reported through CBS. You can’t go on international television, have an audience of nearly 50 million people globally, basically trash the royal family, and then expect them to reach out in good faith. It just won’t work. It would be naïve to think that this interview would prompt the royal family to instantly think, ‘Our institution is all wrong. We’re completely out of date. We need you to help us modernize.’”\n\n“Well, that was never going to happen,” she continued. “The reason the British royal family – the House of Windsor – has survived is because they have been quite ruthless in their survival mode and they’ve stuck to the same traditions and protocols. Harry acknowledged that when he said ‘My brother and my father are trapped’ because he knows nothing is going to change.”\n\n***FOLLOW US ON TELEGRAM***\n\nThis piece originally appeared in UpliftingToday.com and is used by permission.\n\nRead more at UpliftingToday.com:\n\nPiers Morgan Breaks His Silence After Sharon Osbourne Leaves ‘The Talk’ – An ‘Absolute Disgrace’\n\nSuzanne Somers, 74, Reveals That She Has Sex With Her Husband Alan Hamel 3 Times Before Noon – ‘Man, Are We Having Fun’\n\nBindi Irwin Pays Touching Tribute To Her Late Father Steve With Her Baby Daughter’s Name\n\nAttn: Wayne Dupree is a free speech champion who works tirelessly to bring you news that the mainstream media ignores. But he needs your support in order to keep delivering quality, independent journalism. You can make a huge impact in the war against fake news by pledging as little as $5 per month. Please click here Patreon.com/WDShow to help Wayne battle the fake news media."
        }
      ]
    },
    "tnr": {
      "rss": "http://www.nationalreview.com/corner/feed/",
      "link": "http://www.nationalreview.com/",
      "articles": [
        {
          "link": "https://www.nationalreview.com/corner/exclusive-republicans-claim-biden-is-facilitating-chinas-violations-of-iran-sanctions/",
          "published": "2021-04-03T11:30:45",
          "title": "Biden 'Facilitating' Iran Oil Exports to China: Republicans",
          "text": "Conservative lawmakers are concerned that the Biden administration is failing to address China’s evasion of U.S. sanctions on Iranian oil and, worse, that officials could deliberately be turning a blind eye to the violations as a concession to Iran.\n\nReuters reported this week that Iran’s oil exports to China reached 3.75 million tons, or about 1 million barrels per day, which is a recent record for the period following the Trump administration’s sanctions on Iranian oil purchases that took effect in 2019. Although China never stopped importing oil from Iran, the latest numbers represent a huge increase.\n\nThe spike in oil purchases …"
        },
        {
          "link": "https://www.nationalreview.com/corner/a-stray-thought-on-the-2020-election/",
          "published": "2021-04-03T11:30:13",
          "title": "Donald Trump Ukraine Scandal: Did It Help Biden Win?",
          "text": "(Jonathan Ernst, Mark Makela/Reuters)\n\nYesterday, while writing about President Biden’s late-coming conversation with Ukraine’s Volodymyr Zelensky, a thought occurred to me: Had Biden been ducking the man responsible for handing him the White House?\n\nI suppose that the answer is technically “no” — that distinction belongs to Donald Trump — but I think we might underestimate the extent to which the Trump–Ukraine imbroglio influenced the 2020 election. That’s not to say the voters were persuaded to opt for Biden or discard Trump as a result of the substance of the scandal itself. Rather, it’s to suggest that it helped make Biden the choice of Democratic primary voters in early 2020.\n\nAdvertisement\n\nThe impeachment was still fresh at that point, and Trump was seemingly most worried about Biden’s becoming his opponent. That very likely primed Democrats to view Biden as the candidate most able to defeat Trump. Had the former vice president not been so obviously the candidate that the Trump campaign most feared, primary voters might have been less prone to coalesce around Biden as the “electable” candidate when the race winnowed. Biden’s margins of victory in most of the swing states that he won in the general election were razor-thin. Given those margins, it’s easy to imagine Trump walking away with a second term had Bernie Sanders emerged as the Democratic nominee.\n\nThere’s no evidence to suggest that the Ukraine scandal was what cost Trump the presidency, but it seems likely that while trying to destroy Biden in a questionable phone call, Trump helped him to become the Democratic nominee, and ultimately the victor in the election. Yet another timely reminder that character is destiny."
        },
        {
          "link": "https://www.nationalreview.com/corner/vermont-thumbs-its-nose-at-the-constitution/",
          "published": "2021-04-02T21:54:56",
          "title": "Vermont COVID Vaccine Rollout's Racial Preferences Are Unconstitutional",
          "text": "How eager are the politicians running Vermont to prove they’re good antiracists? So eager that they have decided to make the COVID vaccine available to minority groups first.\n\nHans Bader explains in this Liberty Unyielding post that Vermont’s action is flabbergastingly unconstitutional.\n\nWhy do “progressive” politicians do things that are flagrantly illegal and will lead to costly defeats in court? Because it’s other people’s money.\n\nAdvertisement"
        },
        {
          "link": "https://www.nationalreview.com/corner/major-league-baseballs-cowardly-stand/",
          "published": "2021-04-02T21:29:12",
          "title": "Georgia Election Law and Major League Baseball's Cowardly \"Stand\"",
          "text": "MLB commissioner Rob Manfred speaks to the media before announcing the All-MLB team during the MLB Winter Meetings in San Diego, Calif., December 10, 2019. (Orlando Ramirez-USA TODAY Sport)\n\nMajor League Baseball (MLB) commissioner Rob Manfred announced that it would not be holding its 2021 All-Star Game or draft in Georgia as originally planned because of the state’s much — and unfairly — maligned new elections law. Here’s the full statement:\n\nOver the last week, we have engaged in thoughtful conversations with Clubs, former and current players, the Players Association, and The Players Alliance, among others, to listen to their views. I have decided that the best way to demonstrate our values as a sport is by relocating this year’s All-Star Game and MLB Draft. Major League Baseball fundamentally supports voting rights for all Americans and opposes restrictions to the ballot box. In 2020, MLB became the first professional sports league to join the non-partisan Civic Alliance to help build a future in which everyone participates in shaping the United States. We proudly used our platform to encourage baseball fans and communities throughout our country to perform their civic duty and actively participate in the voting process. Fair access to voting continues to have our game’s unwavering support. We will continue with our plans to celebrate the memory of Hank Aaron during this season’s All-Star festivities. In addition, MLB’s planned investments to support local communities in Atlanta as part of our All-Star Legacy Projects will move forward. We are finalizing a new host city and details about these events will be announced shortly.\n\nWhat a humiliating spectacle for the league and the country. Manfred doesn’t state what the MLB’s problems with the bill are because he either can’t or is embarrassed to have to articulate them out loud. The move comes after President Biden — who called the law “Jim Crow on steroids” — said he agreed with the suggestion that the MLB move the All-Star Game, and as he continues to deceive the public about the legislation’s contents. Here’s the Washington Post‘s Glenn Kessler on the president’s mendacity. First he quotes Biden:\n\n“What I’m worried about is how un-American this whole initiative is. It’s sick. It’s sick … deciding that you’re going to end voting at 5 o’clock when working people are just getting off work.” (March 25) “Among the outrageous parts of this new state law, it ends voting hours early so working people can’t cast their vote after their shift is over.” (March 26) “You are going to close a polling place at 5 o’clock when working people just get off. This is all about keeping working folks and ordinary folks that I grew up with from being able to vote.”\n\nThen Kessler responds to the president’s claims:\n\nIn reality, Election Day hours were not changed and the opportunities to cast a ballot in early voting were expanded. The law made a modest change, replacing a vague phrase “normal business hours” — presumed to be 9 a.m. to 5 p.m. — to a more specific 9 a.m. to 5 p.m. time period. (Some rural county election offices worked only part time during the week, not a full eight-hour day, so the shift to more specific times makes it clear they must be open every weekday for at least eight hours.) But that’s the minimum. Under the new law, counties have the option to extend the voting hours so voters can start casting ballots as early as 7 a.m. and as late as 7 p.m. — the same as Election Day in Georgia. Moreover, an additional mandatory day of early voting on Saturday was added and two days of early voting on Sunday were codified as an option for counties. The White House did not provide an explanation for Biden’s erroneous statement, which has turned up in a news conference, an official statement and an interview. Astonishingly, at an April 1 news briefing, White House press secretary Jen Psaki defended the president’s comment, incorrectly arguing “it standardizes the ending of voting every day at 5, right?”\n\nThe truth is that the Georgia bill codifies drop boxes for ballots as a permanent feature of the state’s voting system (prior to 2020 and the COVID-19 pandemic they had never been used there before), expands early voting, and institutes a voter ID requirement that is broadly supported by Americans of all races. Jim Crow it is not, much less a performance-enhancing drugged-up version of it.\n\nClearly Democrats, even the supposedly moderate and decent Joe Biden, will continue to tendentiously stoke fears and pressure private citizens in pursuit of certain political ends. It’s on us, then, to show some courage in standing up to this demagoguery and standing for a pluralistic, liberal society.\n\nJust don’t count on Rob Manfred to join us."
        },
        {
          "link": "https://www.nationalreview.com/corner/arent-you-forgetting-someone-or-two-or-three-or/",
          "published": "2021-04-02T21:01:46",
          "title": "New York Times: Michelle Goldberg's Matt Gaetz Tweet Is Wrong",
          "text": "The New York Times building in New York City, August 3, 2020. (Shannon Stapleton/Reuters)\n\nMichelle Goldberg, the New York Times columnist, can be thought-provoking. Take the following as an example:\n\nIf Matt Gaetz was a Democrat he'd have to resign immediately, but the Republican who pulled a gun on his wife and pressured his mistress to have an abortion is still there so maybe he can gut it outhttps://t.co/QY8YESaghg — Michelle Goldberg (@michelleinbklyn) April 2, 2021\n\nThat tweet leaves me pondering important questions like, “Which world is it that Michelle Goldberg inhabits?” Because it certainly isn’t this one.\n\nMatt Gaetz is a disgrace. So is Scott DesJarlais, the congressman to whom Goldberg refers. But how on earth can a New York Times columnist suggest that those two would have to resign if they were Democrats while New York governor Andrew Cuomo remains in office? Cuomo is responsible for a catastrophic policy error that led directly to the deaths of his constituents, covering up that mistake, and providing for the preferential treatment of his family during a pandemic, as well as being accused of numerous allegations of sexual misconduct. A few other names of Democrats who didn’t resign that Goldberg might remember: Bill Clinton, Ted Kennedy, Chris Dodd, Ralph Northam.\n\nAdvertisement\n\nIt’s obviously true that partisans of stripes both red and blue are reticent to hold their own to account. Submitting that only Republican officeholders can get away with improper or heinous acts, though, is manifestly silly."
        }
      ]
    },
    "trs": {
      "rss": "http://therightscoop.com/feed/",
      "link": "http://therightscoop.com/",
      "articles": [
        {
          "link": "https://therightscoop.com/must-watch-chris-christie-and-sarah-isgur-utterly-end-biden-dems-media-over-georgia-voting-law-with-facts-receipts/",
          "published": "2021-04-05T00:59:43",
          "title": "MUST WATCH: Chris Christie (and Sarah Isgur) UTTERLY END Biden, dems, media over Georgia voting law, with FACTS & RECEIPTS",
          "text": "This is completely amazing. It’s the best, total, utter, devastating takedown I’ve seen on the news in forever. It’s the must-watch clip of the year so far. Totally, totally fantastic.\n\nAnd I don’t want to hear even a whisper of whining from anyone about how Christie was mean to Trump or too nice to Biden or whatever your grievance is. This is way too important and way too good. You’ll watch it and you’ll like it. End of discussion.\n\nBecause Christie SMASHES the lies and myths about the law. The liberal panelists KNOW it. They become FRANTIC about it.\n\nHere’s an example: “Drop boxes now become a permanent part of the Georgia landscape, they were not prior to Covid. They are now,” he said. One of the libs pathetically tried to respond to that by saying there are not ENOUGH drop boxes.\n\nNot enough? They didn’t even get rid of them? In fact they ENABLED them PERMANENTLY?? That’s a preeetttttyyy long from “suppression” don’t y’all think?.\n\n“Minimum of 17 days of early voting, including two Saturdays and two optional Sundays,” he points out. So much for that “suppressing the black voter” myth about shutting down weekends.\n\n“You’re going to have all voters being able to have multiple ways to prove who they are, driver’s license, last four numbers of your Social Security number, even a utility bill or a free ID provided by the state of Georgia” he points out. So much for “African-American voters won’t know how to use numbers on their drivers license” bigotry from the left.\n\n“Stacey Abrams, by the way, Stacey Abrams was in New Jersey, in my state, praising Phil Murphy this week for a voting law where New Jersey early voting is nine days. Half, half of what Georgia is. Yet she’s on TV in New Jersey — I saw it myself — saying that this is one of the greatest voting expansion bills we’ve ever seen, but this is Jim Crow? I’m sorry, George.”\n\nThat is just a KABOOM.\n\nWhen Yvette Simpson says the stupid water thing it really gets crazy.\n\n“A hundred and fifty feet, where, in New Jersey, in Chicago and any place else in the country, you’re not — he’s saying partisan groups cannot do electioneering by giving out food and water. And in the Georgia bill says that there can be water provided by the state of Georgia, just not by partisan groups,” Christie explains to the libs.\n\nSarah Isgur says it may be a dumb provision but “it’s not a threat to democracy.”\n\nSimpson, giving the game away, says “Every time you try to restrict voting rights it’s a threat to democracy.”\n\nSee how they are trying to work it? Devious and evil. Isgur responds “But that’s not restricting voting rights.”\n\nRight. And yet the libs continue to say that it is, facts be damned.\n\nThe part where Christie just KEEPS calling Joe Biden a LIAR is also pretty great.\n\nHere’s the full transcript.\n\nCHRIS CHRISTIE, ABC NEWS CONTRIBUTOR: Listen, it’s just a symptom, George. It’s a symptom of what’s going on in our country right now.\n\nI mean, let’s talk about what the Georgia law is really about because we haven’t had much of that. Drop boxes now become a permanent part of the Georgia landscape. They were not prior to COVID. They are now.\n\nMinimum of 17 days of early voting, including two Saturdays and two optional Sundays. You’re going to have all voters being able to have multiple ways to prove who they are, driver’s license, last four numbers of your Social Security number, even a utility bill or a free ID provided by the state of Georgia, and voting is going to be until — from 7:00 a.m. to 7:00 p.m. as it is right now in Georgia.\n\nThis is what we —\n\nSTEPHANOPOULOS: So, what is this a symptom of? It sounds like you’re against —\n\nCHRISTIE: It’s a symptom of, it’s a symptom of this, George. And I hate to come in here this morning to say this because I sat here and listened to the president’s inaugural address. And I just want a couple of real quick points from it.\n\nPolitics need not be a raging fire that destroys everything in its path. Every disagreement doesn’t have to be a cause for total war, and we must reject a culture in which facts themselves are manipulated or made up.\n\nAnd Joe Biden’s broken his own rule, 84 days. And now, he’s lying to the American people, George. He’s lying about this bill. He’s lying to the American people about it to cause the raging fire he said he was going to put out. I’m very disappointed.\n\nSTEPHANOPOULOS: Yvette, he did make some misstatements about the bill. The bill basically, though, restricts access to early — not to early voting but to absentee ballots, but it does expand early voting.\n\nYVETTE SIMPSON, ABC NEWS CONTRIBUTOR: Well, I mean, it depends on how you think about it. You know, you have to pick between a Saturday or a Sunday and what we know about early voting is a lot of folks appreciate, expect and depend on that weekend voting. We know that Sundays are a time when a lot of churches do go.\n\nSo, the fact that you have to pick between the two is a challenge. It still does not address voter purging which is a big significant issue and there are not enough drop boxes, in fact. Part of the challenge was, yes, you’ve solidified it, but no, you have not provided sufficient drop boxes for folks.\n\nSo, it — let’s stop and back up and say, first, the motivation was not to do more. The motivation was actually to do less.\n\nWe know that voter fraud was not an issue. And so, this just the motivation enough was enough, and I don’t think this goes far enough. I think that, you know, what do we need to do to make sure early voting gets expanded? Seventeen days is not enough early voting.\n\nCHRISTIE: Well, Stacey Abrams, by the way, Stacey Abrams was in New Jersey, in my state, praising Phil Murphy this week for a voting law where New Jersey early voting is nine days. Half, half of what Georgia is.\n\nYet she’s on TV in New Jersey — I saw it myself — saying that this is one of the greatest voting expansion bills we’ve ever seen, but this is Jim Crow? I’m sorry, George.\n\nSTEPHANOPOULOS: She’s not — she’s not for moving the all-star game.\n\nBut, Sarah, one of the interesting things we’re seeing here is not just Major League Baseball. It’s Delta. It’s Coca-Cola. It does appear here that corporate America is out of step with the Republican base.\n\nSARAH ISGUR, ABC NEWS ANALYST: That’s certainly true, but I think that Republicans have stumbled on a pretty good message here which is Delta, Coke, et cetera, these corporations coming out and condemning the Georgia bill, which, as you said, is ridiculous compared to other states. Delaware, Joe Biden’s home state, didn’t even have early voting in 2020. They won’t have it until 2022. They’re condemning that. They’re condemning this Georgia bill without really understanding it. Joe Biden has been labeled a recidivist liar for what he has said about the bill by the fact checking organizations.\n\nAnd what about China? We have actual concentration camps going on in China and these corporations won’t say word one about it. And the hypocrisy of that, I think, is very clear to a Republican base that this isn’t about whether the feel strongly about a Georgia bill that doesn’t do what the Democrats are afraid it will do and it doesn’t do what the Republicans want it to do, by the way. But, at the same time, unwilling to say word one about China because that’s where the money is.\n\nGEORGE STEPHANOPOULOS, ABC “THIS WEEK” ANCHOR: They wouldn’t be doing it if it wasn’t in their corporate interest.\n\nYVETTE SIMPSON, DEMOCRACY FOR AMERICA CEO AND ABC NEWS CONTRIBUTOR: Yes.\n\nRAHM EMANUEL, (D) FORMER MAYOR OF CHICAGO AND ABC NEWS CONTRIBUTOR: Well, the — you’ve got to put this in a lineage. Also, if you go back four years ago, when North Carolina changed their laws as related to bathrooms, corporations then took a — pressure in isolating North Carolina. That’s also the situation here. It’s a shot across the bar to every other state that’s looking at changing the laws. They’re trying to fix the problem that did not happen.\n\nSIMPSON: Right.\n\nEMANUEL: And one of the worst part — that is the fundamental. There was no problem and they’re coming up — it’s like — they’re coming up with the solution to a problem that doesn’t exist. And it’s a shot across the bow to a bunch of other states. And the worst case that this bill, which none of you have mentioned, is the fact that the state legislature wants to overrule both the secretary of states (INAUDIBLE). They’re — for what — what other reason. I’ll repeat what I said last week, which is, if Donald Trump would have won Georgia, there’d be no change in the law. And the fact that because Joe Biden won that this is — look, it’s a, you know —\n\nISGUR: If Joe Biden and Stacey Abrams were saying that, I think we’d have a very frank (ph) conversation.\n\nCHRIS CHRISTIE, (R) FORMER GOVERNOR OF NEW JERSEY AND ABC NEWS CONTRIBUTOR: Right.\n\nEMANUEL: I have no problem fixing the — there’s a lot of problems to fix. This was not a problem to fix.\n\nISGUR: But they’re not. Joe Biden said, it ended early voting. It doesn’t end early voting.\n\nCHRISTIE: This is — it expands early voting in Georgia. The president said it ended it.\n\nListen, he’s what Joe Biden’s got to live with when he wakes up this morning on Easter morning. He is doing exactly what he sat around in the campaign and the transition and accused Donald Trump of doing. He is lying to cause racial divisions in this country. That’s what he accused Donald Trump of doing and he’s a liar and a hypocrite this morning (ph).\n\nEMANUEL: Yes, wait — so, hold on — hold on —\n\nSTEPHANOPOULOS: Then how do you explain why Major League Baseball is making the move?\n\nCHRISTIE: It’s a business judgment, George. It’s a business judgement. Major League Baseball has to make a decision about what is in their best business interest. And I’m sure that’s what —\n\nEMANUEL: Chris —\n\nCHRISTIE: I haven’t spoken to anybody there, but I’m sure it’s what this is (ph).\n\nSTEPHANOPOULOS: If it — if it’s in their best business interest, doesn’t that suggest that there’s something wrong with the law?\n\nCHRISTIE: No. What it suggests is that’s the climate in this country right now. That’s the climate of what it is.\n\nSIMPSON: You should ask the people who know. You should ask the people who know. I’ve been doing voter protection for 10 years. Just the idea that you can’t give people water in line. I know people’s babies —\n\nCHRISTIE: No, that’s just not true.\n\nISGUR: That is (INAUDIBLE) —\n\nCHRISTIE: That’s not true.\n\nSIMPSON: I have held people’s babies while they go in to vote in order to enfranchise the vote. Do it by — do it by all (INAUDIBLE).\n\nCHRISTIE: You can’t do electioneering — excuse me. That’s — I’m sorry, that’s just wrong.\n\nEMANUEL: I’m —\n\nSTEPHANOPOULOS: Well, within 20 — I think it’s within 25 feet.\n\nCHRISTIE: A hundred and fifty feet, where, in New Jersey, in Chicago and any place else in the country, you’re not — he’s saying partisan groups cannot do electioneering by giving out food and water. And in the Georgia bill says that there can be water provided by the state of Georgia, just not by partisan groups.\n\nEMANUEL: Two things, George.\n\nISGUR: Also, look, that’s a stupid part of the bill, but it’s not a threat to democracy.\n\nCHRISTIE: And this is the kind of stuff that —\n\nEMANUEL: Two things. Two things. Two things. Two things.\n\nSIMPSON: Every time you try to restrict voting rights it’s a threat to democracy.\n\nISGUR: But that’s no restricting voting right.\n\nCHRISTIE: (INAUDIBLE)\n\nEMANUEL: Two things.\n\nSIMPSON: And the fact that they didn’t address the elephant in the room, which is voter purging. A hundred an ninety-eight thousand African-Americans Georgians were purged from the rolls.\n\nEMANUEL: Well, wait —\n\nISGUR: But that’s now what Joe Biden and Stacey Abrams have been complaining of.\n\nCHRISTIE: Yes, look —\n\nSTEPHANOPOULOS: Rahm.\n\nEMANUEL: I feel like a middle child at a dinner or breakfast.\n\nSIMPSON: Always.\n\nSTEPHANOPOULOS: You really have a hard time getting in.\n\nEMANUEL: Two things.\n\nCHRISTIE: Yes, everyone feels bad for you, Rahm.\n\nEMANUEL: One is — one is you said that corporate America is out of step with the Republican Party. Corporate America has no home in the Republican Party anymore. And this is the first of many times where corporate America is going to make a clear decision. And it’s a wakeup call to every other state.\n\nSecond is, Joe Biden is not a liar.\n\nCHRISTIE: Yes, he is.\n\nEMANUEL: No, no, no.\n\nSIMPSON: (INAUDIBLE).\n\nEMANUEL: And coming from a — you know, we just spent four years with a person who had literally couldn’t find the truth if it actually — it went choo-choo in front of him in the morning.\n\nCHRISTIE: Is —\n\nEMANUEL: Joe Biden, you may disagree with his characterization.\n\nCHRISTIE: Did we restrict early voting?\n\nEMANUEL: He is not a lie.\n\nSIMPSON: It does restrict early voting.\n\nEMANUEL: You may disagree with his characterization. That bill is only done — passed for one reason, because Joe Biden won Georgia and the two senators won Georgia.\n\nCHRISTIE: He lied. He lied, Rahm, and he’s going to have to live with it.\n\nEMANUEL: That is not. He has not.\n\nCHRISTIE: Yes, he is."
        },
        {
          "link": "https://therightscoop.com/cbs-news-keeps-going-further-this-time-a-softball-hunter-biden-interview-that-suggests-laptop-scandal-a-rumor/",
          "published": "2021-04-04T22:16:47",
          "title": "CBS News keeps going further. This time, a softball HUNTER BIDEN interview that suggests laptop scandal a ‘RUMOR!’",
          "text": "\n\n\n\n\n\n\n\nCBS News is messing up so much I upgraded them to their own Right Scoop tag. From their flat-out leftwing activism in Georgia to their straight up deception about Gov. Ron DeSantis, it’s been a heckuva few days for CBSN.\n\nToday, on CBS News Sunday Morning, they took another dip in Propaganda Ocean in a pathetic, pandering, pretend interview with Hunter Biden.\n\nFrom Newsbusters:\n\nThe interview allowed a scant 26 seconds about the ongoing investigation into Hunter Biden’s finances. “What is it about? Can you say anything more?” Smith inquired. Biden insisted he was innocent and she politely moved on.\n\n\n\n\n\n\n\nShe moved on to talk about Burisma, asking if he understood that the controversy was the dumb fault of the stupid people who could see it. “Optics” she said. Then after he said how definitely much he didn’t do anything wrong and no “serious” journalist would say otherwise, “reporter” Tracy Smith narrated over the laptop story that despite his obviously reassuring innocence “the rumors lived on.”\n\nRUMORS she said. as the New York Post was onscreen.\n\nSee the Post is now trash to the media for running the Hunter story. A legit story by any measure, but Twitter and Google didn’t like it because Joe Biden didn’t like it, and he’s WAY better than Trump so….\n\nGag. There is no shame in these so-called journalists. They are truly the enemy of the people. The enemy of people, period."
        },
        {
          "link": "https://therightscoop.com/just-a-day-after-performative-wokeness-in-georgia-mlb-inks-major-deal-in-commie-china-with-anti-democracy-firm/",
          "published": "2021-04-04T20:12:48",
          "title": "Just A DAY after performative wokeness in Georgia, MLB inks major deal in COMMIE China with anti-Democracy firm",
          "text": "\n\n\n\n\n\n\n\nThe execs at Major League Baseball moved the All-Star game under pressure not from fans or players but from people like Michael Moore and Keith Olbermann. They claimed it was because of their values about Democracy or whatever. The next day they closed a deal with a major CCP-connected and -backed tech company.\n\nSome values. The company, Tencent, previously dropped a deal with the NBA because one executive said he supported pro-democracy protests in Hong Kong. They punished the NBA for supporting democracy.\n\n\n\n\n\n\n\nSo MLB is cozying up with a firm that literally opposes Democracy, and is backed by (run by) an oppressive regime that currently spends its non-baseball time operating concentration camps.\n\n“Fair access to voting continues to have our game’s unwavering support,” they said, in attacking Georgia. Tell that to Hong Kong and the Uyghurs.\n\nMike Pompeo hit them on Twitter for it yesterday.\n\nInteresting side note? The state they are punishing, Georgia, has 4 of the top 20 highest percentage African-American cities in the U.S. Exactly who are privileged whites Michael Moore and Keith Olbermann trying to punish, here?"
        },
        {
          "link": "https://therightscoop.com/gestapo-is-not-allowed-here-this-pastor-righteously-commands-covid-cops-get-thee-out-of-his-church/",
          "published": "2021-04-04T18:14:13",
          "title": "‘GESTAPO is not allowed here!’: This pastor righteously commands Covid Cops GET THEE OUT of his CHURCH",
          "text": "\n\n\n\n\n\n\n\nAn appropriate video for Easter, I think. The righteous wrath of this pastor defending his flock’s right to worship the Lord in the house of God. Canadian police and some kind of health inspector/enforcer invaded a Good Friday service.\n\nBut Artur Pawlowski, the Pastor of the Cave of Adullam Church in Calgary, Alberta, Canada refused to allow the worship service to be halted and interrupted for whatever stupid, government mandated intimidation was about to go on.\n\n“OUT NAZI!” he says many times. “Nazis are not welcome here! Getstapo is not welcome here!”\n\n\n\n\n\n\n\n“Unbelievable, sick, evil people. Intimidating people in a church during the passover! You gestapo nazi communist fascists! Don’t you dare coming back here!” he says.\n\n“Passover. The holiest Christian festival in a year,” he says to the person filming after getting the Health Inspector and cops out of his church, “and they’re coming to intimidate Christians during the holiest festival? What is wrong with those sick psycopaths?!”\n\nHe added more as the filming continued.\n\n“Unbelievable. We’re living in a total takeover of the government with their thugs, goons, the brown shirts, the Gestapo wannabe dictators,” an incredulous Pawlowski said. “Coming to the church armed with guns and tasers and handcuffs to intimidate during Passover celebration? Well, I guess that’s what it is, they want to enslave us all like the Egyptians did. They want to be the Pharaohs of today, that’s what they’re doing. Unbelievable. People, if you don’t stand up, wake up, wow. I don’t know what will happen tomorrow.”\n\nThis here is what the kids call “epic.” It’s also important, and honestly, actually epic. It is time to throw off the yoke of oppression. To lift every voice in defiant praise and worship. They are sending ARMED ENFORCERS into CHURCHES.\n\nAnd it ain’t just Canada, y’all."
        },
        {
          "link": "https://therightscoop.com/heaven-rejoices-jesus-has-risen/",
          "published": "2021-04-04T17:01:49",
          "title": "Heaven Rejoices: Jesus has risen!",
          "text": "\n\n\n\n\n\n\n\nJesus is risen and Heaven truly rejoices at what Jesus has just done!\n\nA lot of times we think about the resurrection of Jesus from the perspective of Mary, the disciples, and the others who followed Jesus. But today I want you to think about it from the perspective of God the Father Himself.\n\nAs we pointed out on Good Friday, this Passion of Jesus was God’s rescue plan that He’d begun after Adam and Eve rejected Him in the Garden. They broke our perfect communion with God, and it was God’s overwhelming desire to reunite us with Himself because of His unfailing and immeasurable love for us.\n\n\n\n\n\n\n\nAnd now that is accomplished! Jesus suffered a horrible and torturous death, becoming the one sacrifice that frees us from the bondages of sin! What Satan tried to destroy in the garden, Jesus has restored in a way that can never be undone!\n\nSo what does this really mean? It means that the Cross of Jesus is now the key that opens wide the gates of Heaven, welcoming those of us who, like the prodigal son, find our way back to God. It means that we are no longer separated from Him, that we can now be reunited with the One who loves us more than we can truly understand this side of Heaven.\n\nGod’s will has been done. The chalice of His mercy has been fully poured out on His creation.\n\nI think God the Father must’ve been ecstatic with joy! In human terms, I’d like to think God and all the angels was doing cartwheels in Heaven after what Jesus, the Son, had accomplished. And on the morning of the resurrection, His Joy was revealed in raising Jesus from the dead, giving life to the new Church that would take this great news to the world, busting down the gates of hell and snatching more and more people from Satan’s grasp!\n\nToday is indeed a day of celebration! Praise God in Heaven for what He has truly given us!"
        }
      ]
    },
    "rds": {
      "rss": "http://www.redstate.com/feed/",
      "link": "http://www.redstate.com/",
      "articles": [
        {
          "link": "https://redstate.com/bonchie/2021/04/04/i-dont-normally-write-on-brian-stelter-but-this-warrants-an-exception-n355476",
          "published": "2021-04-04T23:00:00",
          "title": "I Don't Normally Write on Brian Stelter, but This Warrants an Exception",
          "text": "CNN’s Brian Stelter is quite the character, and I don’t mean to suggest that he’s actually interesting. Rather, he’s a parodic figure who embodies all the absurdities of left-wing media bias into one, larger-than-normal body.\n\nFor the past year or so, I’ve observed an unwritten, self-imposed rule of not really writing about the CNN host (no, he’s not a journalist by any objective definition). But sometimes he does something so ridiculous that it warrants an exception. Today was one of those days.\n\nWith Hunter Biden, Joe Biden’s corrupt, crack addict son, releasing his memoir, I expected some stupid reactions from networks like CNN. I’m not sure I expected this, though.\n\nDude is literally squeeing over a book by a corrupt drug addict. https://t.co/yqpEQXJKoW — Bonchie (@bonchieredstate) April 4, 2021\n\nYes, that’s a grown man calling a book ostensibly written by Hunter Biden “breathtaking” as if it’s anything more than yet another Biden family grift. Stelter swoons over Hunter’s “extraordinary” journey from crack-addled corruptocrat to — hang on let me check my notes — crack-addled corruptocrat? Truly, the lack of growth is a testament to the human will.\n\nStelter then frames the bad press Hunter has received, all of which has been true and deserved, as “tabloid” coverage. And of course, that big bad Fox News is always picking on the president’s son. I mean, it’s not like he’s been in league with Chinese communists, got kicked out of the military for drug use, or tried to abandon a stripper he got pregnant. Oh wait, he actually did do those things.\n\nBut the real story here, as told by Stelter, is that Hunter is a victim. He’s a victim of the “right-wing,” never mind that the negative reports about his business dealings and abandoned laptop are completely true and verified. CNN wants you to know that Hunter has changed. Heck, he wrote a book, and if you write a book to make a few million bucks off an advance, then truly, a reformation must have occurred.\n\nMeanwhile, back in the real world, Hunter Biden is every bit the low-life he’s always been. No amount of squeeing from the potato section on CNN is going to change that."
        },
        {
          "link": "https://redstate.com/bonchie/2021/04/04/a-reporter-goes-to-the-movies-post-covid-and-its-the-most-beta-thing-ive-ever-seen-n355438",
          "published": "2021-04-04T20:00:12",
          "title": "A Reporter Goes to the Movies Post-COVID, and It May Be the Most Beta Thing I've Ever Seen",
          "text": "How bad has ridiculous, unevidenced COVID panic hit some people? A reporter for the San Francisco Chronicle was helpful enough to show us via his own experience. Dan Gentile was given the assignment to go watch Godzilla vs. Kong, and his description of how it went may be the most beta thing I’ve ever seen. It’s also very instructive, as I’ll explain.\n\nYes, people like this actually exist.\n\nI don’t know Gentile’s age, but judging from his picture, I’d guess he’s no more than 40 years old. He is also not obese (around 80% of COVID hospitalizations have happened to obese individuals). That means he’s in an age and weight range that has an extremely small chance of suffering any real complications from COVID. That doesn’t mean the coronavirus isn’t dangerous, but it does mean the level of danger varies wildly depending on one’s age and condition. Recognizing that reality should allow people to judge their risk, and act accordingly.\n\nWell, I said it should allow that. Instead, Gentile has a “biking mask,” something that is completely pointless and not at all backed by science. Studies have continually shown that outdoor spread of COVID is minimal to non-existent, but it’s especially non-existent when you are sitting on a bike alone, riding down the street.\n\nAt least he admits he’s neurotic, so that’s progress, I suppose. Yet, if people are labeling him the “COVID police,” that means he’s spreading his false gospel to others, chastising them for making rational choices. That’s not helpful to anyone.\n\nGentile proclaims in his article that he’s been surprised to learn movie theaters aren’t super-spreaders.\n\nAs someone who follows entertainment news for a living, I’ve been surprised not to hear of any super-spreader events linked to theaters, which would be crippling to an already kneecapped industry. A recent article in The Atlantic calls theaters a gray zone, citing several experts who say since there’s little talking, masks and distancing are effective.\n\nThat’s basically been the theme of the pandemic for much of the left – lots of people making lots of assumptions not at all tested or proven in any scientific manner. This is how you get outdoor venues requiring masks or schools being shut down for almost a year in New York, despite experts and real-world data showing spread is simply not a statistical issue in those situations. Meanwhile, state and local governments shoved people in their homes via lockdown orders, despite that being the place where spread is most prevalent.\n\nIn short, what Gentile’s article shows is just how irrational the messaging around the coronavirus has been. We’ve known since the first few months of the pandemic where the virus primarily spreads. We’ve had ample real-world data on who it actually is a serious threat to for almost that long. But because fear sells, and panic provides cover for politicians, we haven’t acted in a way that rationally measures risk.\n\nThus, you get guys wearing “biking masks” and freaking out about going to the movies even as the pandemic is clearly waning. Welcome to America."
        },
        {
          "link": "https://redstate.com/nick-arama/2021/04/04/jim-acosta-complains-about-post-trump-stress-disorder-to-brian-stelter-then-really-goes-over-the-slide-n355399",
          "published": "2021-04-04T19:30:32",
          "title": "Jim Acosta Complains About 'Post Trump Stress Disorder' to Brian Stelter, Then Really Goes Over the Slide",
          "text": "It’s been clear that CNN and other liberal networks are out at sea without President Donald Trump in office to attack any more.\n\nTheir ratings have gone right into the dumpster, as well, without him to bash; their “Two Minutes of Hate” isn’t quite the same.\n\nBrian Stelter even tried to push hating on Tucker Carlson as a declared, substitute hate object for Trump, but that didn’t seem to gain much steam, and Stelter’s effort fell flat.\n\nSo, what did Jim Acosta do when asked by Brian Stelter on ‘Reliable Sources’ what their lives and their coverage were like, now that it wasn’t all about Trump? What did they talk about? Trump.\n\nNEW: CNN's Brian Stelter and Jim Acosta discuss their struggles with \"post-Trump stress disorder,\" and admit that journalists are having a hard time finding interesting content with Trump no longer in the White Housepic.twitter.com/BHwlYWalPY — Breaking911 (@Breaking911) April 4, 2021\n\nAcosta claimed he had “post-Trump stress disorder.” He then said that they did news “pretty well” before Trump — and that they could cover news without him. But then immediately proved that he couldn’t by talking about Trump.\n\nPlus, seriously? They equate their little temper tantrums about Trump and doing their jobs, badly, with actual post-traumatic stress disorder,… people who suffered real trauma in battle.\n\nCNN has Post-Trump Ratings Disorder 🔻https://t.co/T0jOMfzpYo — Kyle Becker (@kylenabecker) April 4, 2021\n\nThat’s the real problem; they’re desperately searching for ratings. Imagine if they actually did their jobs? Covered all the things going on with the border crisis, plus all the questions about Joe Biden. Of course, then they’d have to be real journalists and not Democratic operatives, so that might be a problem. But, Trump lives completely rent-free in their heads.\n\nCNN’s @Acosta on Biden infrastructure bill: “As far as I’m concerned, can we just have a damn high-speed train in this country? I mean, can I please get to New York from Washington without problems on the Acela? And can I get on the Wifi by the way?\" pic.twitter.com/0CaEDikDXx — Tom Elliott (@tomselliott) April 4, 2021\n\nAcosta also complained about the hardship of taking the train from New York to Washington, D.C., which I guess was his way of pitching Biden’s infrastructure bill (with something like 5% infrastructure and 95% Democratic political agenda items).\n\nOnce again, talk about privileged. There are few things easier and simpler than that Acela train ride, I say, as someone who did it many times. Imagine the whining of the privileged — that’s truly Acosta here, when many people don’t have a job and he has a guaranteed job, despite what an awful job he has done at it.\n\nBut it’s always about him and on a larger scale, CNN. They’re always only about their narrative; they don’t get there’s a whole, big world out there beyond the Acela corridor that they don’t have the first idea about. I’m thinking that Jim Acosta’s comfort is not the thing that’s uppermost on any American’s mind.\n\nPoor Acosta, tough life. — Karol Markowicz (@karol) April 4, 2021\n\nJim Acosta goes from four years of \"we must hold presidents accountable!!\" to (paraphrasing) \"please, Mr. Biden, would you make my trek from NY to DC a little easier please?\" This is not journalism. https://t.co/4xh2RSFAhD — Sister Toldjah Le Pew 😁 (@sistertoldjah) April 4, 2021\n\nHow much of a cartoon of a coastal elitist can you possibly be? The Acela line makes up like 0.6% of all commuter traffic and it's a premium line (business and first class only). But that's the priority because it'll make Jim's morning slightly less annoying. Fucking stop it. https://t.co/a2kBOErdzs — Noam Blum (@neontaster) April 4, 2021\n\ntaxpayers all across America need to subsidize WiFi on the Acela because high-paid journos are too damn cheap to pay for a hotspot. https://t.co/Z2DYCFa295 — Greg Pollowitz (@GPollowitz) April 4, 2021\n\nNot knocking fast and efficient travel here. Just think conversations about America’s infrastructure needs should involve everyday Americans outside of the Acela corridor. — Ana Rosa Quintana (@ana_r_quintana) April 4, 2021\n\nUnfortunately, neither Biden nor Acosta seem very interested in the opinion of folks outside the corridor.\n\nHT: Twitchy"
        },
        {
          "link": "https://redstate.com/bonchie/2021/04/04/a-biden-advisor-is-asked-about-the-mlb-boycott-of-georgia-her-response-is-mind-boggling-n355393",
          "published": "2021-04-04T16:45:45",
          "title": "A Biden Advisor Is Asked About the MLB Boycott of Georgia, Her Response Is Mind-Boggling",
          "text": "With the MLB pulling the all-star game out of Georgia, the questions for Democrats are piling up. Specifically, what exactly did they accomplish by lying about the election reform bill except costing Georgia business owners over $100 million in revenue?\n\nStacey Abrams has been the least self-aware in the aftermath, claiming that she’s not to blame despite clearly being to blame (see Stacey Abrams Shows Zero Self-Awareness in Pretending She’s Not to Blame for MLB Boycott). Others like Raphael Warnock haven’t even tried to pretend they don’t the result.\n\nOf course, it wasn’t just Georgia-centric figures in the mix here. Joe Biden also voiced his support for the boycott, and one of his advisors was asked about it this morning. Her answer is mind-boggling.\n\nThis is what being out of touch looks like.\n\nBiden advisor Cecilia Rouse's tells Georgia small businesses affected by MLB's decision to boycott: \"workers at another place will benefit\"pic.twitter.com/NY6eYIEv1b — Julia Friedland (@JuliaFriedland) April 4, 2021\n\nOh, you mean some workers in New York City (which is being discussed as a possible relocation site for the all-star game) will benefit despite the fact that New York has stricter voting laws than Georgia? Makes sense, right?\n\nBut it’s really the callousness of this answer that gets me. It tells you exactly what Biden, Democrats, and the broader left think of American workers and business owners. They aren’t individual people with individual lives that can be impacted by garbage rhetoric and policy decisions. Rather, they are just cogs in the machine. As long as a set number of people jump in to make widgets, Biden and his flacks couldn’t care less what happens to everyone else. It’s a gross way to deal with matters, but it’s what always happens as government power expands to the point of absurdity. Things become impersonal and soulless, with a focus on the “greater good” than on how things affect the lives of real people.\n\nDo you know what would be helpful right now? Having an administration that cares more about telling the truth than lying about a mundane election law for political gain. None of this had to happen. This is on the heads of Stacey Abrams, Raphael Warnock, Keisha Lance-Bottoms, Joe Biden, and a myriad of mainstream media hacks who propagated a false narrative about Georgia’s election reform bill.\n\nGeorgians have a chance to make things right starting in 2022. Hopefully, this episode is fresh in their minds. Warnock needs to be booted out of the Senate, and any run for governor by Abrams after that should be laughed at. These people don’t care about Georgia. They care about raising their own profiles and stuffing their pockets with grifter cash."
        },
        {
          "link": "https://redstate.com/nick-arama/2021/04/04/sure-looks-like-msnbc-is-being-racist-with-their-latest-remarks-on-virus-variant-n355340",
          "published": "2021-04-04T16:00:36",
          "title": "Sure Looks Like MSNBC Is Being 'Racist' With Their Latest Remarks on Virus Variant",
          "text": "There’s no doubt that MSNBC reliably pushes the liberal line.\n\nThey were definitely all in criticizing calling the Wuhan coronavirus the “China virus” or identifying the virus by its place of origin, despite the fact that viruses have been called by places of origin for eons, absolutely nothing to do with race.\n\nAnti-Asian bias rose after media, officials used 'China virus,' report shows https://t.co/fEZuGB8cC8 pic.twitter.com/2AXh2SW3GM — The Last Word (@TheLastWord) September 29, 2020\n\nBut because President Donald Trump called it the China virus last year and reminded people of the CCP’s involvement in initially covering up the nature of the virus, folks on the left wanted to use it as an attack point to somehow claim Trump was racist even if that meant that they were essentially skipping right over or ignoring the CCP coverup and not holding the government accountable.\n\nBut now that Trump is no longer in office MSNBC seems to have forgotten about their claims and the Democratic narrative. Because according to their standards, this sure sounds pretty racist to me.\n\nFirst confirmed case of Indian coronavirus variant in U.S. found in California https://t.co/pOOmwyLPbE pic.twitter.com/KwdoySxyKh — The Last Word (@TheLastWord) April 4, 2021\n\nSo apparently you’re not allowed to say “China Virus” but “Indian variant” is just hunky dory. Likewise, it appears acceptable to name the other variants by their locations according to folks like the very liberal constant virus commenter Eric Feigl-Ding who referred to the “Brazil variant.” Sort of raises the question as to why it’s ok to name the variants but not naming the original origin of the virus. By the way, where is the effort underway by the Biden people to hold the CCP accountable, or should I not even ask that question, knowing it isn’t even on their radar and they’re never going to do it? This is a question that media should be asking Joe Biden and demanding a response to.\n\nThis is a racist tweet by MSNBC’s own standards. https://t.co/T1S63KUqzJ — Erick Erickson (@EWErickson) April 4, 2021\n\nThere is UK variant, South African Variant, Brazil Variant and now Indian double mutant variant of Covid 19.\n\nWhy is there no China Variant ?\n\nWhy is there no wuhan Virus ?\n\nWhy double standard in naming Variants ? https://t.co/MZoKXP2wnQ pic.twitter.com/Sxh49yBRfZ — Nilesh Shah (@NileshShah68) April 4, 2021\n\nIndian variant, fine. South African variant, fine. Brazilian, variant fine. Wuhan virus.. Hey wait just a second. — Stephen L. Miller (@redsteeze) April 4, 2021\n\nI’m confused why we can call this one the “Brazil” variant but we had to stop saying the China one? Someone explain this to me? — Kori Handy (@Korihandy) April 4, 2021\n\nHow is it that every covid variant is immediately referred to by the geographic location of their country’s variant discovery, but it’s racist to refer to covid based on its origination in China? I don’t think Americans understand how much our country’s media is owned by China. — Clay Travis (@ClayTravis) April 4, 2021\n\nHT: Twitchy"
        }
      ]
    },
    "hotair": {
      "rss": "http://hotair.com/feed",
      "link": "http://hotair.com/",
      "articles": [
        {
          "link": "https://hotair.com/archives/allahpundit/2021/04/04/sunday-morning-talking-heads-256/",
          "published": "2021-04-04T09:01:34",
          "title": "Sunday morning talking heads",
          "text": "It’s infrastructure week — or month, or year — in Washington, which means it’s infrastructure day on the Sunday shows. The White House’s new $2 trillion bill the lead topic, with new transportation secretary Pete Buttigieg appearing on behalf of the administration. He’ll try to convince voters that (a) the bill isn’t a giant slush fund that’ll bankroll all sorts of left-wing priorities beyond infrastructure and (b) the massive flood of taxpayer money into a soon-to-be booming economy won’t cause rising inflation that’ll end up torpedoing Biden’s presidency. Buttigieg will chat with “This Week” and “Meet the Press” about it.\n\nElsewhere, Mississippi Gov. Tate Reeves will sit down with “State of the Union” to say “I told you so” to critics of his decision to lift his state’s mask mandate last month. On March 3, the day his order took effect, Reeves’s state had 380 new confirmed cases of COVID. On April 2, a month later, it had 284. He’ll be followed on the same program by Ilhan Omar, who posted this … interesting tweet on Friday after the horrible attack on two Capitol Police officers:\n\nHeartbroken to learn another CP was killed while protecting the Capitol. My thoughts and prayers go out to the officer’s family and the entire Capitol Police force. The death toll would have been worse if the assailant had an AR-15 instead of a knife. — Rep. Ilhan Omar (@Ilhan) April 2, 2021\n\nFinally, one of Biden’s gloomiest public health experts, Michael Osterholm, will talk to “Meet the Press” and “Fox News Sunday” about the COVID spikes in northern states like Michigan and New York and the risk of one last national wave as variants spread across the country. The full line-up is at Politico."
        },
        {
          "link": "https://hotair.com/archives/ed-morrissey/2021/04/04/roll-away-stone-happy-blessed-easter-readers/",
          "published": "2021-04-04T01:01:36",
          "title": "Roll away the stone: a happy and blessed Easter to our readers!",
          "text": "May all of our readers have a happy and blessed Easter celebration today, as we begin to see light at the end of a tunnel that we started entering about this time last year. We would also like to wish our Jewish readers a belated Passover greeting, as this year both events take place close to each other as they did the year before. We are still struggling through separation and isolation and looking for a resurrection this year, and our Gospel readings throughout the weekend speak to that.\n\nFor the Easter vigil, we have Mark 16:1-7, which reminds us that all separation is only temporary in the Lord:\n\nWhen the sabbath was over, Mary Magdalene, Mary, the mother of James, and Salome bought spices so that they might go and anoint him. Very early when the sun had risen, on the first day of the week, they came to the tomb. They were saying to one another, “Who will roll back the stone for us from the entrance to the tomb?” When they looked up, they saw that the stone had been rolled back; it was very large. On entering the tomb they saw a young man sitting on the right side, clothed in a white robe, and they were utterly amazed. He said to them, “Do not be amazed! You seek Jesus of Nazareth, the crucified. He has been raised; he is not here. Behold the place where they laid him. But go and tell his disciples and Peter, ‘He is going before you to Galilee; there you will see him, as he told you.’”\n\nFor the morning Mass, we have John 20:19, which picks up the story and extends our desire for seeing Jesus in the flesh:\n\nOn the first day of the week, Mary of Magdala came to the tomb early in the morning, while it was still dark, and saw the stone removed from the tomb. So she ran and went to Simon Peter and to the other disciple whom Jesus loved, and told them, “They have taken the Lord from the tomb, and we don’t know where they put him.” So Peter and the other disciple went out and came to the tomb. They both ran, but the other disciple ran faster than Peter and arrived at the tomb first; he bent down and saw the burial cloths there, but did not go in. When Simon Peter arrived after him, he went into the tomb and saw the burial cloths there, and the cloth that had covered his head, not with the burial cloths but rolled up in a separate place. Then the other disciple also went in, the one who had arrived at the tomb first, and he saw and believed. For they did not yet understand the Scripture that he had to rise from the dead.\n\nAnd finally in our afternoon and evening Easter Masses, we recall the disciples’ journey to Emmaus, and how difficult it is for us to recognize Christ at times through our woe. Our closest communion to Him is in the breaking of the bread, as Luke writes in his Gospel (24:13-35):\n\nThat very day, the first day of the week, two of Jesus’ disciples were going to a village seven miles from Jerusalem called Emmaus, and they were conversing about all the things that had occurred. And it happened that while they were conversing and debating, Jesus himself drew near and walked with them, but their eyes were prevented from recognizing him. He asked them, “What are you discussing as you walk along?” They stopped, looking downcast. One of them, named Cleopas, said to him in reply, “Are you the only visitor to Jerusalem who does not know of the things that have taken place there in these days?” And he replied to them, “What sort of things?” They said to him, “The things that happened to Jesus the Nazarene, who was a prophet mighty in deed and word before God and all the people, how our chief priests and rulers both handed him over to a sentence of death and crucified him. But we were hoping that he would be the one to redeem Israel; and besides all this, it is now the third day since this took place. Some women from our group, however, have astounded us: they were at the tomb early in the morning and did not find his body; they came back and reported that they had indeed seen a vision of angels who announced that he was alive. Then some of those with us went to the tomb and found things just as the women had described, but him they did not see.” And he said to them, “Oh, how foolish you are! How slow of heart to believe all that the prophets spoke! Was it not necessary that the Christ should suffer these things and enter into his glory?” Then beginning with Moses and all the prophets, he interpreted to them what referred to him in all the Scriptures. As they approached the village to which they were going, he gave the impression that he was going on farther. But they urged him, “Stay with us, for it is nearly evening and the day is almost over.” So he went in to stay with them. And it happened that, while he was with them at table, he took bread, said the blessing, broke it, and gave it to them. With that their eyes were opened and they recognized him, but he vanished from their sight. Then they said to each other, “Were not our hearts burning within us while he spoke to us on the way and opened the Scriptures to us?” So they set out at once and returned to Jerusalem where they found gathered together the eleven and those with them who were saying, “The Lord has truly been raised and has appeared to Simon!” Then the two recounted what had taken place on the way and how he was made known to them in the breaking of bread.\n\nMay this Easter Sunday leave us with our hearts burning for Him again, with our spirits refreshed in this new encounter with Christ. We are all on a path without being able to fully know where we are going or who we might meet along the way. If we keep our hearts open to Jesus, we will find the grace to find the journey’s end.\n\nJesus Christ is Risen — He is Risen Indeed!\n\nThe front-page image is “The Angel is Opening Christ’s Tomb” by Benjamin Gerritsz Cuyp, c. 1640. On display at the Museum of Fine Arts in Budapest. Via Wikimedia Commons."
        },
        {
          "link": "https://hotair.com/archives/karen-townsend/2021/04/03/woke-battle-brews-pbs-one-white-male-filmmaker-get-support/",
          "published": "2021-04-03T19:31:55",
          "title": "Woke battle brews at PBS: Why does one white, male filmmaker get all the support?",
          "text": "Is it time to cancel Ken Burns at PBS? It’s not easy being a white, male, cisgender filmmaker these days over at the taxpayer-funded public television network. Burns has achieved immense success for his documentaries made for PBS and has been generously rewarded for his work there. A group of nearly 140 filmmakers and other professionals is blasting PBS for a lack of diversity behind the scenes. Their complaint says there is just too much Ken Burns.\n\nA group of people that includes filmmakers, producers, directors, executives, and programmers signed on with their support after an essay by a Korean-American filmmaker was published by the Ford Foundation. The purpose was to lodge a complaint that PBS is too dependent on Burns, “America’s storyteller”, for its programming. The woke are going against their own network, in other words, because of what amounts to what looks like professional jealousy.\n\nGrace Lee, an independent producer, director, and writer working in both narrative and nonfiction film, according to her byline on the essay, credits her career to PBS. She now asks “how much does PBS reflect the audiences it was intended to serve?” She compares the time given to documentaries by Burns versus that of her own, which was on Asian Americans.\n\nIn 1967, amid widespread civil unrest, CPB was created by an Act of Congress “to expand and develop a diversity of programming dependent on freedom, imagination and initiative on both local and national levels.” PBS was founded in 1969 to interconnect public television stations and distribute programs. Fifty-one years later, as we undergo another societal breakdown and racial reckoning, how much does PBS reflect the audiences it was intended to serve? I take this question seriously because I largely owe my own documentary career to PBS. In 2020, I was a producer on Asian Americans, a groundbreaking series for which we had five hours to tell 150 years of history spanning from the Chinese who built the railroads to South Asians targeted after 9/11. Compare this to 16 hours of Country Music, which also aired in 2020, or 13 hours of the Roosevelts—both by Ken Burns. His 2021 slate includes four hours each on Ernest Hemingway, Muhammad Ali, Benjamin Franklin, and the American Buffalo. When bison merit 80% of the airtime afforded to Asian American history, it calls into question not only the leadership of public television but also who gets to tell these stories, and why.\n\nShe makes her argument using the fact that Burns is a white male and the dependence on his documentaries for PBS programming is perpetuating racial and cultural inequities. She criticizes PBS for overlooking black, indigenous, and other filmmakers of color.\n\n“The decades-long interdependence of PBS decision-makers, philanthropists, and corporate funders with one white, male filmmaker highlights the racial and cultural inequities perpetuated by this system. The amount of broadcast hours, financial support (from viewers like who?), and marketing muscle devoted to one man’s lens on America has severed PBS from its very roots,” said Grace Lee.\n\nPBS responded but that response wasn’t to the satisfaction of the group of 140 professionals.\n\nIn a statement over email, a PBS spokesperson noted that of the more than 200 primetime hours of documentaries slated to be aired this year, 35 percent are produced by diverse filmmakers. A total of 55 percent feature BIPOC talent, are produced by diverse filmmakers or cover topics related to diversity, equity and inclusion. “For over 50 years, reflecting the full range of the American experience has been central to the mission and work of PBS. As America’s home for documentaries, we use our national platform to amplify a broad array of perspectives shared by diverse storytellers,” said the spokesperson. “While we have a strong foundation of inclusive programming, we recognize that there is more to be done, and we welcome ongoing dialogue on this critically important issue.”\n\nThe group has questions.\n\n“As the leader of the public broadcasting system, you are responsible to commit to an open and sustained public dialogue. Questioning whether PBS could be doing better should not be seen as an attack, but as an opportunity for meaningful dialogue and action, and to engage BIPOC filmmakers as we chart a course forward,” said the letter, which asks: “How many HOURS of PBS non-fiction television have been directed or produced by BIPOC filmmakers vs. by white filmmakers over the past ten years? Of all SPENDING on PBS non-fiction television over the past ten years, what percentage has been directed or produced by BIPOC filmmakers? Of the top 25 production companies that have produced the most content for PBS over the past ten years when measured according to budget, how many of them are BIPOC-led vs. white-led? How many PBS management staff (including individual stations and major strands) are BIPOC vs. white? How do these numbers compare to the numbers from ten years ago?”\n\nThe AP reports that PBS President and CEO said, “I feel very privileged to have the opportunity to work with Ken Burns, whose legacy is extraordinary and as we look forward, has a very rich pipeline of programs that he’s bringing to public television.”\n\nPresident and CEO Paula Kerger was asked Tuesday about an essay by filmmaker Grace Lee, who contended that public TV’s deep attachment to Burns, whose series include “The Civil War” and “Baseball,” slights viewers of color. “I feel very privileged to have the opportunity to work with Ken Burns, whose legacy is extraordinary and as we look forward, has a very rich pipeline of programs that he’s bringing to public television,” Kerger said in a virtual Q&A with the Television Critics Association. “We create lots of opportunities for many filmmakers,” Kerger said. Burns “mentors a number of filmmakers who now have quite established careers … and he has a deep commitment to mentoring diverse filmmakers.” She said she “respectfully disagrees” with Lee’s arguments in a essay last fall for the Ford Foundation.\n\nWhen asked during a panel of television critics this week, Ken Burns defended the subjects of his documentaries. “The stuff that’s coming up is incredibly diverse in every sense of the meaning of that word,” Burns said.\n\nKen Burns isn’t known as a liberal filmmaker in the sense that Michael Moore or Spike Lee is. Maybe that is why he is being singled. PBS has the right to choose whomever they want to showcase. Burns has decades of professional experience and deserves the credit he receives. His documentaries are popular and bring high ratings for PBS. Why wouldn’t they keep using him as their star documentarian? Ms. Lee was given an opportunity and even admits she has PBS to thank for airing her documentary. The relationship between PBS and Burns is beneficial for both parties. Burns isn’t jumping to streaming services, instead pledging his loyalty to staying with PBS. PBS gives him the creative freedom and fewer restraints than, say, Netflix or another streaming service would be able to allow.\n\n“I could have gone a few years ago to a streaming channel or premium cable, and say, with my track record, ‘I need $30 million to do Vietnam,’ and they would have given me,” Burns said. “But what they wouldn’t have given me is 10 and a half years. PBS gave me 10 and a half years. They gave me six and a half on Ernest Hemingway.”\n\nIt sounds like Ms. Lee is going to have to find her own niche in the documentary-making business. Blaming race and diversity for everything doesn’t always work."
        },
        {
          "link": "https://hotair.com/archives/jazz-shaw/2021/04/03/new-liberal-line-biden-afraid-looking-soft-illegal-immigration/",
          "published": "2021-04-03T17:01:58",
          "title": "New liberal line: Biden is “afraid of looking soft” on illegal immigration",
          "text": "Have you ever had one of those moments when it seems as if you’ve slipped through some sort of dimensional doorway into an alternate reality, as happened in some of the original episodes of the Twilight Zone? Reading some of the liberal editorials making the rounds these days can produce a similar effect. That’s what happened when a reader sent me a link to this editorial in the Boston Globe written by Marcela Garcia, a member of the paper’s editorial board. The subject was immigration (carefully avoiding using the word “illegal” anywhere in the column) and the author was seeking to find an explanation as to why President Joe Biden was being too tough on immigrants and not relaxing restrictions on immigration. I’ll just give you a moment to collect yourselves after that shock to the system.\n\nThe official name of the malady is xenophobia. Donald Trump did everything he could to spread the condition, and it still infects us. Unlike Trump, President Biden doesn’t fear displaced foreigners who fled their homes due to civil conflict, natural disasters, persecution, or systemic violence. Nor does he blatantly use them as handy political props. Still, he may be afraid of appearing soft on immigration, just as some were labeled soft on crime a generation ago. That could be one explanation for why Biden hasn’t reversed Trump’s historically low refugee admissions cap of 15,000 annually, leaving many in the resettlement world baffled. It could also be that the administration is consumed with managing the influx of migrant children at the US-Mexico border.\n\nGarcia goes on to describe Biden’s “delay on welcoming refugees” as being a “huge disappointment” to advocates like herself. To her credit, the author does draw a distinction between people who have left their home countries and traveled through a second nation, applying for the United Nations refugee resettlement program along the way, and those who simply show up at our border demanding asylum. The former qualify as refugees in the technical sense and are at least trying to comply with our laws, while the latter are illegal immigrants. But that credit is diminished when the author turns around and basically lumps both categories into the same basket.\n\nDonald Trump did indeed lower the cap on the number of refugees America accepts. That move turned out to be rather prescient when you consider the effects of the pandemic and the measures we were forced to take in bringing it under control. And while we’re making some admirable progress, the pandemic is still with us. Many of the countries these refugees hail from still have alarming infection rates.\n\nBut if Ms. Garcia wants to talk about the total number of refugees of any description that are being “allowed” into our country currently, perhaps she should take a look at the latest news from the southern border. In case anyone has somehow missed it, thanks to Joe Biden’s changes to our immigration policies we are currently “welcoming” so many people into our country that we have nowhere to put them and many are being released into the country without a court date and some without even having been ID’d for a background check. The author is concerned that the refugee cap isn’t being raised from 15,000 to 65,000, but the Border Patrol currently estimates that they will end up dealing with more than a million illegal alien encounters by the end of this year.\n\nDoes any sane person honestly believe that Joe Biden is mismanaging the crisis on the southern border because he’s “afraid of looking soft on illegal immigration?” Before even taking office, Biden did everything short of going down to the border and literally rolling out a red carpet. And the aspiring illegal immigrants have taken his invitation to heart, wearing their Biden campaign t-shirts and giving press conferences about how hard it is to get their official documents and spread across the nation.\n\nJoe Biden is hardly afraid of being seen as being too soft on any border control and immigration policies. He ran his entire campaign on promised to be precisely that guy. Now he’s made good on those promises and we have him to thank for the burgeoning crap show currently unfolding on the Mexican border."
        },
        {
          "link": "https://hotair.com/archives/allahpundit/2021/04/03/texas-sees-lowest-daily-average-covid-cases-since-last-june-three-weeks-mask-mandate-lifted/",
          "published": "2021-04-03T15:31:45",
          "title": "Texas sees lowest daily average in COVID cases since last June three weeks after mask mandate was lifted",
          "text": "An update to last week’s post about case counts declining in the Lone Star state. Not only have cases continued to fall in Texas since then, the seven-day average is now the lowest it’s been since June 18, 2020 according to Worldometer. Yesterday the state was averaging just 3,263 daily confirmed infections. On March 10, the day Greg Abbott’s order lifting Texas’s mask mandate took effect, it was averaging 4,895.\n\nAverage daily deaths are also the lowest they’ve been since November — and deaths lag cases by several weeks so they might well continue to fall throughout April.\n\nIs there a “vaccine effect” at work here? Well, sure, partly. Every person that’s vaccinated is almost completely immune from infection and millions of Texans have been vaccinated by now. But if inoculations were driving this, we’d expect to see cases falling even more dramatically in states with higher vaccination rates than Texas and we don’t. On the contrary: Just 27 percent of Texans have received at least one dose, which places it in the bottom 10 of U.S. states by that measure. Michigan has immunized 30 percent of its population and it’s enduring the nastiest wave in the country right now.\n\nGotta be more to Texas’s brightening outlook than vaccines, then. Last week I speculated that there’s a weather effect suppressing cases in the south: Since it’s warmer there now than in the north, people are spending more time outdoors, reducing transmission. Here’s a map to show you what I mean based on this NYT tracker. States in blue are where cases are either beginning to rise or already “high and staying high,” per the Times. States in red are where cases are “low and staying low.” There’s a clear pattern, notwithstanding a few outliers;\n\nWeather’s not the only variable, obviously. Florida’s an outlier because it has an unusually high number of cases involving the more contagious British variant. But it’s the one and only state along the southern border that’s seeing an uptick right now.\n\nBack to Texas. Apple’s mobility data also suggests more outdoor activity there lately, as there’s been a surge in walking route requests relative to January 2020, before the pandemic began. As the weather gets warmer, people are naturally more willing to be out in the open air.\n\nIn Michigan, by comparison, walking route requests are up only 42 percent from January 2020. Meanwhile, despite Abbott lifting the mask mandate and allowing businesses to reopen at full capacity, Texans aren’t spending noticeably more time in commercial spaces now. From Google’s mobility data:\n\nMore time outdoors and *not* much more time, if any, in indoor public spaces: That seems to be Texas’s successful formula lately. Abbott may have given them the green light to take more risks but they seem to be holding back, possibly because the vaccine is now generally available and it’s silly to stop taking precautions when you may be only weeks or days away from being immunized.\n\nVery much relatedly, Texans also don’t seem to be cutting back on wearing masks even though state law no longer requires them to do so. Quote:\n\nJames Henson, director of the Texas Politics Project at the University of Texas at Austin, says the newest poll his team is working on shows that Texans mask usage hasn’t dropped drastically since the mandate ended. “We still have about 80% of Texans, as recently as this month, reporting that they are wearing masks when they go out,” Henson said… In February, 81% of Republicans and 98% of Democrats said they wear a mask when in close contact with people outside of their household.\n\nGood news. Not so good news: The same poll shows 25 percent of Texas Democrats are reluctant or opposed to getting the vaccine versus … 59 percent of Texas Republicans, a clear majority of the party. In theory, Texas will never have another wave of COVID because the state will reach herd immunity before the outdoors becomes unbearably hot again, driving people inside. In practice, there may be enough vaccine refuseniks still holding out come June to seed another major statewide outbreak among the unimmunized. And there’s no reason to think Texas is the only red state where that’ll be true.\n\nIn fact, we could see two-track pandemics in various Republican states this summer, with bluer urban areas relatively safe due to higher vaccination rates and more mask-wearing by locals and redder rural areas more at risk due to fewer masks and lower vaccine uptake. A Twitter pal pointed out this morning that, while Texas’s cases statewide are down, there’s early evidence that the trend may be reversing in rural areas already:\n\nYou are throwing your own political group under the bus. The urban areas are doing well because they have good (or better) mask compliance. Some of the rural areas are heating up very rapidly. Hospitalizations are a trailing indicator. These will uptick soon in these areas. pic.twitter.com/dvhazTd9Jh — Carrick Talmadge (@carrick510) April 3, 2021\n\nSoutherners (and Californians) have been given a respite from the pandemic by their climates that most of the rest of the country doesn’t get to enjoy. If they take advantage by using that respite to get immunized en masse, they’ll beat COVID before another summer wave can gather. If they squander it by resisting the vaccine due to whatever odd suspicions they have about it, they’ll be back in the soup when the weather turns again. I think it really is as simple as that."
        }
      ]
    }
  }
}