{
  "newspapers": {
    "cnn": {
      "rss": "http://rss.cnn.com/rss/cnn_topstories.rss",
      "link": "http://www.cnn.com/",
      "articles": [
        {
          "link": "http://rss.cnn.com/~r/rss/cnn_topstories/~3/YTkKaI0H22o/index.html",
          "published": "2021-04-05T15:12:03",
          "title": "How safe is it to go to the beach now? What you should know",
          "text": "Editor's Note — Since the pandemic continues, CNN is not advising that people do these activities. But if you're going to, there are ways to mitigate risks. Fully vaccinated people are, of course, at much lower risk of contracting and spreading coronavirus than people who haven't been vaccinated. CNN Medical Analyst Dr. Leana Wen advises approaching your activity decisions with that in mind.\n\n(CNN) — With summer around the corner and more people getting Covid-19 vaccines, you may be wondering whether going to the beach is a safe bet.\n\nEven for people who have been fully vaccinated, \"nothing is going to be 100% safe, just like nothing is going to be 100% risk,\" said CNN Medical Analyst Dr. Leana Wen, an emergency physician and visiting professor of health policy and management at the George Washington University Milken Institute School of Public Health. However, beaches \"are much safer than other settings because they are outdoors.\"\n\nPictured is St. Kilda beach in Dunedin, New Zealand. As the world slowly reopens, visiting beaches can be safer than traveling to indoor destinations. Shutterstock\n\n\"We have not seen that (coronavirus) can be spread in the water,\" said Dr. Ada Stewart, a family physician with Cooperative Health in Columbia, South Carolina, and the president of the American Academy of Family Physicians. Whether you're at the beach by yourself or with fully vaccinated family or friends, Stewart added, what helps reduce risk is having your own area to relax in.\n\nAlways check the regulations of the local government, public health office and beach in advance, the US Centers for Disease Control and Prevention has recommended . The beach managers may be requiring reservations or limited capacity. Also, plan to arrive \"swim ready\" by showering and changing at home first.\n\nFor times when you may have to be closer to people -- like when you visit the restroom or concession stand -- wear a mask, carry hand sanitizer and wash your hands. The CDC has advised beach managers to ensure there is enough equipment -- such as chairs and other supplies -- for visitors and that everything is cleaned regularly. However, bringing hand sanitizer and disinfectant spray or wipes would be useful for cleaning equipment yourself.\n\nIf you need to shower or rinse off at the beach, try to physically distance from others or go in when the area isn't crowded. Bring an extra mask in case your first mask gets wet; according to the CDC, a wet mask is less effective. And don't wear your mask in the water, since a wet mask can also make breathing difficult\n\nDistance yourself -- on land and in water -- from people who don't live with you. Avoid crowds and poorly ventilated indoor areas.\n\nCoronavirus commonly spreads through respiratory droplets during close physical contact, so Wen is more worried \"about what happens if people leave the beach and end up going to the bar.\" Even if people are distanced in places like indoor bars and restaurants, wearing a mask is still best if you might be sharing air."
        },
        {
          "link": "http://rss.cnn.com/~r/rss/cnn_topstories/~3/7TNeNF_jVkc/far-right-extremist-groups-shift-vaccine-misinformation-burghart-intv-nr-vpx.cnn",
          "published": "2021-04-05T01:29:03",
          "title": "Research director explains how far-right extremist groups pivoted to anti-vaccine movement",
          "text": "Restaurants are still struggling, but see hope on the horizon"
        },
        {
          "link": "http://rss.cnn.com/~r/rss/cnn_topstories/~3/_FqBKjclf0U/index.html",
          "published": "2021-04-05T16:49:57",
          "title": "Another US Covid-19 surge may look different, experts say, particularly for younger people. Here's how",
          "text": "(CNN) Experts say Covid-19 vaccinations i n the US are going extremely well -- but not enough people are protected yet and the country may be at the start of another surge.\n\nThe US reported a record over the weekend with more than 4 million Covid-19 vaccine doses administered in 24 hours, according to the Centers for Disease Control and Prevention.\n\nAnd the country now averages more than 3 million doses daily, according to CDC data.\n\nBut only about 18.5% of Americans are fully vaccinated, CDC data shows, and Covid-19 cases in the country have recently seen concerning increases.\n\n\"I do think we still have a few more rough weeks ahead,\" Dr. Celine Gounder, an infectious diseases specialist and epidemiologist, told CNN on Sunday. \"What we know from the past year of the pandemic is that we tend to trend about three to four weeks behind Europe in terms of our pandemic patterns.\"\n\nWhat's worse, experts say, is that the variant is changing the pandemic's playbook and could spell trouble for younger groups that haven't yet been vaccinated.\n\n\"We have to think about the B.1.1.7 variant as almost a brand new virus,\" said Dr. Peter Hotez, dean of the National School of Tropical Medicine at Baylor College of Medicine. \"It's acting differently from anything we've seen before, in terms of transmissibility, in terms of affecting young people, so we have to take this very seriously.\"\n\nCDC director says variants causing cases to rise\n\nCovid-19 cases have increased for a fourth straight week, CDC Director Dr. Rochelle Walensky said Monday at the White House COVID-19 Response Team briefing.\n\n\"We know that these increases are due, in part, to more highly transmissible variants, which we are very closely monitoring,\" Walensky said.\n\nShe also said that a number of the clusters identified among young people are connected to participation in youth sports and extracurricular activities. The CDC guidelines suggest those activities should be limited.\n\n\"I understand that people are tired and that they are ready for this pandemic to be over, as am I,\" Walensky said. \"Please, continue to hang in there, and to continue to do things that we know prevent the spread of the virus.\"\n\nThe difference between previous surges and another possible surge now is \"the people most affected now are the younger individuals,\" emergency physician Dr. Leana Wen told CNN on Sunday.\n\nOlder populations have been prioritized nationwide for Covid-19 vaccinations. More than 54% of Americans 65 and older have been fully vaccinated, according to the CDC , while more than 75% of that same age group have gotten at least one Covid-19 vaccine dose.\n\nBut while that age group is now relatively well protected, Wen said, younger groups are still vulnerable as the B.1.1.7 variant circulates. The variant is more contagious and may cause a more severe iteration of the disease, experts have said. Research suggests it may also be more deadly.\n\n\"We're seeing in places like Michigan that the people who are now getting hospitalized by large numbers are people in their 30s and 40s,\" Wen said. \"And now we're even seeing children getting infected in larger numbers, too.\"\n\nIt's not just Michigan.\n\n\"What we're seeing is pockets of infection around the country, particularly in younger people who haven't been vaccinated, and also in school-aged children,\" former Food and Drug Administration commissioner Dr. Scott Gottlieb told CBS's \"Face the Nation\" on Sunday.\n\n\"If you look what's happening in Michigan, in Minnesota, in Massachusetts, for example, you're seeing outbreaks in schools and infections in social cohorts that haven't been exposed to the virus before.\"\n\n\"The infection is changing its contours in terms of who's being stricken by it right now,\" he added.\n\nIn Florida's Orange County, officials reported late last month a rise in Covid-19 cases in the 18-to-25 age group.\n\nAnd a third of all of the county's Covid-19 hospitalizations were people younger than 45, according to Dr. Raul Pino, director of the Florida Department of Health in Orange County.\n\nNew Jersey officials said last week that variants, including the B.1.1.7 strain, were contributing to a rise in cases and hospitalizations -- including in younger age groups.\n\nBetween the first and last weeks of March, there was a 31% and 48% increase, respectively, in the number of hospitalizations among the 20-29 and 40-49 age groups, state health commissioner Judy Persichilli said Wednesday.\n\nMeanwhile older residents only saw single-digit percent increases, she added.\n\nLifeguard calls to swimmers on a beach in the South Beach neighborhood in Florida on March 27.\n\nHow we can curb another surge of infections\n\nDespite alarming warning signs, the US is not powerless, experts have stressed.\n\nDoubling down on safety measures -- masking up, social distancing, avoiding crowds -- coupled with quick and efficient vaccinations, can help curb another Covid-19 surge, Dr. Anthony Fauci said Saturday.\n\n\"We say it over and over again and we need the local people, we need the governors and the mayors and others to be able to say, 'We're not out of it yet,'\" Fauci said.\n\n\"People say, 'Well, you just want to confine us forever.' No, this is not going to last forever because every day that you get four million, three million people vaccinated, you get closer and closer to control.\"\n\nHotez estimated Sunday that Americans need to hold on for \"another four to six weeks, and then we'll be on the other side of it.\"\n\n\"All the vaccines seem to work just as well against this UK-B.1.1.7 variant ... so that is really good news,\" he said. \"I have a lot of confidence that we're going to be in a really good place by the summer.\"\n\n\"But if you're not vaccinated, you have to behave as though you're highly vulnerable to this virus. This is not a time to get sick,\" Hotez added.\n\nSpring break travel soars\n\nThe Transportation Security Administration says it screened 1.54 million people at airports across the country on Sunday, just shy of a pandemic record set Friday when 1.58 million people flew. More than 6 million people have flown since Thursday.\n\nSunday's screening rate is more than ten times greater than the bottomed-out figures of a year ago, but still well below 2019 levels. TSA figures have been higher than 1.5 million for three of the last seven days and higher than one million for 25 days in a row.\n\nOn Friday, the CDC said those who are fully vaccinated can now travel at low risk to themselves, but said non-essential travel should still be avoided."
        },
        {
          "link": "http://rss.cnn.com/~r/rss/cnn_topstories/~3/Zmq85Qb5dsQ/index.html",
          "published": "2021-04-04T16:48:59",
          "title": "You should think twice before laminating your vaccine card",
          "text": "(CNN) Vaccine eligibility in the US is expanding quickly, and so is the popularity of the Centers for Disease Control and Prevention's little white card .\n\nWhile plans to establish standardized vaccination proof are still being developed , many are holding to their Covid-19 vaccine cards as a potential form of social currency.\n\nAnd companies, like Staples and Office Depot , are offering to help keep them safe with free lamination\n\nWhile it may be tempting to get your vaccine card laminated as soon as possible, you should take your time and make sure you've considered a few things beforehand.\n\nHere's what you should know about laminating your coveted vaccine card.\n\nDouble check your information\n\nIf you are getting a two-dose vaccine, make sure that you receive and document both doses on your card before laminating it.\n\nDouble check all of your information -- including your name, date of birth, and the date and location of the vaccine -- for accuracy.\n\nMake sure you have a backup\n\nYou should definitely create a backup of your card before laminating it.\n\nDr. Leana Wen, an emergency physician and public health professor at George Washington University, told CNN that she recommends taking a photo of the card after each dose.\n\n\"Take a picture after getting the first shot, then after the second one too, in case you lose the physical card,\" she said. \"Keep the picture on your phone, and email yourself a copy to be safe.\"\n\nWen said she also recommends photocopying the card and keeping it in the same place as other important documents, like your birth certificate.\n\nAfter this, if you want to laminate your card, Wen says to \"go for it.\"\n\nKnow what to do if your card gets damaged or lost\n\nThere are concerns that the lamination process might damage cards, smudging the ink or making it illegible.\n\nBut even if your card is damaged in the lamination process, there are options.\n\nIn the case of damage to, or loss of your card, you'll need to contact your vaccine provider to get another one.\n\nIf you're having trouble contacting your provider, you can visit the CDC directory of state health department immunization information systems (IIS).\n\nWhile the CDC itself doesn't have vaccination record information, providers are required to report vaccinations to their state's respective IIS or registry. Contact your state's listed phone number or email address to access your record and get your new card.\n\nProof is the most important thing -- laminated or not\n\nSome worry that getting their vaccine cards laminated will cause trouble in the future if Covid-19 vaccine booster shots are needed.\n\nStill, Wen says don't worry.\n\n\"If you do end up getting a booster after, you can always get a different card,\" she said. \"I wouldn't let that be a deterrent.\"\n\nUltimately, the thing that trumps all is proof -- laminated or not.\n\n\"Lamination isn't necessary if you follow all the other steps above, too,\" Wen said. \"The key is to have proof of vaccination easily accessible.\""
        },
        {
          "link": "http://rss.cnn.com/~r/rss/cnn_topstories/~3/oWUgrBlMvdM/pfizer-vaccine-protection-length-watt-dnt-tsr-vpx.cnn",
          "published": "2021-04-02T00:40:03",
          "title": "Pfizer says coronavirus vaccine protection could last at least 6 months",
          "text": "Pfizer said its vaccine can protect against Covid-19 for at least six months, but experts say that protection will likely last longer."
        }
      ]
    },
    "nyt": {
      "rss": "http://rss.nytimes.com/services/xml/rss/nyt/Politics.xml",
      "link": "http://www.nytimes.com/section/politics",
      "articles": [
        {
          "link": "https://www.nytimes.com/2021/04/05/us/politics/gayle-smith-covid-vaccine.html",
          "published": "2021-04-05T19:19:01",
          "title": "Gayle Smith, who helped lead the U.S. response to Ebola, will run Biden’s vaccine diplomacy.",
          "text": "An ardent advocate of protecting some of the world’s poorest countries from Covid-19 has been selected to lead the Biden administration’s vaccine diplomacy, which will be a new post at the State Department. More than 665 million vaccine doses have been administered worldwide, and about 61 million people in the United States have been fully vaccinated.\n\nGayle Smith, a former U.S. Agency for International Development administrator and chief executive of the ONE Campaign to eradicate preventable disease, will try to corral wealthier nations into distributing the vaccine more evenly around the globe.\n\nAs of Monday, the Biden administration has so far contributed or pledged $4 billion to Covax, the global vaccination drive, largely bound for low- and middle-income countries, Secretary of State Antony J. Blinken was expected to announce in Washington.\n\nMs. Smith helped lead the Obama administration’s response to the Ebola outbreak in 2014 that swept across borders in West Africa, and into the United States, while the World Health Organization was stunted by staffing cuts and other resources shortages. The Trump administration withdrew from the United Nations’ health agency last year for refusing to blame China for failing to stop Covid-19 where it originated, but the United States has recommitted to working with the W.H.O. under President Biden."
        },
        {
          "link": "https://www.nytimes.com/2021/04/05/us/politics/supreme-court-trump-twitter.html",
          "published": "2021-04-05T16:51:46",
          "title": "The Supreme Court vacates ruling that Trump violated the First Amendment by blocking people on Twitter.",
          "text": "The Supreme Court on Monday vacated an appeals court ruling that President Donald J. Trump had violated the First Amendment by blocking people from his Twitter account after they posted critical comments.\n\nA unanimous three-judge panel of the appeals court ruled in 2019 that Mr. Trump’s account was a public forum from which he was powerless to exclude people based on their viewpoints.\n\nThe Supreme Court’s move was expected, as Mr. Trump is no longer president and Twitter has permanently suspended his account.\n\nMore surprising was a 12-page concurring opinion from Justice Clarence Thomas musing on what he called the dangerous power a few private companies have over free speech."
        },
        {
          "link": "https://www.nytimes.com/2021/04/05/us/politics/heres-what-we-know-about-the-man-behind-fridays-attack-on-capitol-hill.html",
          "published": "2021-04-05T19:25:56",
          "title": "Here’s what we know about the man behind Friday’s attack on Capitol Hill.",
          "text": "Noah Green, the knife-wielding man killed after ramming his car into a checkpoint at the U.S. Capitol on Friday, was a troubled former college athlete whose life was disintegrating in the months leading up to a violent outburst that left one officer dead and another injured.\n\nOn the football field at Christopher Newport University in Virginia, Noah R. Green was No. 21, a dependable and good-natured, if soft-spoken, presence in the defensive backfield. Off the field, he was focused on Black economic empowerment and planned a career to help close the racial wealth gap.\n\nBy late March, after a bruising pandemic year that friends and family said left him isolated and mentally unmoored, Mr. Green’s life appeared increasingly to revolve around the Nation of Islam and its leader Louis Farrakhan, who has repeatedly promoted anti-Semitism.\n\nOn Friday afternoon, law enforcement officials said, Mr. Green, 25, drove a dark blue Nissan sedan from the Virginia suburbs and plowed into two police officers protecting the Capitol grounds. He then got out of the car brandishing a knife and lunged at officers."
        },
        {
          "link": "https://www.nytimes.com/2021/04/05/us/politics/supreme-court-religion.html",
          "published": "2021-04-05T10:00:14",
          "title": "An Extraordinary Winning Streak for Religion at the Supreme Court",
          "text": "(The court led by Chief Justice Earl Warren, from 1953 to 1969, supported religion just 46 percent of the time. That grew to 51 percent under Chief Justice Warren E. Burger, from 1969 to 1986; then to 58 percent under Chief Justice William H. Rehnquist, from 1986 to 2005; and finally jumped to just over 81 percent under Chief Justice Roberts, who joined the court in 2005.)\n\nThe kinds of cases the court is hearing have changed, too. In the Warren court, all of the rulings in favor of religion benefited minority or dissenting practitioners. In the Roberts court, most of the religious claims were brought by mainstream Christians.\n\nThe five most pro-religion justices all sit on the current court, the study found.\n\n“The justices who are largely responsible for this shift are Clarence Thomas, Samuel Alito, Neil Gorsuch, John Roberts and Brett Kavanaugh,” the study’s authors wrote. “While there are some differences among these justices, and Kavanaugh has been involved in only a handful cases, they are clearly the most pro-religion justices on the Supreme Court going back at least until World War II.” All are Republican appointees.\n\nIn the last term alone, the court sided with Christian religious groups in three argued cases. The court ruled that state programs supporting private schools must include religious ones, that the Trump administration could allow employers with religious objections to deny contraception coverage to female workers and that employment discrimination laws do not apply to many teachers at religious schools.\n\nAnd the court will soon decide whether Philadelphia may bar a Catholic agency that refused to work with same-sex couples from screening potential foster parents."
        },
        {
          "link": "https://www.nytimes.com/2021/04/04/us/politics/guantanamo-bay-prisoners.html",
          "published": "2021-04-05T00:04:13",
          "title": "Military Closes Failing Facility at Guantánamo Bay to Consolidate Prisoners",
          "text": "U.S. military guards have moved Khalid Shaikh Mohammed and other former C.I.A. prisoners to the main part of the prison compound at Guantánamo Bay from a failing secret facility, in a consolidation of detention operations that could cut costs and reduce the troop presence at the base in Cuba, the military said on Sunday.\n\nMr. Mohammed, who is accused of being the mastermind of the Sept. 11 attacks, and other so-called high-value detainees at Guantánamo were moved to Camp 5 as part of the consolidation. The two-story building, a maximum-security facility that cost $17 million to build in 2004, is modeled after a state prison in Bunker Hill, Ind. It has a modest detainee health clinic and a psychiatric ward with a padded cell, but none of the hospice or end-of-life care capacity once envisioned by Pentagon planners.\n\nThe maximum-security facility is designed to keep prisoners confined to their cells except when guards move an individual to showers, outdoor cages that serve as recreation yards or another cell where a single captive can sit in a recliner, one ankle shackled to a bolt on the floor, and watch television.\n\nAs of Sunday, the military said, all 40 so-called war on terror detainees — the 11 men who have been charged with war crimes, as well as others who are held as indefinite detainees — were housed in a compound ringed with razor wire and containing two prison buildings, called Camps 5 and 6."
        }
      ]
    },
    "politicus_usa": {
      "rss": "http://www.politicususa.com/feed",
      "link": "http://www.politicususa.com/",
      "articles": [
        {
          "link": "https://www.politicususa.com/2021/04/05/raising-corporate-taxes-wont-slow-recovery.html?utm_source=rss&utm_medium=rss&utm_campaign=raising-corporate-taxes-wont-slow-recovery",
          "published": "2021-04-05T18:51:38",
          "title": "GOP Rocked As Report Shows Raising Taxes On Corporations Will NOT Slow Recovery",
          "text": "A new report from the Center For Budget and Policy Priorities shows that raising taxes on corporations will make the tax code fairer and not hurt the economic recovery.\n\nA key finding from the report:\n\nSpecifically, with regard to the recovery from COVID-19 and its economic fall-out, another important consideration is the deep economic and racial disparities that this crisis both highlighted and exacerbated. While millions of lower-income families and individuals continue to face financial hardship due to COVID-19 and the economic fall-out, those at the top in large measure continued to prosper during these hard times — a dichotomy that has become known as the “K-shaped” recovery.[17]\n\nRaising taxes on those struggling during this crisis could create headwinds for the recovery, but a corporate tax hike would predominantly fall on those wealthier people who have already recovered from (or never experienced) the recession. A robust and equitable recovery requires that policymakers prioritize still-struggling households, and that’s precisely what raising corporate revenue to fund public investments will do.\n\nThe entire report lays out the reasons why Biden’s infrastructure plan will help the country, and raising taxes on corporations will not hurt jobs, the recovery, and the broader economy.\n\nFor instance, the economy will be helped more by the growth in jobs and economic activity resulting in infrastructure investment than it could be hurt by raising taxes on corporations. A tax increase on corporations would also add more fairness to the tax code.\n\nAll of the Republican fearmongering about raising taxes to pay for infrastructure is not based on fact. Republicans are lying. The Biden infrastructure and jobs plan would be a boon to the economy.\n\nRepublicans will not be swayed by reality, but the report is evidence that President Biden is right to push full speed ahead with his plan.\n\nFor more discussion about this story join our Rachel Maddow and MSNBC group.\n\nFollow and Like PoliticusUSA on Facebook"
        },
        {
          "link": "https://www.politicususa.com/2021/04/05/biden-republicans-infrastructure.html?utm_source=rss&utm_medium=rss&utm_campaign=biden-republicans-infrastructure",
          "published": "2021-04-05T18:14:37",
          "title": "Biden Kicks Sand In McConnell’s Eye And Says He Will Push Republicans On Infrastructure",
          "text": "President Biden made it clear that he is not going to give obstructionist Republicans an opening and said that he would push them on infrastructure.\n\nVideo of President Biden:\n\nPresident Biden speaks to media about Republican opposition to Infrastructure Plan. pic.twitter.com/DAdqg4ML6P — CSPAN (@cspan) April 5, 2021\n\nPresident Biden was asked, “Where is there room to negotiate with Republicans given that your definitions of infrastructure are so different?”\n\nThe President answered, “Well, I’m not going to negotiate with you on that (laughter). I’m going to push as hard as I can to compete with the rest of the world. Everybody else in the rest of the world is investing billions and billions of dollars in infrastructure, and we’re going to do it here. Thank you.”\n\nSince Barack Obama took office in 2009, the strategy from Senate Republicans has been to negotiate in bad faith and obstruct at all times. Biden isn’t playing that game. The President is on offense. He isn’t going to be pushed by Republicans in a futile bid to win their support. He is going to push Republicans to support his plan.\n\nSenate Minority Leader Mitch McConnell (R-KY) has already stated that Senate Republicans won’t support Biden’s infrastructure plan. President Biden doesn’t need their votes, but if Republicans want money for specific infrastructure projects in their states and districts, they are going to have to negotiate with President Biden.\n\nThe days of Democrats having to deal with Republican obstructionist bullying look to be over.\n\nFor more discussion about this story join our Rachel Maddow and MSNBC group.\n\nFollow and Like PoliticusUSA on Facebook"
        },
        {
          "link": "https://www.politicususa.com/2021/04/05/half-of-republicans-delusional.html?utm_source=rss&utm_medium=rss&utm_campaign=half-of-republicans-delusional",
          "published": "2021-04-05T16:33:42",
          "title": "Half Of Republicans Are Delusional And Think Capitol Attack Was Peaceful Or Done By The Left",
          "text": "782 SHARES Facebook Twitter Whatsapp Pinterest Reddit Print Mail Flipboard\n\nHalf of Republicans think that the Capitol attack was peaceful or carried out by the left to make Donald Trump look bad.\n\nReuters reported on a new Reuters/Ipsos Poll:\n\n\n\nThree months after a mob of Trump supporters stormed the Capitol to try to overturn his November election loss, about half of Republicans believe the siege was largely a non-violent protest or was the handiwork of left-wing activists “trying to make Trump look bad,” a new Reuters/Ipsos poll has found.\n\nSix in 10 Republicans also believe the false claim put out by Trump that November’s presidential election “was stolen” from him due to widespread voter fraud, and the same proportion of Republicans think he should run again in 2024, the March 30-31 poll showed.\n\nPresident Biden has redefined bipartisanship and targeted Republican and Independent voters with his outreach because Republicans in Congress are members of a party where half of the base is delusional.\n\nRepublicans aren’t getting disinformation about the Capitol attack on their own. Conservative media, Donald Trump, and Republican members of Congress have spread the lies and disinformation about the attack. Republicans have created a closed disinformation loop where elected Republicans and their voters constantly reinforce each other’s delusional view of the world.\n\nDemocrats can’t work with Republicans in traditional bipartisan ways because half of them are out of their minds and living on another planet.\n\nThe Republican Party refuses to agree with everyone else on reality. They are a dangerous bubble that represents a threat to the country.\n\nFor more discussion about this story join our Rachel Maddow and MSNBC group.\n\nFollow and Like PoliticusUSA on Facebook"
        },
        {
          "link": "https://www.politicususa.com/2021/04/05/mitch-mcconnell-threatens-corporations.html?utm_source=rss&utm_medium=rss&utm_campaign=mitch-mcconnell-threatens-corporations",
          "published": "2021-04-05T16:09:46",
          "title": "Mitch McConnell Just Threatened Corporations For Not Supporting GOP Racism",
          "text": "118 SHARES Facebook Twitter Whatsapp Pinterest Reddit Print Mail Flipboard\n\nSenate Minority Leader Mitch McConnell threatened corporations with “consequences” if they continue to stand against racist voter suppression laws.\n\nMcConnell said:\n\nMcConnell takes aim at corporate US: “Parts of the private sector keep dabbling in behaving like a woke parallel government. Corporations will invite serious consequences if they become a vehicle for far-left mobs to hijack our country from outside the constitutional order.\" — Burgess Everett (@burgessev) April 5, 2021\n\nMitch McConnell is a leader in a political party that depends on donations from the wealthiest Americans and corporations for its survival, so it seems that the power in this situation rests with the corporations, which, if they chose to do so, could turn off the money supply to McConnell and the Republican Party at any time.\n\nSen. McConnell can’t do much to anyone as the Senate Minority Leader. He can make speeches on the Senate floor or go on Fox News, but he doesn’t control what bills make it to the Senate floor anymore or what gets a final vote.\n\nMcConnell’s threat is empty. There is little that he can do to corporate America.\n\nThe “pro-business” Republican Party has reached a point where they are threatening businesses who said that every eligible American should have equal access to the ballot box, and those voting laws that target minorities are wrong and need to be changed.\n\nThat is the entire position that has Republicans outraged.\n\nMitch McConnell is threatening corporate America because they won’t turn a blind eye toward Republican racism.\n\nFor more discussion about this story join our Rachel Maddow and MSNBC group.\n\nFollow and Like PoliticusUSA on Facebook"
        },
        {
          "link": "https://www.politicususa.com/2021/04/05/yellen-to-call-for-global-minimum-tax-rate-to-raise-revenue-stop-companies-from-evading-taxes.html?utm_source=rss&utm_medium=rss&utm_campaign=yellen-to-call-for-global-minimum-tax-rate-to-raise-revenue-stop-companies-from-evading-taxes",
          "published": "2021-04-05T15:56:01",
          "title": "Yellen to Call for Global Minimum Tax Rate to Raise Revenue, Stop Companies from Evading Taxes",
          "text": "Treasury Secretary Janet Yellen will make the case for a global minimum tax rate to raise revenue in the United States as well as stop companies from shifting their profits overseas, a move that enables them to evade paying taxes.\n\n“Competitiveness is about more than how U.S.-headquartered companies fare against other companies in global merger and acquisition bids,” Yellen will say in a speech to the Chicago Council on Global Affairs. “It is about making sure that governments have stable tax systems that raise sufficient revenue to invest in essential public goods and respond to crises, and that all citizens fairly share the burden of financing government.”\n\nCorporate tax rates have fallen around the world. And in the United States, former President Donald Trump lowered the U.S. rate from 35% to 21%. Trump argued that higher tax rates were incentivizing companies to relocate their operations offshore. Yellen’s speech comes as President Joe Biden continues to try and draw support for his $2 trillion infrastructure proposal, which comes on the heels of the $1.9 trillion American Rescue Plan.\n\n“Together we can use a global minimum tax to make sure the global economy thrives based on a more level playing field in the taxation of multinational corporations, and spurs innovation, growth, and prosperity,” Yellen will say."
        }
      ]
    },
    "fox": {
      "rss": "http://feeds.foxnews.com/foxnews/politics",
      "link": "http://www.foxnews.com/",
      "articles": [
        {
          "link": "http://feeds.foxnews.com/~r/foxnews/politics/~3/Tw3-7w7jiZc/hunter-biden-smoke-parmesan-cheese-resembled-crack",
          "published": "2021-04-05T19:24:46",
          "title": "Hunter Biden admits he used to smoke parmesan cheese because it resembled crack",
          "text": "Hunter Biden admitted that when he was addicted to crack cocaine, he smoked parmesan cheese because it resembled the drug.\n\nThe president's son recalled in an interview with CBS News how he would search through carpeting trying to find traces of the drug, and would sometimes come up with cheese instead.\n\nHUNTER BIDEN DETAILS 2019 DRUG INTERVENTION A MONTH BEFORE FATHER ANNOUNCED PRESIDENTIAL CAMPAIGN\n\n\"I spent more time on my hands and needs picking through rugs, smoking anything that even remotely resembled crack cocaine,\" Biden said. \"I probably smoked more parmesan cheese than anyone.\"\n\nThis is consistent with what Biden wrote in his upcoming memoir, \"Beautiful Things,\" in which he described how once he was unsure if he had crack cocaine or a flake of parmesan from a cheese platter he had ordered.\n\n\"It didn't matter: I smoked it. If it was crack, great. If it wasn't, I'd take a hit, exhale, and exclaim, \"S---, that's not it – that's the f------ cheese!\"\n\nIn the book, Hunter Biden goes on to discuss how he would often eat white cheddar popcorn while driving, which led to confusion when he would search the car for traces of drugs if he had run out.\n\n\"Again, the crack crumbs were often indistinguishable from the spilled snacks,\" he wrote. \"Safe to say I've smoked more cheddar popcorn than anybody on the face of the earth.\"\n\nHUNTER BIDEN SAYS HE HAS NO 'RECOLLECTION' OF ENCOUNTER WITH EX-STRIPPER WHOSE CHILD HE FATHERED\n\nThe book includes more serious anecdotes, as Hunter recalls how his family staged an intervention for him in March 2019.\n\nHis mother had invited him to a family dinner, and when he arrived Hunter saw his daughters and two rehab counselors he recognized.\n\n\"'Not a chance,'\" Hunter said, according to the book.\n\n\"'I don't know what else to do,'\" Joe Biden, then on the verge of announcing his candidacy for president, said, according to his son. \"'I'm so scared. Tell me what to do.\"\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n\"'Not f------ this,'\" Hunter says he replied.\n\nHunter wrote that he tried to leave, but his daughters blocked him from getting into his car and his father exited the house to hug him and \"cried for the longest time.\""
        },
        {
          "link": "http://feeds.foxnews.com/~r/foxnews/politics/~3/6h8IgYA1Urc/texas-abbott-first-pitch-mlb-georgia-voting-law",
          "published": "2021-04-05T19:13:06",
          "title": "Texas Gov. Abbott declines to throw first pitch over MLB stance on Georgia voting law",
          "text": "Texas Republican Gov. Greg Abbott is refusing to throw the first pitch at a Rangers game in protest of Major League Baseball's response to Georgia's controversial voting reforms.\n\n\"I was looking forward to throwing out the first pitch at the Texas Rangers' home opening game until @MLB adopted what has turned out to be a false narrative about Georgia's election law reforms,\" Abbott tweeted Monday. \"It is shameful that America's pastime is being influenced by partisan politics.\"\n\nAbbott attached a letter he addressed to Neil Leibman, president of operations and chief operating officer for the Texas Rangers.\n\nGEORGIA COUNTY SET TO LOSE $100 MILLION IN 'DESPERATELY NEEDED' TOURISM REVENUE, SAYS JOBS EXPERT\n\nIn it, he told Leibman that while Texas was proud to host the playoff games and World Series in his state last year, it would not seek to host any other MLB special events, including the All-Star Game.\n\nLast week, the league announced it was moving its All-Star Game and MLB Draft from Atlanta, citing the voting legislation.\n\n\"Major League Baseball fundamentally supports voting rights for all Americans and opposes restrictions to the ballot box,\" said Commissioner Rob Manfred.\n\nGEORGIA VOTING LAW: READ FULL TEXT\n\n\"In 2020 ... We proudly used our platform to encourage baseball fans and communities throughout our country to perform their civic duty and actively participate in the voting process. Fair access to voting continues to have our game's unwavering support.\"\n\nThe MLB did not immediatley respond to Fox News' request for comment.\n\nIn its press release last week, the MLB referenced President Biden's criticisms of the law.\n\nBiden had claimed that Georgia's law blocked people from providing voters with food and water while they stood in line. He also accused the Republican-led state of ending voting at 5 p.m., \"when people are just getting off work.\"\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nGeorgia's law actually standardizes what's considered \"normal business hours\" to mean 9 a.m. to 5 p.m. but still allowed counties to extend their voting hours to as early as 7 a.m. and as late as 7 p.m.\n\nIt also allows poll workers to provide self-service water from an unattended receptacle within 150 feet of the polls but prohibits people from political organizations from actively distributing food and drink within that distance."
        },
        {
          "link": "http://feeds.foxnews.com/~r/foxnews/politics/~3/9pVOXkPU318/joe-biden-racial-rhetoric-fleischer-jim-crow-georgia",
          "published": "2021-04-05T18:34:01",
          "title": "Fleischer: Biden has history of 'trafficking' in racially charged rhetoric against opponents",
          "text": "Former White House press secretary Ari Fleischer said Monday that President Biden has a history of using racially charged rhetoric against his political opponents, most recently, comparing the Georgia voting law with Jim Crow.\n\nBIDEN'S DISPUTED GEORGIA VOTING CLAIMS DEFENDED -- DESPITE FACT CHECK\n\nAri Fleischer: This is what bad reporting and a demagogue can do to a country isn’t it? The reporting on the Georgia law was just terrible from the start. Anybody who could reasonably claim that this is Jim Crow 2.0 needs to be ignored. Americans don’t pass Jim Crow laws anymore.\n\nI mean we are such an improved society. It’s as if racial progress has not been made and people just revert back to the worst things that they can say about their opponents and Joe Biden has a history of trafficking in it.\n\nIf you recall, Joe Biden when he was up against Mitt Romney’s campaign in 2012 - how can you be more milquetoast than Mitt Romney?. He said Republicans under Romney want to 'put y'all back in chains' to a Black audience. And now he calls this Jim Crow 2.0, Jim Crow on steroids. And as a result Major League Baseball, Delta Airlines, have tucked their tales, have been intimidated, and have really created a bigger political crisis for themselves.\n\nCLICK HERE TO WATCH THE FULL INTERVIEW"
        },
        {
          "link": "http://feeds.foxnews.com/~r/foxnews/politics/~3/glpkzQAm5SA/bidens-energy-policies-dangerous-message-texas-george-p-bush",
          "published": "2021-04-05T18:25:49",
          "title": "Biden’s energy policy ‘sends a very dangerous message’ to Texas: George P. Bush",
          "text": "Texas Land Commissioner George P. Bush revealed in an interview with \"Fox & Friends\" host Brian Kilmeade that he is \"taking a very serious look\" at running for state attorney general and said he should be making his final decision \"fairly soon.\"\n\n\"I’ve been privileged to serve as land commissioner for the last six years, but we need new leadership in this high state-wide executive role,\" Bush said.\n\nThe son of former Florida Gov. Jeb Bush also noted that he thinks there is \"nothing more unifying in Republican Party politics than Joe Biden and Kamala Harris.\"\n\n\"After a few years of left-wing progressive ideas everyday Americans are going to say, ‘This is enough,’\" he continued.\n\nBush also warned that President Biden’s energy policies send a \"very dangerous message\" to the state.\n\n\"The industry directly employs 400,000 Texans and indirectly employs over a million,\" Bush told Kilmeade. \"We will lose 120,000 jobs if the federal lease policy stays in place for the rest of this year alone.\"\n\nBush was referring to one of Biden’s energy actions. In a series of orders aimed at combating climate change, President Biden temporarily suspended the issuance of oil and gas permits on federal lands and waters and cancelled the Keystone XL oil pipeline project.\n\nBIDEN SIGNS CLIMATE CHANGE ORDERS AMID CONCERNS OVER JOBS: 'IT IS TIME TO ACT'\n\nPresident Biden revoked the permit for the 1,700-mile pipeline on his first day in office, ending a project that was expected to employ more than 11,000 Americans this year.\n\nIn remarks made by Biden in January before signing executive actions on tackling climate change, the president pointed to \"a key plank\" of his Build Back Better Recovery Plan, which he noted \"is building a modern, resilient climate infrastructure and clean energy future that will create millions of good-paying union jobs.\"\n\nLaid-off Keystone XL pipeline worker David Campbell told Kilmeade that he lost his job on August 1 and has been without work for four-and-a-half months.\n\n\"We were really hoping everything would pick up once COVID eased off and then we just kind of got slammed in the gut again,\" Campbell said.\n\nHe added that the ramifications of Biden knocking \"out 11,000 jobs [in] the first days in office\" are \"still being felt in the industry.\"\n\n\"It’s easy to say just go find another job, but when you’re the head of a household and that other job you’re going to do is going to pay you half as much as what you’re used to, that’s not quite as easy as it sounds,\" Campbell continued.\n\nBush also referenced the migrant surge at the southern border impacting Texas, noting that communities \"are dealing with this incredible influx of not only unaccompanied children, but illegal immigrants that are coming across.\"\n\n\"We’re tired of the federal government not stepping up to the plate and accepting their responsibility in this effort,\" Bush said.\n\nBiden has scrapped a number of former President Trump's policies, which included having asylum seekers remain in Mexico instead of staying in the U.S. while they wait for their cases to be heard. The moves have led to a record surge in migrants, including unaccompanied minors, that has strained capacity at immigration facilities in recent weeks.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nA Biden spokesperson did not immediately respond to Fox News’ request for comment."
        },
        {
          "link": "http://feeds.foxnews.com/~r/foxnews/politics/~3/K4qr_GBaevU/gop-committee-to-elect-republican-state-officials-touts-record-haul",
          "published": "2021-04-05T18:00:38",
          "title": "GOP committee to elect Republican officials at state level touts record haul",
          "text": "A GOP political organization dedicated to electing Republicans to state offices across the nation is highlighting what it calls a \"record\" first quarter fundraising haul in an off-election year.\n\nThe Republican State Leadership Committee (RSLC) announced on Monday that, along with its strategic policy partner, the State Government Leadership Foundation, it hauled in a combined $4.2 million in fundraising during the January-March quarter, which the RSLC said is the most it’s ever brought in in the first quarter of an odd year.\n\nJOHN JAMES NEW MISSION: HELPING FELLOW REPUBLICANS IN 2022 ELECTIONS\n\nThe RSLC said its fundraising was boosted by what it touted as a surge in online fundraising thanks to the continued expansion of the committee’s low-dollar fundraising program, launched in 2019.\n\n\"Despite the false narrative in the mainstream media that Republicans would struggle to raise money this cycle, we continue to break records and build on our 2020 achievements,\" RSLC president Dee Duncan argued in a statement.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nWhile the Republicans are the minority party in the both houses of Congress and are out of power in the White House, it’s a very different story in the states.\n\nRepublicans control 54% of the 7,383 total legislative seats throughout the country, according the latest data from the National Conference on State Legislatures. And they control 61 of the nation’s 99 state legislative chambers (Nebraska is the only state with a unicameral legislature). They control 30 of the 50 state legislatures, and have total control (State house majority and control of the governor’s office) in 23 states, compared to 15 for the Democrats."
        }
      ]
    },
    "epoch": {
      "rss": "http://www.theepochtimes.com/c-us/feed",
      "link": "http://www.theepochtimes.com/",
      "articles": [
        {
          "link": "https://www.theepochtimes.com/former-gaetz-staffer-says-fbi-agents-approached-him-with-baseless-allegations_3762509.html",
          "published": "2021-04-05T19:18:56",
          "title": "Former Gaetz Staffer Says FBI Agents Approached Him With ‘Baseless’ Allegations",
          "text": "Former Gaetz Staffer Says FBI Agents Approached Him With ‘Baseless’ Allegations\n\nA former adviser to Rep. Matt Gaetz (R-Fla.) on Monday said FBI agents recently approached him with allegations he knew to be false, causing him to believe that the recent claims against his ex-boss are also untrue.\n\nAgents went to the home of Nathan Nelson on March 31 to question him about accusations against Gaetz, which reportedly include a claim that he paid for sex with a minor. But the agents asserted to Nelson that he resigned from Gaetz’s office because of knowledge about wrongdoing.\n\n“Nothing could be further from the truth. Neither I nor any other member of Congressman Gaetz’s staff had any knowledge of illegal activities,” Nelson, who worked with Gaetz for over six years when he was a state lawmaker and another four years in Congress, told reporters during a press conference.\n\n“This baseless claim against me leaves me further convinced that the allegations against Congressman Gaetz are likewise fabricated and merely an attempt to discredit a very vocal conservative,” Nelson added later.\n\nNelson said his departure in the fall of 2020 was planned and he wanted people to know what he believes to be true based on his encounter with the agents. He said he remains “loosely affiliated” with Gaetz’s office as an unpaid adviser. He said he has not spoken to Gaetz in several months.\n\nThe FBI has referred The Epoch Times to the Department of Justice when questioned about the reported Gaetz investigation. The department hasn’t returned requests for comment.\n\nThe briefing from Nelson was the latest effort to push back on the allegations against Gaetz and his office. After the allegations first became public through an anonymously-sourced report in the New York Times, Gaetz went on Fox News to say his family were victims of an extortion attempt.\n\n“Over the past several weeks, my family and I have been victims of an organized criminal extortion involving a former DOJ official seeking $25 million while threatening to smear my name. We have been cooperating with federal authorities in this matter and my father has even been wearing a wire at the FBI’s direction to catch these criminals,” Gaetz said in a statement.\n\n“The planted leak to the New York Times tonight was intended to thwart that investigation. No part of the allegations against me are true, and the people pushing these lies are targets of the ongoing extortion investigation. I demand the DOJ immediately release the tapes, made at their direction, which implicate their former colleague in crimes against me based on false allegations.”\n\nDocuments published by the Washington Examiner indicated a group tried to obtain $25 million from Gaetz’s father, former state Sen. Don Gaetz, in return for making Rep. Gaetz’s “future legal and political problems go away.”\n\nDon McGee, a Florida lawyer allegedly involved in the scheme, has denied Gaetz’s counter-accusations. Another man, former Air Force officer Bob Kent, said Monday he was part of the group but denied that what happened amounted to extortion."
        },
        {
          "link": "https://www.theepochtimes.com/shrinking-mortgage-market-could-cost-california-economy-2-3-billion-a-year_3762833.html",
          "published": "2021-04-05T19:05:38",
          "title": "Shrinking Mortgage Market Could Cost California Economy $2.3 Billion a Year",
          "text": "Shrinking Mortgage Market Could Cost California Economy $2.3 Billion a Year\n\nCommentary\n\nMortgage originations tied to refinancing activity in the U.S. are expected to plummet 76 percent from 2020 to 2022, according to a recent projection from the Mortgage Bankers Association (MBA).\n\nThis might be particularly bad for California, which has a relatively high proportion of its workforce working as loan officers.\n\nRefinance-related mortgage originations are projected to fall from $2.4 trillion in 2020 to $1.52 trillion this year, the MBA’s analysis says. The figure will plunge a further 62 percent from 2021 to next year, when the MBA projects refi-related mortgage originations to be just $573 billion.\n\nThis might be dire news for loan officers in California, whose job losses might have repercussions across the broader California economy.\n\nSoftening the blow in what is forecast to be a rapidly declining refinance sector, loan originations tied to home purchases are expected to increase 21 percent from 2020 to 2022. Loan activity related to home purchases is expected to increase 16 percent, from $1.43 trillion in 2020 to $1.67 trillion this year. It is expected to increase another four percent to $1.74 trillion in 2022.\n\nThe MBA’s expected change in overage mortgage activity—combining the 76 percent decrease in refi activity with the 21 percent increase in mortgages related to home purchases—the overall mortgage market is forecast to shrink from $3.83 trillion in 2020 to $2.13 trillion in 2022, a 44 percent decline.\n\nCalifornia Situation\n\nThis matters more broadly in California than elsewhere because a relatively high proportion of Californians work as loan officers, and earn 25 percent more than the average worker.\n\nFurthermore, for every loan officer who loses his or her job, another 3.6 jobs are lost.\n\nAccording to the analysis conducted for the Epoch Times, the cost to the California economy from the shrinking mortgage market could reach $2.3 billion per year.\n\nAccording to a 2019 analysis conducted by the Economic Policy Institute, every job loss in the finance sector leads to another 1.5 jobs lost in sectors that support finance jobs. An additional 2.1 jobs are lost in sectors utilized by those finance people.\n\nIn California, two out of 1,000 workers are loan officers.\n\nThis might not sound high but it is the second-highest proportion in the nation, behind only North Carolina, which has two large banking hubs in an otherwise low-population state.\n\nThe concern for California is that loan officers’ lost wages and spending can lead to a “negative multiplier effect”—the idea that reduced economic activity in their sector may cause reduced economic activity in other sectors where they spend money and rely on services.\n\nAs of May 2019—the period for which the most recent data is currently available—loan officers in California earned 26 percent more than other workers in California. At that time, the “annual mean wage,” or average annual income, across California was about $61,300 per year. Loan officers, however, were earning $77,300 per year.\n\nThere are currently 17.3 million people working in California, and if 2 out of 1,000 are loan officers, it means there are about 34,700 loan officers in the state.\n\nIt’s important to note that not all loan officers work within the mortgage sector; many work in banks and other lending institutions.\n\nBut given the large number of mortgage companies based in California, it is a reasonable assumption that half of all loan officers are doing mortgage-related work.\n\nThat means about 7,600 California loan officers who were working in 2020 could lose their jobs by the end of 2022.\n\nThey were earning an average of $77,300 each, accounting for $587 million a year in lost wages throughout the state.\n\nIf you factor in the 3.6 jobs lost from each loan officer no longer working or spending their earnings, at an average annual salary of $61,300, an additional $1.68 billion could be lost.\n\nIn total, the California economy could suffer a blow of some $2.3 billion per year compared to 2020 as interest rates rise and fewer people refinance their preexisting mortgages.\n\nHope for the Future\n\nOf course, during the next two years, hopes are high that the economy will re-open more broadly, international students will return for in-person instruction and amusement parks and sports venues will all lead to a spending boost. This will likely be a stronger “add” to the California economy than any “subtraction” caused by any contraction in loan officers losing their jobs.\n\nHowever, the lending sector may not be as robust during the next two years as it was throughout the past two years."
        },
        {
          "link": "https://www.theepochtimes.com/utah-governor-signs-legislation-making-fathers-help-pay-with-pregnancy-costs_3762775.html",
          "published": "2021-04-05T19:00:01",
          "title": "Utah Governor Signs Legislation Making Fathers Help Pay With Pregnancy Costs",
          "text": "Utah Gov. Spencer J. Cox speaks during a briefing at the Utah State Capitol in Salt Lake City, Utah, on Jan. 8, 2021. (Jeffrey D. Allred/Deseret News via AP)\n\nUtah Governor Signs Legislation Making Fathers Help Pay With Pregnancy Costs\n\nUtah Gov. Spencer Cox signed legislation into law on Monday legally requiring biological fathers to help with paying medical costs in the pregnancy if the biological mother requests it.\n\nThe legislation, House Bill 113, has been backed by Utah Republicans, Rep. Brady Brammer and Sen. Dan McCay. It received widespread support in the GOP-controlled chamber.\n\nFathers are required in accordance with the new law to pay 50 percent of a mother’s insurance premiums and other pregnancy-related medical costs—including the hospital birth of the child—that isn’t paid by another person.\n\nAccording to the bill, it will only apply to fathers whose paternity can be confirmed.\n\nIf an abortion is performed without the consent of the father, he won’t be financially responsible unless the termination of the pregnancy was necessary to prevent the death of the mother or if the pregnancy was the result of rape.\n\nIn March last year, former Utah Gov. Gary Herbert signed House Bill 136 into law which would ban abortion in the state after 18 weeks gestation, with some exceptions.\n\nGovernor of Utah Gary Herbert speaks during Salt Lake Opening Night Screening Of “The Boy Who Harnessed The Wind” Presented By Zions Bank during 2019 Sundance Film Festival at Rose Wagner Theatre in Park City, Utah, on Jan. 25, 2019. (Neilson Barnard/Getty Images)\n\nThe exceptions to the 18-week ban are in the case that doctors determine a fetus is not viable, that giving birth to the child would put a mother at serious risk, and in the case of rape and incest.\n\nBrammer, who sponsored House-Bill 113, said he had grown frustrated with the number of merely “anti-abortion” measures going through the Legislature and wanted to pursue legislation that would make it easier to bring life into the world.\n\n“We want to help people and actually be pro-life in how we do it as opposed to anti-abortion,” Brammer said. “One of the ways to help with that was to help the burden of pregnancy be decreased.”\n\nAccording to Utah’s Planned Parenthood Association and sponsors of the bill, the state appears to be the first in mandating prenatal child support.\n\nRepublican Rep. Brady Brammer, poses for a portrait at the Utah State Capitol on Jan. 30, 2020, in Salt Lake City. (Rick Bowmer/AP Photo)\n\nThe move has been applauded by pro-life activists, saying it will protect the lives of unborn children by supporting women through their pregnancy.\n\nAbortion activists and Democratic lawmakers have questioned the new law on whether it will actually help to cover costs and if it will actually meet women’s needs.\n\n“In the grand scheme of things, having a child and raising them to adulthood is going to be a lot more money,” Planned Parenthood spokeswoman Katrina Barker said.\n\nThe Associated Press contributed to this report.\n\nFrom NTD News"
        },
        {
          "link": "https://www.theepochtimes.com/gop-states-expand-school-choice-as-lockdowns-boost-alternatives_3762698.html",
          "published": "2021-04-05T18:34:46",
          "title": "GOP States Expand School Choice as Lockdowns Boost Alternatives",
          "text": "GOP States Expand School Choice as Lockdowns Boost Alternatives\n\nSeveral Republican-led states are advancing school choice programs amidst a growth of alternative learning arrangements spurred by pandemic-related lockdowns.\n\nThe new measures sometimes build on already established programs, expanding access to education savings accounts and scholarships, allowing more parents to pull their children from public schools and have the programs help pay for a private school, homeschooling, or even a private tutor.\n\nSuch initiatives now have a potential to gain more popularity as parents have been dissatisfied with the way many schools handled the response to the CCP (Chinese Communist Party) virus pandemic, according to Jonathan​ Butcher, education researcher at the conservative Heritage Foundation think tank.\n\nCommonly, public schools switched to partly or fully remote learning last year, which has proved to be substantially less effective than in-person instruction. Many parents have blamed schools for dragging their feet with reopening, even after health authorities acknowledged that it’s possible to do so safely.\n\nMeanwhile, homeschooling has exploded in popularity with parents setting up “pod schools” where several children get together in a home to get taught by a hired tutor, Butcher outlined in a recent paper. The school choice programs in several states could be used to pay for this form of education, Butcher told The Epoch Times.\n\nWest Virginia\n\nThe most substantial schools choice expansion is underway in West Virginia, where Gov. Jim Justice signed into law on March 29 the establishment of the nation’s first universal education savings account program.\n\nIt means that participants will get all the education money that comes from the state budget (some $4,600 a year per pupil) deposited into a special account that can be used to pay for private schooling. Incoming kindergarteners will be automatically eligible, while children in other grades could get in after spending 45 days enrolled in a West Virginia public school.\n\nState dollars usually fund about 45 percent of education expenses. Another 45 percent comes from local budgets, typically real estate taxes, and another roughly 10 percent from the federal government, Butcher said.\n\nArizona, Florida, North Carolina, Tennessee, and Mississippi already have similar programs with differing eligibility criteria, he said.\n\nKentucky\n\nThe state is establishing a tax credit scholarship program for lower-income children. The program will be funded through private donations and the state will distribute $25 million in tax credits each year to the donors on a first-come-first-serve basis. The money is to be distributed through non-profit intermediaries to applicants based on financial need. The eligibility is set at 175 percent of income qualifying for reduced-price school meals. That’s about $86,000 for a family of four (pdf).\n\nSouth Dakota\n\nThe state already runs a scholarship program funded through tax credits, though only insurance companies are eligible for the credits. It recently expanded the program to cover students already attending private schools. Children from families earning under 150 percent of the amount eligible for free and reduced-price lunch can apply (about $73,000 for a family of four).\n\nOthers\n\nGeorgia is advancing a bill that would expand its voucher program to more special needs students.\n\nFlorida is considering streamlining its five school choice programs into two, which would expand the options and eligibility for some of them.\n\nMissouri House passed a bill that would establish a tax credit scholarship program for children attending public schools, entering kindergarten, or coming from a military family. It would be initially capped at $50 million.\n\nIndiana House passed a bill that would set up education savings accounts for children with special needs, from military families, or from foster families. It would also expand eligibility for the current voucher program.\n\nNearly two dozen other states have also introduced bills that would create or expand vouchers, tax credit scholarships, or education savings accounts, according to the nonprofit Educational Freedom Institute. Only about half of those have passed at least one committee so far.\n\nOpponents of school choice have argued that such programs take students out of public schools, which then lose money that’s apportioned per pupil. Public schools can’t easily scale down their costs with outflow of students because part of it is fixed, such as building maintenance, debt interest, and administration. Proponents say the per-pupil part of public school funding is generally about the same as the non-fixed part of their costs so the schools should be able to cope.\n\nUpdate: The article was updated to clarify terminology referring to education savings accounts."
        },
        {
          "link": "https://www.theepochtimes.com/overview-of-all-proposed-spending-in-bidens-infrastructure-plan_3762567.html",
          "published": "2021-04-05T18:20:35",
          "title": "Overview of All Proposed Spending in Biden’s Infrastructure Plan",
          "text": "A Tesla Inc. electric vehicle charges at a supercharger station in Redondo Beach, California, on Jan. 4, 2021. (Patrick T. Fallon/AFP via Getty Images)\n\nOverview of All Proposed Spending in Biden’s Infrastructure Plan\n\nFrom traditional projects like roads and bridges to climate initiatives and programs outside the traditional infrastructure scope, President Joe Biden’s plan is an ambitious package he will try to pass through a nearly evenly split Congress in the coming months.\n\nBiden said the plan will invest about $2 trillion this decade. He dubbed his proposal the “American Jobs Plan,” which marks the first part of a two-part economic plan. Some programs and investments did not include a specific price tag. They are added at the end.\n\nInfrastructure Plan:\n\n$621 billion in transportation infrastructure and resilience.\n\n$115 billion to modernize bridges, highways, roads, and main streets most in need of repair. This includes funding to improve air quality, limit greenhouse gas emissions, and reduce congestion.\n\n$20 billion to improve road safety.\n\n$85 billion to modernize existing transit systems.\n\n$80 billion to address Amtrak’s repair backlog.\n\n$174 billion investment in the electric vehicle market.\n\n$25 billion for airports.\n\n$17 billion in inland waterways, coastal ports, land ports of entry, and ferries.\n\n$20 billion for a new program that will reconnect neighborhoods cut off by historic investments and ensure new projects “increase opportunity, advance racial equity and environmental justice, and promote affordable access.”\n\n$25 billion for a dedicated fund to support ambitious projects that have tangible benefits to the regional or national economy but are too large or complex for existing funding programs.\n\n$50 billion in dedicated investments to improve infrastructure resilience.\n\nBuilding a national network of 500,000 electric vehicle chargers by 2030.\n\nElectrify at least 20 percent of the yellow school bus fleet through a new Clean Buses for Kids program.\n\n$111 billion to replace 100 percent of the nation’s lead pipes and service lines to ensure clean, safe drinking water.\n\n$100 Billion to build high-speed broadband infrastructure to reach 100 percent coverage.\n\n$100 Billion to re-energize America’s power infrastructure to form a more resilient grid that will place the United States “on the path to achieving 100 percent carbon-free electricity by 2035.”\n\nThis will include a $10 billion investment to “put a new, diverse generation of Americans to work conserving our public lands and waters … and advancing environmental justice through a new Civilian Climate Corps”\n\n$213 billion to produce, preserve, and retrofit more than two million affordable and sustainable places to live.\n\nIncludes establishing a $27 billion Clean Energy and Sustainability Accelerator to mobilize private investment into distributed energy resources; retrofits of residential, commercial, and municipal buildings; and clean transportation.\n\n$100 billion to upgrade and build new public schools through $50 billion in direct grants and an additional $50 billion leveraged through bonds.\n\n$12 billion in community college infrastructure. States will be responsible for using the dollars to address both existing physical and technological infrastructure needs.\n\n$25 billion to help upgrade child care facilities and increase the supply of child care in areas that need it most.\n\n$18 billion for the modernization of Veterans Affairs hospitals and clinics.\n\n$10 billion in the modernization, sustainability, and resilience of federal buildings,\n\n$400 billion toward expanding access to quality, affordable home- or community-based care for aging relatives and people with disabilities.\n\n$180 billion investment in R&D and the technologies of the future:\n\nIncludes $35 billion in the full range of solutions needed to achieve technology breakthroughs that address the climate crisis and position America as the global leader in clean energy technology and clean energy jobs. This includes launching ARPA-C to develop new methods for reducing emissions and building climate resilience, as well as expanding across-the-board funding for climate research.\n\n$15 billion in demonstration projects for climate R&D priorities, including utility-scale energy storage, carbon capture and storage, hydrogen, advanced nuclear, rare earth element separations, floating offshore wind, biofuel/bioproducts, quantum computing, and electric vehicles.\n\n15 billion in creating up to 200 centers of excellence that serve as research incubators at Historically black colleges and universities and other minority serving institutions to provide graduate fellowships and other opportunities for underserved populations, including through pre-college programs.\n\n$300 billion to strengthen manufacturing supply chains for critical goods\n\n$50 billion to create a new office at the Department of Commerce dedicated to monitoring domestic industrial capacity and funding investments to support production of critical goods.\n\n$50 billion in semiconductor manufacturing and research, as called for in the bipartisan CHIPS Act.\n\n$30 billion over 4 years to create U.S. jobs and prevent the severe job losses caused by pandemics through major new investments in medical countermeasures manufacturing; research and development; and related biopreparedness and biosecurity.\n\n$46 billion investment to jumpstart clean energy manufacturing through federal procurement.\n\n$52 billion in domestic manufacturers.\n\n$100 billion in proven workforce development programs targeted at underserved groups and getting students on paths to careers before they graduate from high school.\n\n$5 billion over eight years in support of evidence-based community violence prevention programs. Biden is calling on Congress to invest in job training for formerly incarcerated individuals and justice-involved youth and in improving public safety.\n\n$48 billion in American workforce development infrastructure and worker protection. This includes registered apprenticeships and pre-apprenticeships, creating one to two million new registered apprenticeships slots, and strengthening the pipeline for more women and people of color to access these opportunities through successful pre-apprenticeship programs such as the Women in Apprenticeships in Non-Traditional Occupations.\n\nSome of the programs or proposals that don’t involve money, or did not have a specific funding amount:\n\n– Calling on Congress to tackle long-term unemployment and underemployment through a new subsidized jobs program.\n\n– Calling on Congress to eliminate sub-minimum wage provisions in section 14(c) of the Fair Labor Standards Act and expand access to competitive, integrated employment opportunities and fair wages for workers with disabilities.\n\n– Calling on Congress to ensure all workers have a free and fair choice to join a union by passing the Protecting the Right to Organize (PRO) Act, and guarantee union and bargaining rights for public service workers.\n\n– Asking Congress to tie federal investments in clean energy and infrastructure to prevailing wages and require transportation investments to meet existing transit labor protections.\n\n– Calling on Congress to provide the federal government with the tools it needs to ensure employers are providing workers with good jobs—including jobs with fair and equal pay, safe and healthy workplaces, and workplaces free from racial, gender, and other forms of discrimination and harassment.\n\n– Biden is calling on Congress to take immediate steps to spur the construction and rehabilitation of homes for underserved communities.\n\n– Calling on Congress to pass the Neighborhood Homes Investment Act, which calls for the creation of a new federal tax credit that will produce new equity investment dollars for the development and renovation of 1-4 family housing in distressed urban, suburban, and rural neighborhoods.\n\n– Calling on Congress to quadruple support for the Manufacturing Extensions Partnership—increasing the involvement of minority-owned and rurally-located small- and-medium-sized enterprises in technological advancement.\n\n– Calling on Congress to ensure that new jobs created in clean energy, manufacturing, and infrastructure are open and accessible to women and people of color.\n\n– Calling on Congress to invest in job training for formerly incarcerated individuals and justice-involved youth and in improving public safety.\n\n– The President’s plan will invest in vulnerable communities through a range of programs, including the Federal Emergency Management Agency’s Building Resilient Infrastructure and Communities program, the Department of Housing and Urban Development’s Community Development Block Grant program, new initiatives at the Department of Transportation, a bipartisan tax credit to provide incentives to low- and middle-income families and to small businesses to invest in disaster resilience, and transition and relocation assistance to support community-led transitions for the most vulnerable tribal communities.\n\n"
        }
      ]
    },
    "blaze": {
      "rss": "http://www.theblaze.com/feeds/feed.rss",
      "link": "http://www.theblaze.com/",
      "articles": [
        {
          "link": "https://www.theblaze.com/news/video-restaurant-patrons-chant-get-out-at-officials-issuing-covid-19-closure-order-cheers-erupt-when-they-turn-tail-and-leave-canadian-eatery",
          "published": "2021-04-05T19:27:20",
          "title": "VIDEO: Restaurant patrons chant 'get out!' at officials issuing COVID-19 closure order. Cheers erupt when they turn tail and leave Canadian eatery.",
          "text": "Customers seated inside Corduroy Restaurant in Vancouver, British Columbia, were caught on cellphone video chanting \"Get out!\" at health inspectors who had entered the establishment to issue closure orders over COVID-19 violations, Global News reported.\n\nSoon after the chant began and quickly grew louder, the officials turned tail and left — after which cheering and applause erupted. The confrontation took place Saturday, CBC News said.\n\nVancouver By-Law - Health-Inspectors, kicked out of restaurant by supportive customers. youtu.be\n\nWhat are the details?\n\nBritish Columbia last Monday ordered a three-week ban on indoor dining to combat a third wave of the COVID-19 virus, Global News said, adding that a business can be fined $2,300 while individuals can be fined $575 for non-compliance — and there's a separate fine for belligerent behavior related to enforcement of COVID-19 orders.\n\nWith that, a liquor coordinator and provincial health officers entered Corduroy Restaurant and issued a a full closure order Saturday, Vancouver police told the outlet.\n\nAnd video apparently of that very same event showed officials — seemingly the only people wearing masks — in the restaurant laying down the law to owner Rebecca Matthews, Global News said.\n\nImage source: YouTube screenshot\n\nMatthews tells the officials — who are handing her numerous papers — that they're trespassing on private property and that she doesn't recognize their jurisdiction, the outlet added.\n\nSoon diners began their \"Get out!\" chant. Seconds later, one of the officials turned, raised his hand at a colleague as if to signal surrender, and they walked out the door.\n\nImage source: YouTube screenshot\n\nCheers and applause quickly followed.\n\nMatthews told Global News she intends to continue defying the ban since she needs the income from her business to feed her family. She added that the province is unfairly targeting restaurants while allowing other businesses to stay open, the outlet noted.\n\nMatthews added to Global News that she doesn't see a difference between indoor and outdoor dining. And during a \"save small business\" rally Friday, she questioned the reliability of COVID-19 testing and called for the end of restrictions she said were doing more harm than the virus, the outlet reported.\n\nWhat do the powers that be have to say?\n\nVancouver Coastal Health told Global News that \"any alleged violations of closure orders are taken very seriously and are thoroughly investigated.\"\n\nHealth Minister Adrian Dix added to the outlet that he's \"frustrated with the behavior [at the restaurant]. No one misunderstands the rules. We are enforcing that closure order, and it is being enforced right now, and it will be enforced.\"\n\nPublic Safety Minister Mike Farnworth on Saturday called Corduroy Restaurant's non-compliance \"disgraceful\" and said besides receiving fines businesses also can have their liquor or business licenses pulled.\n\nHere's another clip of the \"Get out!\" chant:"
        },
        {
          "link": "https://www.theblaze.com/news/absolute-malarkey-60-minutes-airs-deceptively-edited-segment-accusing-gov-ron-desantis-of-corruption",
          "published": "2021-04-05T18:15:00",
          "title": "'Absolute malarkey': '60 Minutes' airs deceptively edited segment accusing Gov. Ron DeSantis of corruption",
          "text": "CBS News' \"60 minutes\" was blasted on Sunday by a top Democratic official in Florida and the state's largest grocery store chain after it aired a deceptively edited segment insinuating that Governor Ron DeSantis (R) engaged in a \"pay to play\" scheme with COVID-19 vaccine distribution.\n\nOn Sunday evening, CBS News' Sharyn Alfonsi reported that DeSantis received a $100,000 donation to his PAC from Publix grocery stores, which later partnered with the state to distribute COVID-19 vaccines. \"60 Minutes\" aired a clip of Alfonsi confronting DeSantis at a press conference south of Orlando, accusing the governor of \"pay to play\" by giving Publix exclusive rights to distribute the vaccine after he received that donation.\n\nThe governor said Alfonsi was \"wrong\" and spreading a \"fake narrative\" and proceeded to correct the record, but his long answer was cut out of the segment by CBS News' editors.\n\nThe Daily Wire reported the transcript of the segment, highlighting in bold the parts of DeSantis' answer that were edited out of the clip.\n\nSharyn Alfonsi: Publix, as you know, donated $100,000 to your campaign, and then you rewarded them with the exclusive rights to distribute the vaccination in Palm Beach—\n\n\n\nRon DeSantis: So, first of all, that — what you're saying is wrong. That's—\n\n\n\nSharyn Alfonsi: How is that not pay-to-play?\n\n\n\nRon DeSantis: —that, that's a fake narrative. So, first of all, when we did, the first pharmacies that had it were CVS and Walgreens. And they had a long-term care mission. So they were going to the long-term care facilities. They got the vaccine in the middle of December, they started going to the long-term care facilities the third week of December to do LTCs. So that was their mission. That was very important. And we trusted them to do that. As we got into January, we wanted to expand the distribution points. So yes, you had the counties, you had some drive-through sites, you had hospitals that were doing a lot, but we wanted to get it into communities more. So we reached out to other retail pharmacies — Publix, Walmart — obviously CVS and Walgreens had to finish that mission. And we said, we're going to use you as soon as you're done with that. For Publix, they were the first one to raise their hand, say they were ready to go. And you know what, we did it on a trial basis. I had three counties. I actually showed up that weekend and talked to seniors across four different Publix. How was the experience? Is this good? Should you think this is a way to go? And it was 100% positive. So we expanded it, and then folks liked it. And I can tell you, if you look at a place like Palm Beach County, they were kind of struggling at first in terms of the senior numbers. I went, I met with the county mayor. I met with the administrator. I met with all the folks in Palm Beach County, and I said, \"Here's some of the options: we can do more drive-through sites, we can give more to hospitals, we can do the Publix, we can do this.\" They calculated that 90% of their seniors live within a mile and a half of a Publix. And they said, \"We think that would be the easiest thing for our residents.\" So, we did that, and what ended up happening was, you had 65 Publix in Palm Beach. Palm Beach is one of the biggest counties, one of the most elderly counties, we've done almost 75% of the seniors in Palm Beach, and the reason is because you have the strong retail footprint. So our way has been multifaceted. It has worked. And we're also now very much expanding CVS and Walgreens, now that they've completed the long-term care mission.\n\n\n\nSharyn Alfonsi: The criticism is that it's pay-to-play, governor.\n\n\n\nRon DeSantis: And it's wrong. It's wrong. It's a fake narrative. I just disabused you of the narrative. And you don't care about the facts. Because, obviously, I laid it out for you in a way that is irrefutable.\n\n\n\nSharyn Alfonsi: Well, I— I was just—\n\n\n\nRon DeSantis: And, so, it's clearly not.\n\n\n\nSharyn Alfonsi: Isn't there the nearest Publix —\n\n\n\nRon DeSantis: No, no, no. You're wrong.\n\n\n\nSharyn Alfonsi: —30 miles away.\n\n\n\nRon DeSantis: You're wrong. You're wrong. Yes, sir?\n\n\n\nSharyn Alfonsi: That's actually a fact.\n\n\"The irresponsible suggestion that there was a connection between campaign contributions made to Governor DeSantis and our willingness to join other pharmacies in support of the state's vaccine distribution efforts is absolutely false and offensive,\" Publix said in a scathing statement provided to \"60 Minutes.\"\n\n\n\n\"We are proud of our pharmacy associates for administering more than 1.5 million doses of vaccine to date and for joining other retailers in Alabama, Florida, Georgia, South Carolina, Tennessee and Virginia to do our part to help our communities emerge from the pandemic,\" the grocery store said.\n\n\n\nFlorida's director of emergency management, Jared Moskowitz, the Democratic state official responsible for directing the response to the pandemic under Gov. DeSantis, came to the governor's defense and called Alfonsi's narrative \"absolute malarkey.\""
        },
        {
          "link": "https://www.theblaze.com/news/treasury-secretary-yellen-global-minimum-corporate-tax",
          "published": "2021-04-05T18:00:00",
          "title": "Biden admin to call for worldwide tax hike so that US businesses don’t leave country following its corporate tax increase",
          "text": "Treasury Secretary Janet Yellen will reportedly call for a global minimum corporate tax rate to prevent U.S. companies from relocating offshore in response to the Biden administration's forthcoming tax hikes, Axios reported on Monday.\n\nThe news outlet made clear that \"by trying to convince other countries to impose a global minimum tax, Yellen is acknowledging the risks to the American economy if it acts alone in raising corporate rates.\"\n\nThe administration has proposed initiating the largest tax hike in almost 30 years to pay for President Biden's more than $2 trillion American Jobs Act — a bill slated to fund America's \"infrastructure\" but that also finances major policy progressive policy initiatives such as climate research, green energy, and free education in addition to highways, bridges, and roads.\n\nThe tax changes include raising the country's corporate tax rate from 21% to 28%, a move that conservatives and moderate congressional Democrats have argued could be devastating for the American middle class.\n\nIn a speech to the Chicago Council on Global Affairs on Monday, Yellen is expected to push for all other industrialized nations to raise their corporate tax rates to a minimum standard, as well, to ensure economic \"competitiveness\" worldwide. However, she will reportedly argue that the tax rate minimum is for the main purpose of ensuring those foreign countries have enough revenue to maintain their own governments.\n\n\"Competitiveness is about more than how U.S.-headquartered companies fare against other companies in global merger and acquisition bids,\" the secretary plans to say, according to an excerpt of her prepared remarks obtained by Axios. \"It is about making sure that governments have stable tax systems that raise sufficient revenue to invest in essential public goods and respond to crises, and that all citizens fairly share the burden of financing government.\"\n\n\"We are working with G20 nations to agree to a global minimum corporate tax rate that can stop the race to the bottom,\" she will state.\n\nDuring Donald Trump's presidency, the business-minded Republican slashed the U.S. rate from 35% — a global high — to 21%, arguing the previous rate put American companies at a global disadvantage and resulted in many of them moving their businesses abroad.\n\nAccording to the Tax Foundation, a conservative tax group, the worldwide average corporate tax rate is just under 24%.\n\nAxios reported that Biden has tasked Yellen with convincing the business community that the massive infrastructure proposal and subsequent tax increases won't lead to inflation, a tall order by all accounts. Apparently, in the face of pressure, Yellen will look for significant international assistance."
        },
        {
          "link": "https://www.theblaze.com/news/georgia-republicans-want-coca-cola-products-removed-from-their-offices-after-ceo-criticizes-new-voting-law",
          "published": "2021-04-05T17:45:00",
          "title": "Georgia Republicans want Coca-Cola products removed from their offices after CEO criticizes new voting law",
          "text": "A group of Republican legislators in Georgia want Coca-Cola products removed from their offices after the company's CEO criticized the new election reforms signed into law by Gov. Brian Kemp (R).\n\nIn a letter addressed to Kevin Perry, the president and CEO of the Georgia Beverage Association, eight lawmakers from the state House on Saturday accused the Coca-Cola company of spreading misinformation about Georgia elections law and caving to \"out of control cancel culture.\"\n\n\"Your company has made the conscious decision to perpetrate a national dialogue which seeks to intentionally mislead the citizens of Georgia and deepen a divide in our great State,\" the lawmakers wrote. \"We have the responsibility to all of Georgia not to engage in those misguided intentions nor continue to support corporations who choose to.\"\n\nThe letter was signed by GOP state Reps. Victor Anderson, Clint Crowe, Matt Barton, Jason Ridley, Lauren McDonald III, Stan Gunter, Dewayne Hill, and Marcus Wiedower.\n\nOn March 25, Gov. Kemp signed a sweeping election reform bill into law that would require absentee ballots to be verified with a photo ID and expand early voting for primary and general elections, among other changes. Democrats including President Joe Biden and failed Georgia gubernatorial candidate Stacey Abrams have claimed the new law will make it harder for people to vote, particularly minorities and working-class Georgians. Biden falsely claimed that the new law \"ends voting hours early so working people can't cast their vote after their shift is over,\" a claim refuted by experts who note the law does not change Election Day voting hours and actually expands opportunities to vote early.\n\n\n\nRepublicans have also faced backlash over the law from several corporations, including Coca-Cola, and prominently the Major League Baseball Association, which pulled its All-Star Game out of the state because of the new law.\n\nLast week, Coca-Cola CEO James Quincy told CNBC the law was \"unacceptable.\" He released a statement on behalf of the Coca-Cola Company \"to be crystal clear and state unambiguously that we are disappointed in the outcome of the Georgia voting legislation.\"\n\nQuincy asserted that some measures of the bill \"would diminish or deter access to voting.\"\n\n\"Given Coke's choice to cave to the pressure of an out of control cancel culture, we respectfully request all Coca-Cola Company products be removed from our office suite immediately.\" the lawmakers wrote in response. \"Should Coke chose to read the bill, share its true intentions and accept their role in the dissemination of mistruths, we would welcome a conversation to rebuild a working relationship.\"\n\n"
        },
        {
          "link": "https://www.theblaze.com/news/bidens-easter-message-getting-the-covid-19-is-a-moral-obligation",
          "published": "2021-04-05T17:30:00",
          "title": "Biden's Easter message: Get the COVID-19 vaccine — it is a 'moral obligation'",
          "text": "President Joe Biden and first lady Dr. Jill Biden issued an impassioned plea to the American public on Easter Sunday: Vaccinate yourself out of \"moral obligation.\"\n\nWhat are the details?\n\nIn a Sunday video, the president and first lady implored Americans to get vaccinated against the novel coronavirus.\n\nEchoing Pope Francis' remarks, the Bidens said, \"We share the sentiments of Pope Francis, who has said that getting vaccinated is a moral obligation, one that can save your life and the lives of others. By getting vaccinated and encouraging your congregations and communities to get vaccinated, we not only can beat this virus, we can also hasten the day when we can celebrate the holidays together.\"\n\nElsewhere in his remarks, Biden also invoked the Gospel of John.\n\n\"As we celebrate this most holy day, we know many are still going without familiar comforts of the season,\" he said. \"The virus is not gone, and so many of us still feeling the longing and loneliness of distance. For a second year, most will be apart from their families, friends, the full congregations that fill us with joy.\"\n\nHe added, \"And yet as the Gospel of John reminds us, the light shines in the darkness, and the darkness has not overcome it.\"\n\nJill added, \"The traditions of Holy Week take us on a journey from sorrow to salvation, reminding us that with faith, hope, and love, anything is possible.\"\n\nWhat else?\n\nBack in January, Pope Francis suggested that people have a \"moral obligation\" to be vaccinated.\n\n\"I believe that morally everyone must take the vaccine,\" he said. \"It is the moral choice because it is about your life but also the lives of others.\"\n\nHe added, \"I do not understand why some say that this could be a dangerous vaccine. If the doctors are presenting this to you as a thing that will go well and doesn't have any special dangers, why not take it? ... There is a suicidal denialism that I would not know how to explain, but today people must take the vaccine.\""
        }
      ]
    },
    "tgp": {
      "rss": "http://trendingpolitics.com/feed/",
      "link": "http://trendingpolitics.com/",
      "articles": [
        {
          "link": "https://trendingpolitics.com/justice-thomas-drops-the-hammer-on-big-tech-in-epic-defense-for-conservatives-in-america/?utm_source=rss&utm_medium=rss&utm_campaign=justice-thomas-drops-the-hammer-on-big-tech-in-epic-defense-for-conservatives-in-america",
          "published": "2021-04-05T18:54:58",
          "title": "Justice Thomas Drops The Hammer on Big Tech In Epic Defense For Conservatives in America",
          "text": "Supreme Court Justice Clarence Thomas unleashed on Big Tech on Monday in an epic defense for conservatives across America. Thomas argued that Facebook and Twitter may not be able to use the First Amendment as an excuse to censor people on their platforms.\n\n“Even if digital platforms are not close enough to common carriers, legislatures might still be able to treat digital platforms like places of public accommodation. Although definitions between jurisdictions vary, a company ordinarily is a place of public accommodation if it provides ‘lodging, food, entertainment, or other services to the public … in general,’” Thomas said, also noting that “Twitter and other digital platforms bear resemblance to that definition.”\n\n“Once again, a doctrine, such as public accommodation, that reduces the power of a platform to unilaterally remove a government account might strengthen the argument that an account is truly government controlled and creates a public forum,” Thomas said. “The similarities between some digital platforms and common carriers or places of public accommodation may give legislators strong arguments for similarly regulating digital platforms. ‘[I]t stands to reason that if Congress may demand that telephone companies operate as common carriers, it can ask the same of’ digital platforms.”\n\n“That is especially true because the space constraints on digital platforms are practically nonexistent (unlike on cable companies), so a regulation restricting a digital platform’s right to exclude might not appreciably impede the platform from speaking,” Thomas continued.\n\nHe went on to say, “None of this analysis means, however, that the First Amendment is irrelevant until a legislature imposes common carrier or public accommodation restrictions — only that the principal means for regulating digital platforms is through those methods,” which could be interpreted as a pre-emptive endorsement of Congress if they choose to impose common carrier or public accommodation restrictions to social media platforms.\n\n***BRAND NEW Trump 2024 Hat Is Your FREE – Just Cover Shipping!***\n\nLater on during his statement, Thomas referred to the issue of Section 230.\n\n“Threats directed at digital platforms can be especially problematic in the light of [Section 230], which some courts have misconstrued to give digital platforms immunity for bad-faith removal of third-party content,” he said. “This immunity eliminates the biggest deterrent — a private lawsuit — against caving to an unconstitutional government threat.\n\n“The Second Circuit feared that then-President Trump cut off speech by using the features that Twitter made available to him. But if the aim is to ensure that speech is not smothered, then the more glaring concern must perforce be the dominant digital platforms themselves. As Twitter made clear, the right to cut off speech lies most powerfully in the hands of private digital platforms. The extent to which that power matters for purposes of the First Amendment and the extent to which that power could lawfully be modified raise interesting and important questions. This petition, unfortunately, affords us no opportunity to confront them,” Thomas finished.\n\n***Help Us Take Down The Liberal Media With Our FREE News App!***\n\nWhat are your thoughts? Let us know in the comments below!"
        },
        {
          "link": "https://trendingpolitics.com/breaking-jewish-family-with-special-needs-child-gets-kicked-off-spirit-airlines-flight-because-2-year-old-was-eating-without-mask-on/?utm_source=rss&utm_medium=rss&utm_campaign=breaking-jewish-family-with-special-needs-child-gets-kicked-off-spirit-airlines-flight-because-2-year-old-was-eating-without-mask-on",
          "published": "2021-04-05T18:27:11",
          "title": "BREAKING: Spirit Airlines Removes Jewish Family With Special Needs Child Because 2-Year Old Was Eating Without Mask On",
          "text": "Shocking new video footage shows a Jewish family with a special needs child being removed from a Spirit airlines flight because their 2-year old daughter wasn’t wearing a mask while eating.\n\nJoe Biden must be incredibly proud.\n\n“What did I do?” asked the mother.\n\n“I told you, if you’re not in compliance, you have to get off,” the flight attendant said sternly.\n\n“What did we do?,” the husband asked again.\n\n“Non-compliance with the mask,” the attendant replied.\n\n“We’re wearing masks!” both parents replied.\n\n“She’s not wearing a mask,” said the angry attendant as she pointed to the young girl.\n\nWatch the entire situation unfold here:\n\nWATCH THIS: A family was just kicked off a @SpiritAirlines flight from Orlando to NY, because their two-year-old child who was eating, wasn’t wearing a mask. The mother is 7 months pregnant, and they have a special needs child. The entire flight was deplaned. pic.twitter.com/dcjLIEbDfA — Breaking911 (@Breaking911) April 5, 2021\n\nBelow is Part 2. This video reveals that the mother is pregnant. They also have a special needs child. Sadly, the heartless Spirit airlines proudly kicked them off the flight anyway.\n\n\n\n\n\n\n\nWelcome to Joe Biden’s America."
        },
        {
          "link": "https://trendingpolitics.com/desantis-60-minutes-takedown-knab/?utm_source=rss&utm_medium=rss&utm_campaign=desantis-60-minutes-takedown-knab",
          "published": "2021-04-05T17:16:24",
          "title": "’60 Minutes’ Gets Heated Blowback for DeSantis Takedown Masked as Investigative Journalism",
          "text": "On Sunday night, ’60 Minutes’ rolled out a selectively edited hit job on Florida Governor Ron DeSantis. It was driven by a politically biased agenda to take down a rising star in the Republican Party who many believe may have presidential ambitions in the future.\n\nThe relative success of the State of Florida in responding to a pandemic that threatens its sizable elderly population, while maintaining a reasonable degree of public freedom and respect for citizens’ rights, has been a constant thorn in the side to Democrats who have been long on fear and short on facts addressing the COVID risks.\n\nThe supposed controversy turns on whether or not Florida Governor Ron DeSantis gave a favorable vaccine contract to Publix, Florida’s most widely available grocery store, to assist with the vaccine rollout in exchange for a $100,000 contribution to a PAC.\n\nThe “pay-to-play” scandal allegation surfaced last month after Sharyn Alfonsi lobbed accusations at Governor DeSantis at a press conference. The “60 Minutes” episode on Sunday dropped context that would have done much to give the audience the impression that there is ‘no story there.’\n\nThe segment was so one-sided and unfair, not just to the governor but to Florida’s entire representative government, that the blowback against the one-time respectable investigative news show has been furious. It is illustrative to merely give the observations of skilled media observers below.\n\nThe 60 Minutes’ attempt at a hit piece on @GovRonDeSantis spoke more to how much they fear him rather than anything else. — Laura Ingraham (@IngrahamAngle) April 5, 2021\n\nThe director of Florida’s division of emergency management, a former 3-term Democratic state legislator, responding to @60Minutes’ report tonight suggesting the DeSantis admin gave Publix preferable treatment based on their donations to DeSantis’ PAC https://t.co/RPhAzEM7BP — Grace Panetta (@grace_panetta) April 5, 2021\n\nThe full unedited video shows that 60 Minutes cut out everything in bold from DeSantis in the transcript below. Pretty wild.https://t.co/7JtTrd69ikhttps://t.co/D2m7IpyD0Uhttps://t.co/ctTwTEcJoTpic.twitter.com/MMOg987nJp — Jerry Dunleavy (@JerryDunleavy) April 5, 2021\n\nI analyze “60 Minutes” DeSantis vaccine conspiracy theories about the REAL reasons he prioritized the most COVID-vulnerable group and utilized state’s most popular grocery store to successfully distribute. And why CBS hid facts that countered their theory. https://t.co/rXr8LvBtH7 — Mollie (@MZHemingway) April 5, 2021\n\nAlong with the revelations that shot giant holes in CBS’s narrative, were allegations about the real reason that the network ran the misleading story.\n\nThe media is DESPERATE to go after @GovRonDeSantis for any tiny thing they can because they know his leadership has been the best in 2020/2021 and it terrifies them to see a Republican who has very little on him that they can criticize running circles around Dems. https://t.co/uvNC3GzWsg — Robby Starbuck (@robbystarbuck) April 5, 2021\n\nThey’re going after @GovRonDeSantis for one reason. Right now he’s the biggest threat to the Marxist Democrats’ control sham. — John Cardillo (@johncardillo) April 5, 2021\n\n\n\n\n\n\n\n.@60Minutes had a chance to cover the New York nursing home scandal, and they instead chose to shotgun any DeSantis narrative they could, hoping something would stick. What a metaphor for the coverage capabilities of our pathetic, partisan media. — Erielle Davidson (@politicalelle) April 5, 2021\n\n60 minutes going after @GovRonDeSantis who is by far the best Governor in America. Has @60Minutes minutes done an expose on Gov. Cuomo’s hand in killing 11 thousands seniors & his multiple sexual assault allegations? — Melissa Tate (@TheRightMelissa) April 5, 2021\n\nLies the media have promulgated about DeSantis because they fear his 2024 candidacy:\n\n1. His willingness to allow local officials to open beaches, etc., would lead to massive death (lie);\n\n2. He artificially deflated death statistics (lie); — Ben Shapiro (@benshapiro) April 5, 2021\n\nThe parting shot.\n\nThe media is going to will a President DeSantis into existence. — Stephen L. Miller (@redsteeze) April 5, 2021\n\nAs seen on Becker News. Follow Kyle Becker and Becker News on Twitter."
        },
        {
          "link": "https://trendingpolitics.com/breaking-2nd-gop-governor-joins-floridas-ron-desantis-in-covid-passport-opposition-mississippis-tate-reeves-knab/?utm_source=rss&utm_medium=rss&utm_campaign=breaking-2nd-gop-governor-joins-floridas-ron-desantis-in-covid-passport-opposition-mississippis-tate-reeves-knab",
          "published": "2021-04-05T16:15:33",
          "title": "BREAKING: 2nd GOP Governor Joins Florida’s Ron DeSantis in COVID Passport Opposition — Mississippi’s Tate Reeves",
          "text": "On Monday, a second GOP Governor joined with Florida’s Ron DeSantis in opposition to so-called “COVID passports” that prove that someone has been vaccinated: Mississippi Governor Tate Reeves.\n\n“I don’t think it’s necessary, and I don’t think it’s a good thing to do in America,” Reeves told Jake Tapper on CNN’s “State of the Union.”\n\nFlorida Governor Ron DeSantis on Friday signed an executive order to forbid COVID passports in the State of Florida. The governor has also called on the Republican-led Legislature to push forth a measure addressing ‘vaccine passports.”\n\n“We are not supporting doing any vaccine passports in the state of Florida,” DeSantis said earlier. “It’s completely unacceptable for either the government or the private sector to impose upon you the requirement that you show proof of vaccine to just simply be able to participate in normal society.”\n\n“You want the fox to guard the henhouse?” DeSantis said. “I mean, give me a break.”\n\n“I think this is something that has huge privacy implications,” he continued. “It is not necessary to do. You know, we’re going to have hit 3.5 million seniors that have gotten shots sometime this week. Likely 75% of seniors. It’s important to be able to do it. But at the same time, we are not going to have you provide proof of this just to be able to live your life normally.”\n\n“And I am going to be taking some action, in the executive function, emergency function here, very shortly,” the governor added.\n\nThe Washington Post earlier reported that the Biden administration was looking into a “COVID passport.”\n\n“The Biden administration and private companies are working to develop a standard way of handling credentials — often referred to as ‘vaccine passports’ — that would allow Americans to prove they have been vaccinated against the novel coronavirus as businesses try to reopen,” the Washington Post reported.\n\n“The effort has gained momentum amid President Biden’s pledge that the nation will start to regain normalcy this summer and with a growing number of companies — from cruise lines to sports teams — saying they will require proof of vaccination before opening their doors again,” the report continued.\n\nNew York has already launched its COVID passport, following a trial run on thousands of New Yorkers testing the program. The Excelsior Passport was reported to be “the first of its kind to be rolled out in United States and allows specific sites that administer COVID vaccines or test for the coronavirus to upload the data to the app,” the Gothamist reported.\n\nIt is encouraging to see a few state governors “get it.” Now, we need to see more governors in America actually take action against this dangerous infringement on civil liberties.\n\n\n\n\n\n\n\nAs seen on Becker News. Follow Kyle Becker and Becker News on Twitter."
        },
        {
          "link": "https://trendingpolitics.com/breaking-news-scotus-rules-on-trumps-twitter-account-justice-thomas-fires-warning-shot-at-big-tech-knab/?utm_source=rss&utm_medium=rss&utm_campaign=breaking-news-scotus-rules-on-trumps-twitter-account-justice-thomas-fires-warning-shot-at-big-tech-knab",
          "published": "2021-04-05T15:33:13",
          "title": "SCOTUS Rules on Trump’s Twitter Account, Justice Thomas Fires Warning Shot at Big Tech",
          "text": "The Supreme Court has ruled on a case on Monday related to former President Donald Trump’s use of his Twitter account. Specifically, the case dealt with whether or not he was allowed to block users who were repeatedly criticizing him.\n\nTwitter users filed the case Knight First Amendment Institute v. Trump in 2017 and argued that the former president had violated their First Amendment rights by blocking their user accounts. While Trump tweeted from his personal account, the Twitter users argued that he had used it in a presidential capacity by releasing official statements, thus making it a “public forum.” In 2018, a judge in New York ruled that the president’s actions were unconstitutional.\n\nSCOTUS sent the case back to a federal appeals court and dismissed it as moot. Justice Clarence Thomas wrote a concurring opinion stating that dismissing the case was the right thing to do, noting that Donald Trump is no longer in office.\n\nMore importantly, Justice Thomas shared his view that digital and social media platforms now wield dangerous amounts of concentrated political power that will have to be addressed by the nation’s highest court.\n\n“Today’s digital platforms provide avenues for historically unprecedented amounts of speech, including speech by government actors,” Thomas wrote. “Also unprecedented, however, is the concentrated control of so much speech in the hands of a few private parties. We will soon have no choice but to address how our legal doctrines apply to highly concentrated, privately owned information infrastructure such as digital platforms.”\n\n“Applying old doctrines to new digital platforms is rarely straightforward,” Thomas added. “Respondents have a point, for example, that some aspects of Mr. Trump’s account resemble a constitutionally protected public forum. But it seems rather odd to say that something is a government forum when a private company has unrestricted authority to do away with it.”\n\nJustice Thomas remarks clearly that he does not believe digital platforms have First Amendment rights. This is a warning shot to Big Tech companies like Twitter.\n\n“This is not the first or only case to raise issues about digital platforms,” Thomas comments. “While this case involves a suit against a public official, the Court properly rejects today a separate petition alleging that digital platforms, not individuals on those platforms, violated public accommodations laws, the First Amendment, and antitrust laws.”\n\nThomas’s opinion hints that he views these Big Tech giants as having too much power for the public good. Now, the right legislation and lawsuits need to be filed to put an end to their abuse of power.\n\nAs seen on Becker News. Follow Kyle Becker and Becker News on Twitter."
        }
      ]
    },
    "trend": {
      "rss": "http://www.thegatewaypundit.com/feed/",
      "link": "http://www.thegatewaypundit.com/",
      "articles": [
        {
          "link": "https://www.thegatewaypundit.com/2021/04/gotta-squeeze-jill-joe-biden-super-awkward-exchange-easter-bunny-video/",
          "published": "2021-04-05T19:25:23",
          "title": "‘You Gotta Squeeze It’ – Jill and Joe Biden Have Super Awkward Exchange with the Easter Bunny (VIDEO)",
          "text": "What did we just watch?\n\nJoe Biden and his handler wife Jill on Monday joined the Easter Bunny to deliver remarks from the White House balcony.\n\nThe annual White House Easter Egg Roll was canceled this year due to ‘Covid concerns’ but the Bidens made up for it with a super awkward appearance with the Easter bunny.\n\nThe Easter bunny walked onto the balcony wearing a face mask…a person in a bunny mask was wearing a mask.\n\nTRENDING: FBI Sends Out Warning Advising Against Buying, Making or Misrepresenting a Vaccine Card Which May Be \"Breaking the Law\"\n\nAfter Biden delivered brief remarks and encouraged Americans to get vaccinated, things got really awkward – it was 40 seconds of cringe that felt like an eternity.\n\n“May God protect our troops, and take care of the Easter bunny,” Biden said.\n\nAt one point, Jill Biden grabbed a flower and handed it over to the bunny but he couldn’t hold the flower because of his bunny paws.\n\nJoe Biden chuckled and said, “You gotta squeeze it – you got it man.”\n\nWe are the laughing stock of the world because of the Bidens.\n\nWATCH:"
        },
        {
          "link": "https://www.thegatewaypundit.com/2021/04/family-kicked-off-spirit-airlines-flight-2-year-old-child-eating-wasnt-wearing-mask-video/",
          "published": "2021-04-05T18:41:35",
          "title": "Family Kicked Off Spirit Airlines Flight Because Their 2-Year-Old Child Who Was Eating, Wasn’t Wearing a Mask (VIDEO)",
          "text": "Spirit Airlines kicked a family off of a flight from Orlando to New York on Monday because their 2-year-old child was not wearing a mask… while she was eating.\n\nThe child was eating.\n\nThe flight attendant told the parents they weren’t complying with the mask policy and told them they had to pick up their belongings and deplane.\n\nOther travelers sitting near the family defended them, but the flight attendant would not back down.\n\nTRENDING: FBI Sends Out Warning Advising Against Buying, Making or Misrepresenting a Vaccine Card Which May Be \"Breaking the Law\"\n\nThe mother, who is 7 months pregnant, told the flight attendant that her child just turned two one month ago.\n\nWATCH:\n\nWATCH THIS: A family was just kicked off a @SpiritAirlines flight from Orlando to NY, because their two-year-old child who was eating, wasn’t wearing a mask. The mother is 7 months pregnant, and they have a special needs child. The entire flight was deplaned. pic.twitter.com/dcjLIEbDfA — Breaking911 (@Breaking911) April 5, 2021\n\nThe parents were also traveling with a special needs son who is prone to seizures.\n\nAccording to a report, the entire flight was deplaned.\n\nPart two of the video:\n\nA few weeks ago a family was kicked off of a Spirit Airlines flight because their four-year-old autistic son wouldn’t wear a mask, despite a note from a doctor."
        },
        {
          "link": "https://www.thegatewaypundit.com/2021/04/smartest-guy-joe-biden-knows-hunter-biden-says-smoked-parmesan-cheese-mistaking-crack-video/",
          "published": "2021-04-05T18:02:57",
          "title": "The Smartest Guy Joe Biden Knows: Hunter Biden Says He Smoked Parmesan Cheese, Mistaking it For Crack (VIDEO)",
          "text": "This is the smartest guy Joe Biden knows.\n\nJoe Biden’s deviant spawn Hunter sat down for an interview with CBS Sunday Morning host Tracy Smith to promote his ‘memoir’ Beautiful Things.\n\n“I spent more time on my hands and knees picking through rugs, smoking anything that remotely resembled crack cocaine — I probably smoked more parmesan cheese than anyone that you know, Tracy,” Hunter said.\n\n“I went one time for 13 days without sleeping, and smoking crack and drinking vodka throughout that entire time,” he said.\n\nTRENDING: FBI Sends Out Warning Advising Against Buying, Making or Misrepresenting a Vaccine Card Which May Be \"Breaking the Law\"\n\nWATCH:\n\nHunter Biden smoked more parmesan cheese than anyone you know pic.twitter.com/0T4J2S8647 — PG Howie (@pghowie3) April 5, 2021\n\nIn October of 2020, Joe Biden said, “My son Hunter is the smartest guy I know.”\n\nAUDIO:"
        },
        {
          "link": "https://www.thegatewaypundit.com/2021/04/city-council-raging-idiots-ignore-actual-facts-crime-policing-favor-radical-leftist-fantasy-portland-police-go-off-exit-interviews/",
          "published": "2021-04-05T17:50:05",
          "title": "“The City Council Are Raging Idiots – Ignore Actual Facts on Crime and Policing in Favor of Radical Leftist Fantasy” – Portland Police Go Off in Exit Interviews",
          "text": "The City of Portland, Oregon has lost 115 police officers since July 2020. 74 retired and 41 resigned.\n\nThe situation for police officers in Portland is so bad that nearby Spokane, Washington is advertising for cops in Portland in a very public billboard campaign.\n\nAnd police officers are roasting city officials in their exit interviews.\n\nTRENDING: FBI Sends Out Warning Advising Against Buying, Making or Misrepresenting a Vaccine Card Which May Be \"Breaking the Law\"\n\nOne officer left this for city officials to stew over as he walked out the door, “The community shows zero support. The city council are raging idiots, in addition to being stupid. Additionally, the mayor and council ignore actual facts on crime and policing in favor of radical leftist and anarchists fantasy.”\n\nOregon Live reported:\n\nThey mocked city leaders. They bemoaned the lack of true community-based policing. And they were all Portland officers and supervisors who chose to leave the state’s largest police force in the last year. In 31 exit interview statements, the employees who turned in their badges or retired were brutally frank about their reasons for getting out. “The community shows zero support. The city council are raging idiots, in addition to being stupid. Additionally, the mayor and council ignore actual facts on crime and policing in favor of radical leftist and anarchists fantasy. What’s worse is ppb command (lt. and above) is arrogantly incompetent and cowardly,” one retiring detective wrote. “The only differences between the Titanic and PPB?” he continued. “Deck chairs and a band.” Since July 1, 115 officers have left the Police Bureau, including 74 who retired and 41 who resigned. Two more will resign by the end of this month and one more is retiring. They make up one of the biggest waves of departures in recent memory."
        },
        {
          "link": "https://www.thegatewaypundit.com/2021/04/big-media-spread-fears-fourth-wave-caused-double-mutant-covid-variant-found-us-video/",
          "published": "2021-04-05T17:30:43",
          "title": "Big Media Spread Fears About a Fourth Wave Caused by a “Double Mutant” Covid Variant Found in the US (VIDEO)",
          "text": "Since buzzwords like “mutant” and “variant” haven’t scared Americans into submission, Big Media is now telling the public that a fourth wave of Covid is around the corner because of a “double mutant” variant found in the US.\n\nThese Covid tyrants want you cowering in fear forever.\n\nSeveral states have opened up at full capacity within the last couple weeks so the media is in full force screeching about another “surge.”\n\n“This morning concerns about a double mutant Coronavirus variant in the US…now identified in the San Francisco area,” GMA said.\n\nTRENDING: FBI Sends Out Warning Advising Against Buying, Making or Misrepresenting a Vaccine Card Which May Be \"Breaking the Law\"\n\nWATCH:"
        }
      ]
    },
    "cdm": {
      "link": "http://creativedestructionmedia.com/",
      "articles": [
        {
          "title": "The Great Reset Is Coming All right, But It’s Not What You Think",
          "text": "Populists Will ‘Reset’ Western Civilization\n\nImage by Oeoi\n\nPlease Follow us on Gab, Parler, Minds, Telegram, Rumble\n\nThe coup of 2020 was a gift to the West, although most don’t yet realize it. You see, the Marxists wanted another decade to encroach upon our liberties, further infiltrate Western governments, and destroy Western societal foundations, to take their agenda to the point of no return.\n\nBut, the election of President Trump forced them to act earlier. His election, and re-election, forced them to reveal themselves and their evil agenda.\n\nTheir mask is off for good.\n\nThere is a great awakening happening across Western Civilization.\n\nThe third term of Barack Obama is begin exposed as a nest of lies and societal destruction. This is a gift and we must recognized it as such as we fight to save the republic from this communist onslaught.\n\nThe active Left is actually a very small part of America. Unfortunately they control the media, and have worked to control the levers of government and our national security apparatus.\n\nHowever, they are not invincible, not by a long shot. The people hold the power.\n\nWhy do you think there is now a fence around Washington, D.C.? Because these traitors realize at some point the people will have had enough, and will hold them accountable.\n\nThe quickest way to eviscerate their power is to stop giving them money. That means get off their social networks which are surveilling you and your friends. There are plenty of free speech alternatives. Stop watching and reading the corporate media. Just stop giving them clicks. Stop shopping at and using the products of ‘woke capital’. Defund them!\n\nThis will get their attention and bring change.\n\nGet active in local politics. Force change on the GOP.\n\nBuild local community networks.\n\nFind, or even build, an un-‘woke’ church.\n\nIn short, build a new populist economic echosystem in America.\n\nThis is the way forward and how we can use the ‘gift’ given to us by Trump to the fullest extent possible as we save this nation for our grandchildren.\n\nKeep The Truth Bombs Coming From CDMedia! Donate!",
          "link": "https://creativedestructionmedia.com/opinion/2021/04/05/the-great-reset-is-coming-all-right-but-its-not-what-you-think/",
          "published": "2021-04-05T00:00:00"
        },
        {
          "title": "WATCH LIVESTREAM HERE: War Room Pandemic 10-12PM EST M-S, 5-6PM EST M-F",
          "text": "Please Follow us on Gab, Parler, Minds, Telegram, Rumble\n\nYou can support CDMedia by watching War Room here!\n\nWe are working to get these new War Room links embedded on our site. However, until then, you can watch the livestream below depending on which channel you want. Thank you for your support!\n\nHere is to link to the show on Pluto TV. You can watch for free online via mobile web browser or if you already have the Pluto TV app, it will ask you if they want to watch the service in the app.\n\nHere is the link to the show on The Roku Channel. You can watch for free online via your mobile web browser.\n\nKeep The Truth Bombs Coming From CDMedia! Donate!",
          "link": "https://creativedestructionmedia.com/analysis/2021/04/05/livestream-war-room-pandemic-10-12pm-est-m-s-5-6pm-est-m-f/",
          "published": "2021-04-05T00:00:00"
        },
        {
          "title": "Russian Illegal Immigration Down By Almost Half In 2020",
          "text": "(Stevens1891Russland) pg111 HARVEST TRAMPS\n\nPlease Follow us on Gab, Parler, Minds, Telegram, Rumble\n\nIllegal immigration into the Russian Federation decreased by almost half in 2020 due to the Covid-19 pandemic according to the Russian Interior Ministry. Many nationalities from the former Soviet Union travel to Russia for work as the economy is generally better than in most CIS member nations.\n\n“Within 12 months of 2020, the regional departments of the Russian Interior Ministry prevented 40,989 cases of law infringements regarding work activities conducted by a foreign citizen, or a person without the Russian citizenship, on the territory of Russia, which is 40% decline against the previous year,” the ministry’s press service stated.\n\n“Due to the decrease in foreign citizens’ arrivals in Russia, caused by the [novel coronavirus] pandemic, a number of procedure violations in regard to entry or stay in the country has been halved,” according to the ministry. “In all, over 204,000 violations of this kind were reported [in 2020], which is 51.8% drop against the previous year.”\n\nThe ministry’s press office also stated that 5.5 million foreign citizens were registered staying in Russia last year, while the average figure previously ranged between nine and eleven million. Almost 900,000 of the above-mentioned 5.5 million foreigners had temporary residence permits, wrote Russian state news agency TASS.\n\nYou Won’t Get Anywhere Else What You Get From CDMedia! Donate!",
          "link": "https://creativedestructionmedia.com/news/europe/2021/04/05/russian-illegal-immigration-down-by-almost-half-in-2020/",
          "published": "2021-04-05T00:00:00"
        },
        {
          "title": "Dollar’s Share Of Global Reserves Tumbles To Lowest Since 1995 As Yuan’s Hits All Time High",
          "text": "Please Follow us on Gab, Parler, Minds, Telegram, Rumble\n\nLast week, the The IMF released the latest Currency Composition of Ofﬁcial Foreign Exchange Reserves (COFER) report for Q4 2020.\n\nIt showed that the trend of global dedollarization has accelerated and while the Dollar’s share of global reserves initially increased at the start of the pandemic, it has since decreased sharply and now stands at just 59% – a 1.5% decline for the quarter and the lowest level since 1995. According to Goldman, a fair bit of the decline over the last few quarters was due to valuation effects as the Dollar depreciated, but the decline in Q4 can be largely attributed to active selling as well. The Euro, Yen and Renminbi were the main beneﬁciaries of this dollar dump, while the uptick in Sterling’s share appears to be mostly due to the currency’s appreciation.\n\nWhile the Dollar’s share in allocated reserves has fallen markedly, the Euro’s share has enjoyed a modest rebound and last quarter moved decisively out of the range where it has been stuck for the past few years…\n\nTo read more visit Zero Hedge.\n\nKeep The Truth Bombs Coming From CDMedia! Donate!",
          "link": "https://creativedestructionmedia.com/news/markets/2021/04/05/dollars-share-of-global-reserves-tumbles-to-lowest-since-1995-as-yuans-hits-all-time-high/",
          "published": "2021-04-05T00:00:00"
        },
        {
          "title": "Salvini Hits Back Against Leftist Criticism Over Meeting With Orban",
          "text": "Screenshot\n\nPlease Follow us on Gab, Parler, Minds, Telegram, Rumble\n\nItalian populist Senator Matteo Salvini has hit back against criticism from Italian leftists over his recent meeting with Hungarian prime minister Viktor Orbán and Polish prime minister Mateusz Morawiecki.\n\nMember of the Italian Democratic Party (PD) attacked Salvini over the meeting, accusing him of doing a “U-turn” on Prime Minister Mario Draghi, whose pro-European Union government Salvini currently supports.\n\nEnrico Letta, a former Prime Minister of Italy and secretary of the PD, stated that Salvini’s move was akin to a football fan put on the shirt of a rival club, claiming Salvini was not credible, newspaper Il Giornale reports…\n\nTo read more visit Breitbart.\n\nYou Won’t Get Anywhere Else What You Get From CDMedia! Donate!",
          "link": "https://creativedestructionmedia.com/news/europe/2021/04/04/salvini-hits-back-against-leftist-criticism-over-meeting-with-orban/",
          "published": "2021-04-04T00:00:00"
        }
      ]
    },
    "fte": {
      "rss": "http://fivethirtyeight.com/politics/feed/",
      "link": "http://fivethirtyeight.com/",
      "articles": [
        {
          "link": "https://fivethirtyeight.com/features/why-being-anti-media-is-now-part-of-the-gop-identity/",
          "published": "2021-04-05T11:00:00",
          "title": "Why Being ‘Anti-Media’ Is Now Part Of The GOP Identity",
          "text": "There’s little question that the media is one of the least trusted institutions in Republican circles.\n\nIn the past two decades, trust in traditional media has plummeted — especially among Republicans. According to polling from Gallup, since at least the late 1990s, Republicans have been less likely than Democrats (and independents) to say they trust the media. But starting in 2015, trust among Republicans took a nosedive, falling from 32 percent to 10 percent in 2020. (Meanwhile, among Democrats, trust in the media has actually climbed back up, and by quite a bit.)\n\nPart of this is because Republicans are often more vocal in their criticism of the media and have long perceived it as having a liberal bias. But now they are also more likely to say that being “anti-media” is part of their political identity, and this is likely driving the staggering gap in media trust that we are seeing.\n\nrelated: How ‘Cancel Culture’ Became An Issue For Young Republicans Read more. »\n\nLet’s start with Republicans’ media habits. In our fractured media ecosystem, it’s not uncommon for both Republicans and Democrats to seek out news sources that reinforce their political beliefs. And as a new study finds, exposure to media that is partisan — whether liberal or conservative — reduces people’s overall trust in the mainstream press regardless of political party. But what sets Republicans apart at this point is their steady reliance on just one source for all their news: Fox News.\n\nElections to watch in 2021| FiveThirtyEight Politics Podcast\n\nIn its study of the media landscape in the lead-up to the 2020 presidential election cycle, the Pew Research Center found that of the 30 news sources it asked about, only Fox News was trusted by a majority of Republicans. (Republicans’ second-most-trusted source, ABC News, wasn’t even a close second: 33 percent said they trusted ABC News for political and election news compared with 65 percent who trusted Fox News.) This finding stands in stark contrast with the views of Democrats, who said they trusted a variety of news sources, and it marks a further decline in Republicans’ trust of other news sources since Pew last conducted a similar survey in 2014.\n\nThis is in part because animosity toward the other party is at an all-time high and Republicans increasingly associate the news media with the Democratic Party. That means they are more likely to dismiss a source that isn’t Fox News (or One America News Network or Newsmax) as politically biased. For example, in a January YouGov/American Enterprise Institute poll among people who said they voted for then-President Trump in 2020, a staggering 92 percent strongly or somewhat agreed that “the mainstream media today is just a part of the Democratic Party.”\n\nThis distrust, and Republicans’ growing animosity toward the media, is significant because they’re already isolated news consumers. And studies have shown that when news consumers exist in a media bubble, they can be hostile toward news that doesn’t match their political beliefs. (It also means they can be too trusting of their preferred news outlets.) Plus, as Jonathan Ladd, a Georgetown University public policy and government professor and the author of “Why Americans Hate the Media and How It Matters,” points out, Republicans are getting the message from Fox News (and the broader conservative media ecosystem) that the mainstream media can’t be trusted. “This isn’t new,” Ladd said, but he added that the conservative media’s continued criticism of the press has been “kicked into high gear” by the modern Republican Party.\n\nTake what happened in the Trump era. During both his campaign for the presidency and his four years in office, Trump openly attacked the media, calling journalists or news organizations critical of him or his administration “fake news.” Consequently, his supporters’ existing perceptions of media bias and distrust of news organizations intensified — this was especially true among his white supporters, who are more likely to consume exclusively conservative media. For instance, at many of Trump’s campaign events, his supporters would disparage, attack and threaten the press. And now, when Trump’s supporters disagree with a fact, they can decry it as “fake news” — whether it be crowd size or election results.\n\nrelated: Why Attacking ‘Cancel Culture’ And ‘Woke’ People Is Becoming The GOP’s New Political Strategy Read more. »\n\nHostility and distrust of the news media, in other words, has become a point of political identity among Republicans. We see this especially in how people talk about politics online. Take, for instance, a recent study of tweets mentioning “fake news.” Over the course of 15 months, study authors Jianing Li and Min-Hsin Su of the University of Wisconsin-Madison found an uptick in the number of tweets that used the words “we” or “our” and “they” or “their” in conjunction with the phrase “fake news.” Essentially, the researchers concluded that online discussions about “fake news” were a way for conservatives to create a sense of group belonging (“This is the worst kind of fake news possible. We have to stop this sort of thing”) while also establishing a shared enemy (“Fake News Media is a Hate Group. They hate President Trump”). The use of pronouns that signify group belonging (like “we”) and group opposition (like “they”) are useful on social media platforms, like Twitter, where users interact with strangers. Even though users might not know one another personally, they are still attempting to cultivate a community, which is certainly true of users who tweet about politics.\n\nAnother study that looked at trust in news media, by University of California, Berkeley, political scientists Taeku Lee and Christian Hosam, found that this attitude, independent of partisanship, helped predict a number of political opinions, such as support for a pathway to citizenship and affirmative action. But arguably, what was more consequential is that over time (from 2016 to 2019), the role of media distrust in opinion formation shifted such that individuals who distrust the media more consistently consolidated around Trump. Essentially, that media distrust now operates “as a basis for Americans to sort themselves into political tribes,” according to Lee. And as their study suggests, “fake news” functions as a “shibboleth,” or a way for Trump supporters to distinguish themselves, ideologically, even from other Republicans. It is possible that “a new form of conservatism is likely brewing with media distrust being one of its biggest factors,” Hosam told me.\n\nSo, why is being anti-media so central to the Republican identity? It’s not a coincidence that, against a backdrop of growing partisan animosity, Republicans’ distrust of the media is increasing as they grow more suspect that it leans Democratic. But it’s more than that, too. As Hosam explains, “what Trump does is connect that type of opposition to the media into a form of conservatism that just wasn’t around before.” And one byproduct of that is that media distrust is more central to conservatives’ group identity than it was before Trump. Or, as Lee put it, signaling media distrust is “much the same as wearing a red MAGA cap.”\n\nAs a researcher, Hosam admits that this can make studying distrust of the media a complicated topic, since distrust has shifted from an attitude about the institution itself to a credential of conservatism. “Now it’s even more difficult to know what people are really getting at when they talk about the media … what media diets and trust in the media are truly telling us.” And for many Republicans, that might mean distrust of the media is better thought of as a way to understand the centrality of their partisanship to their identity.\n\nThe new voting restrictions many states are considering\n\nPolice misconduct trials are rare. Instead, cities pay millions to settle claims"
        },
        {
          "link": "https://fivethirtyeight.com/features/americans-oppose-many-voting-restrictions-but-not-voter-id-laws/",
          "published": "2021-04-02T11:00:00",
          "title": "Americans Oppose Many Voting Restrictions — But Not Voter ID Laws",
          "text": "Welcome to Pollapalooza, our weekly polling roundup.\n\nLast week, Gov. Brian Kemp signed a sweeping package of voting restrictions into law in Georgia. The new regulations — including a ban on giving food and water to voters in line and an ID requirement for absentee voting — drew harsh condemnation from Democrats, voting-rights advocates and corporations for making voting more arduous, particularly for Black voters who will be disproportionately affected. And alarmingly, the laws appear to be inspired by a baseless belief in rampant voter fraud in the 2020 election and designed to make it easier for Republicans to win elections in the future.\n\nThe new voting restrictions many states are considering\n\nBut how many Americans buy into the Republican argument that more “election security” is needed, and how many believe that these laws are undemocratic? On the surface, at least, they are closely divided on the issue of voting access. According to a YouGov/The Economist poll from March 20-23, Americans narrowly oppose “laws that would make it more difficult to vote,” 44 percent to 39 percent. But of course, that’s an extremely broad categorization that covers everything from laws cleaning up the voter rolls to those outright banning no-excuse absentee voting and slashing polling places. Reality is more nuanced: Americans are fine with some voting restrictions but balk at others.\n\nrelated: The States Where Efforts To Restrict Voting Are Escalating Read more. »\n\nFor instance, public opinion is strongly against perhaps the most controversial provision of Georgia’s new law: the prohibition on giving food or water to people waiting in line to vote. In a different, March 29 poll, YouGov found that only 18 percent of Americans thought handing out food and water should be illegal, while 69 percent thought it should be allowed.\n\nLikewise, in the most recent YouGov/The Economist poll (conducted March 27-30), only 33 percent of Americans agreed with the part of Georgia’s new law that makes ballot drop boxes only accessible during early-voting hours. By contrast, 44 percent thought drop boxes should be open at all times. Drop boxes were also popular within Georgia itself. Back in January, a University of Georgia/Atlanta Journal-Constitution poll found that Georgia registered voters opposed banning them 59 percent to 37 percent. While the new law didn’t go that far, it did make them a lot less useful by mandating that they be located inside early-voting centers.\n\nOn the other hand, the public strongly supports one of the other major stipulations of Georgia’s new law: the ID requirement for absentee voting. That latest YouGov/The Economist poll found that Americans support requiring a photo ID in order to vote absentee, 53 percent to 28 percent. And Georgians are even more supportive: 74 percent of registered voters in the UGA/AJC poll backed requiring voters to include a copy of their photo ID or other documentation in order to vote by mail. Only 22 percent were opposed.\n\nIndeed, voter ID laws — which Republicans have pushed for years — are quite popular in general. In another national poll out this week from Selzer & Co./Grinnell College, 56 percent of adults favored keeping laws that require people to show a photo ID before voting, while just 36 percent wanted to eliminate them. And this isn’t an opinion Americans suddenly adopted amid 2020’s specious claims of voter fraud. In fall 2018, the Pew Research Center found that 76 percent of Americans favored requiring everyone to show a government-issued photo ID in order to vote, versus only 23 percent who opposed it.\n\nOne voting restriction that Georgia did not end up enacting was requiring voters to have an excuse in order to vote absentee. Politically, it seems to have been a wise choice to kill that: According to the UGA/AJC poll, Georgians opposed the proposal 55 percent to 43 percent. Nationally, YouGov/The Economist found a nation divided over whether anyone should be able to vote by mail (44 percent) or only people who are unable to vote in person (42 percent), but that poll is an outlier. Selzer/Grinnell found that Americans favor keeping laws that allow mail voting 56 percent to 34 percent, and Pew last year found that 65 percent of the country believed that voters should not need a documented reason to be allowed to vote early or absentee. That wasn’t just because of the pandemic, either: In Pew’s 2018 poll, that number was 71 percent.\n\n‘There’s a reason why … (GOP has) tried to make it harder for people to vote’: Silver\n\nThat said, Georgia’s new law does prevent election officials from actively encouraging absentee voting by prohibiting mailing absentee-ballot applications to voters who don’t request them — something the secretary of state did in last year’s primary in order to encourage mail voting amid the pandemic. According to the UGA/AJC poll, Georgia seems to be split right down the middle on this prohibition: 49 percent are against it and 47 percent are for it. But the public is more firmly against more aggressive promotions of absentee voting, at least on the national level. For example, respondents to the YouGov/The Economist poll opposed mailing absentee ballots to all registered voters (which nine states and Washington, D.C., did in 2020), 59 percent to 24 percent. And per Pew, back in 2018, Americans opposed conducting all elections by mail, 65 percent to 34 percent.\n\nGeorgia is hardly the only state where legislators are considering changing voting laws — either to make them stricter or, in many cases, more accessible. But the complicated public opinion on voting issues just goes to show that not all voting reforms are viewed the same way — and neither party should assume the public is fully on their side.\n\nOther polling bites\n\nWashington’s consternation over potentially abolishing the Senate filibuster doesn’t appear to be shared by the American people. According to a YouGov/Yahoo News poll, 36 percent of adults support ending the filibuster, while only 27 percent oppose it. A whopping 37 percent are unsure. That may be because only 34 percent of adults say they know “a lot” about how the filibuster works; 40 percent say they’ve heard of the filibuster but don’t know how it works, while 26 percent say they know “nothing” about the filibuster.\n\nFor the first time in more than 80 years of Gallup polling, fewer than half of Americans say they are a member of a church, synagogue or mosque: 47 percent, down from 70 percent as recently as 1999. The drop is driven by generational change: While 66 percent of those born before 1946 are still members of a house of worship, only 36 percent of millennials (born 1981-1996) are. That’s roughly the same as the share of millennials with no religious affiliation (31 percent).\n\nIt’s not news that Americans are frustrated with government, but it’s still sobering to see it quantified. According to the Pew Research Center, 53 percent of Americans are “not too” or “not at all” satisfied with the way democracy is working in the U.S. (only 45 percent of Americans are at least somewhat satisfied with it). In addition, 67 percent of Americans think the phrase “most politicians are corrupt” describes their country well. Both numbers are higher in the U.S. than in the three other countries Pew surveyed: the United Kingdom, France and Germany.\n\nThursday was the first day of the 2021 Major League Baseball season, which will look pretty different from past seasons thanks to the coronavirus pandemic. To the approval of 62 percent of MLB fans (per a recent Ipsos poll), every team except the Texas Rangers and Houston Astros will open stadiums to less than half capacity to start the season. But MLB will not mandate proof of vaccination or a negative COVID-19 test in order to attend a game, despite 67 percent of fans supporting such a requirement.\n\nThursday was also April Fool’s Day, a day that this year saw Bud Light “introduce” a pizza-flavored seltzer and the Chicago Bears “trade for” a star quarterback. Probably only about half of Americans appreciated these gags, though: According to YouGov, only 45 percent of adults think April Fool’s Day pranks are generally funny, while 47 percent are no fun and think they’re mostly just annoying.\n\nBiden approval\n\nAccording to FiveThirtyEight’s presidential approval tracker, 54.0 percent of Americans approve of the job Biden is doing as president, while 39.6 percent disapprove (a net approval rating of +14.4 points). At this time last week, 54.3 percent approved and 39.9 percent disapproved (a net approval rating of +14.4 points). One month ago, Biden had an approval rating of 53.9 percent and a disapproval rating of 37.1 percent, for a net approval rating of +16.8 points.\n\nElections to watch in 2021| FiveThirtyEight Politics Podcast\n\nWhat are pollster ratings? | Polling 101 from FiveThirtyEight"
        },
        {
          "link": "https://fivethirtyeight.com/videos/the-2021-elections-that-will-show-us-where-the-parties-are-headed/",
          "published": "2021-04-02T03:02:28",
          "title": "The 2021 Elections That Will Show Us Where The Parties Are Headed",
          "text": "In this installment of the FiveThirtyEight Politics podcast, the crew discusses the 2021 gubernatorial elections in Virginia and New Jersey and California’s likely gubernatorial recall election. They also look at mayoral elections, which are taking place in more than two dozen major cities, and special elections for a handful of vacant House seats."
        },
        {
          "link": "https://fivethirtyeight.com/features/politics-podcast-elections-to-watch-in-2021/",
          "published": "2021-04-01T22:32:59",
          "title": "Politics Podcast: Elections To Watch In 2021",
          "text": "Typically, high-profile election news is scarce the year after a presidential election. The midterms are more than a year away, and the presidential primaries won’t really get underway until after the midterms. Still, there are a number of contests to pay attention to in 2021.\n\nIn this installment of the FiveThirtyEight Politics podcast, the crew discusses the 2021 gubernatorial elections in Virginia and New Jersey and the very likely recall election in California. They also look at the mayoral races taking place in more than two dozen major cities as well as the special elections for a handful of vacant House seats.\n\nYou can listen to the episode by clicking the “play” button in the audio player above or by downloading it in iTunes, the ESPN App or your favorite podcast platform. If you are new to podcasts, learn how to listen.\n\nThe FiveThirtyEight Politics podcast is recorded Mondays and Thursdays. Help new listeners discover the show by leaving us a rating and review on iTunes. Have a comment, question or suggestion for “good polling vs. bad polling”? Get in touch by email, on Twitter or in the comments."
        },
        {
          "link": "https://fivethirtyeight.com/features/why-the-recent-violence-against-asian-americans-may-solidify-their-support-of-democrats/",
          "published": "2021-04-01T11:00:00",
          "title": "Why The Recent Violence Against Asian Americans May Solidify Their Support Of Democrats",
          "text": "Even before the coronavirus became a worldwide pandemic, some astute observers of racial and ethnic politics feared that the emerging outbreak in China would lead to (and were already contributing to) a rise in anti-Asian sentiment in America. After all, the United States has a long and ugly history of scapegoating racial and ethnic groups for diseases in ways that are used to justify xenophobia.\n\nSadly, it didn’t take long for those fears to be realized. Racist harassment online, verbal attacks in public and physical assaults against Asian Americans all surged in the early days of the pandemic and have remained alarmingly high ever since. In fact, anti-Asian hate crimes in the U.S. increased by nearly 150 percent from 2019 to 2020.\n\nHow the Atlanta attacks may activate Asian Americans politically\n\nBut it took the murder of six Atlanta women of Asian descent in March for many to finally realize the seriousness of the problem. According to Google Trends data, Google searches like “Asian Americans” and “violence against Asian Americans” skyrocketed after the shooting. Similarly, the share of respondents in last week’s YouGov/Economist poll who said there is “a great deal” of discrimination against Asian people (33 percent) doubled since YouGov asked this question in March 2020 after reports of COVID-19-related backlash against Asian Americans had initially surfaced.\n\nRelated: The U.S. Has A Long-Standing History Of Vilifying Minority Groups During Times Of Crisis Read more. »\n\nOf course, as the targets of this hatred, Asian Americans have been much more aware of the growing problem. In a June 2020 Pew Research Center poll, 58 percent of Asian Americans said it was more common for people to express racist or racially insensitive views about people who are Asian than it was before the coronavirus outbreak, compared to just 39 percent of all adults. And about half of those surveyed in AAPI Data’s 2020 Asian American Voter Survey also said they worried “very often” or “somewhat often” about experiencing hate crimes, harassment and discrimination because of COVID-19.\n\nThe effect of this hatred has partisan ramifications, too. Asian Americans’ escalating fears of discrimination and harassment during the pandemic will likely solidify their already strong support of Democrats.\n\nThat’s true for a couple of reasons. First, perceptions of discrimination and feelings of social exclusion are strongly linked with how Asian Americans vote. Take, for example, the relationship between Asian Americans who said they perceived discrimination and how they said they would vote in the 2020 presidential election.\n\nOver three-quarters of Asian American and Pacific Islanders voters who thought there was “a great deal” or “a lot” of anti-Asian discrimination in the U.S. supported Joe Biden over Donald Trump in weekly Democracy Fund + UCLA Nationscape surveys conducted from April to September 2020. But only 37 percent of Asian Americans who didn’t think there was any anti-Asian discrimination preferred Biden to Trump in the presidential election.\n\nPolitical scientists Alexander Kuo, Neil Malhotra and Cecilia Mo have argued that Asian Americans who experience discrimination are more likely to support Democrats because they associate social exclusion based on their ethnic background with the predominantly white Republican Party. Take, for example, what Kuo, Malhotra and Mo found in one experiment. Some participants were randomly subjected to a microaggression from a white lab assistant who questioned their citizenship before having them answer a survey that measured political attitudes. The Asian Americans subjected to the microaggression were 13 percentage points more likely than the control group to view the Democratic Party in a positive light.\n\nThis uptick came at the expense, too, of how respondents thought about the Republican Party. That is, the Asian Americans who were subjected to the microaggression were more likely to say that Republicans were close-minded and associate the party with exclusionary treatment. That is something that has been made much more explicit during the pandemic.\n\nrelated: Women Of Color Were Shut Out Of Congress For Decades. Now They’re Transforming It. Read more. »\n\nDemocratic politicians, for instance, have consistently shown far greater concern than their Republican counterparts over the rise in hate directed against Asian Americans during the pandemic— differences that were clearly on display in the 2020 presidential campaign. Then-candidate Joe Biden forcefully condemned President Trump’s repeated use of terms like “Chinese virus” and “kung flu” to describe the coronavirus, warning that such language could endanger Asian Americans.\n\nThere’s evidence to support those concerns, too. Two recent studies found that online animosity and offline hate incidents against Asian Americans heightened after Trump linked China and COVID-19 in his tweets; another study found that Trump’s framing of the pandemic as China’s fault increased anti-Asian sentiments and xenophobia in survey experiments; and there’s evidence, too, that rank-and-file Republicans have become much more hostile toward China during the pandemic — views that experts warn pose a threat to all Asian Americans.\n\nIn total, the prejudice Asian Americans have experienced during the pandemic does seem to have further solidified their already strong support of the Democratic Party. Analyzing data from weekly Nationscape surveys conducted between July 2019 and May 2020, political scientists Nathan Chan, Jae Yeon Kim and Vivien Leung show that Asian Americans moved more toward the Democratic Party than other racial and ethnic groups after Trump first made ethnically inflammatory remarks about the coronavirus. Chan and his colleagues concluded from their findings that exclusionary rhetoric from partisan elites “further cement[s] Asian Americans as Democrats.”\n\nThis certainly doesn’t mean that social exclusion and experiences with discrimination are the only reasons why Asian Americans have overwhelmingly supported Democrats. Nor is it possible to precisely predict how the rise in anti-Asian hate during the pandemic will affect Asian American partisanship in the long run. But, at the very least, Republican rhetoric about the pandemic and the rise in anti-Asian hate over the past year seems to have solidified the longstanding link between Asian Americans’ feelings of social exclusion and their support for the Democratic Party.\n\nPolice misconduct trials are rare. Instead, cities pay millions to settle claims\n\nThe new voting restrictions many states are considering"
        }
      ]
    },
    "wayne": {
      "rss": "http://www.waynedupree.com/feed/",
      "link": "http://www.waynedupree.com/",
      "articles": [
        {
          "link": "https://www.waynedupree.com/2021/04/family-mask-spirit-airlines/",
          "published": "2021-04-05T19:13:01",
          "title": "[VIDEO] If These Parents Had Maskless John Kerry On Their Lap They Could've Stayed On The Plane - WayneDupree.com",
          "text": "There’s a lot of unknowns when it comes to COVID.\n\nTIRED OF THE ADS? BECOME A PREMIUM USER TODAY!!\n\nBut one thing we do know is that the elites don’t have it nearly as bad as us peasants do.\n\nMORE NEWS: [VIDEO] Trump Supporter Just “Fixed” Jill and Joe’s “Easter Message” – You’ll Love It Now\n\nElites like Joe Biden tell you not to be with family on Easter, right as he’s heading out the door to go be with his.\n\nGavin Newsom closes down restaurants and kills people’s livelihoods, but then parties his swanky butt off at fancy French restaurants.\n\nAnd who can forget John Kerry – the “Ketchup King,” lounging in first class on a domestic flight, completely mask-free…nobody said a word to him.\n\nWhat is John Kerry’s excuse going to be for not wearing a mask today on American Airlines? Drinking orange juice? Sorry! No orange juice in the photo. Eating a sandwich? Sorry! No sandwich in the photo. pic.twitter.com/b95MjJWB1O — LivePDDave 🇺🇸 🚨 🥊 (@LivePDDave1) March 18, 2021\n\nWill you join President Trump's new social platform when it comes out? Yes No Email Address (required) By completing the poll, you agree to receive emails from WayneDupree.com and that you've read and agree to our privacy policy and legal statement Results Vote\n\nClose More from Wayne Dupree\n\nLiberal Elitist John Kerry lives by an entirely different set of rules than you and I do.\n\nHe doesn’t have to follow the tyrannical lockdown rules.\n\nHe can do whatever he pleases.\n\n>>>FOLLOW US ON GAB<<<\n\nHowever, this middle-class family, traveling with their two-year-old toddler on a Spirit Airlines flight, didn’t have experience the same blessed liberal luxury as the exalted Ketchup King did.\n\nNot even close…\n\nBecause when their little baby wanted to eat, and the flight attendant caught wind of the maskless toddler, she threw them off the plane.\n\nYou can watch the video below:\n\nNEW – Family is being thrown off a @SpiritAirlines flight from Orlando to NY because their two-year-old child is eating without a mask.pic.twitter.com/dOIZrbbJt6 — Disclose.tv 🚨 (@disclosetv) April 5, 2021\n\nGee, maybe if these parents had John Kerry sitting on their laps, they could’ve stayed on the plane?\n\n***FOLLOW US ON TELEGRAM***\n\nIsn’t COVID smart? It actually knows to leave the elites alone, and only infect and wreak havoc on us lowly peasants.\n\nAmazing “scientific” stuff.\n\nAttn: Wayne Dupree is a free speech champion who works tirelessly to bring you news that the mainstream media ignores. But he needs your support in order to keep delivering quality, independent journalism. You can make a huge impact in the war against fake news by pledging as little as $5 per month. Please click here Patreon.com/WDShow to help Wayne battle the fake news media."
        },
        {
          "link": "https://www.waynedupree.com/2021/04/tilsi-fox-news-republican/",
          "published": "2021-04-05T16:51:10",
          "title": "Dear Tulsi, After Pulling Off an Interview Like This, You Just Need to Become a Republican - WayneDupree.com",
          "text": "The more Democrat Tulsi Gabbard speaks, the more I think she just needs to pull the trigger and become a Republican.\n\nTIRED OF THE ADS? BECOME A PREMIUM USER TODAY!!\n\nTulsi no longer represents the Dem Parrty values.\n\nMORE NEWS: Justice Clarence Thomas Just Signaled That He’s Ready to Nuke Social Media\n\nThey’ve swung so far left, that they’re literal communists at this point.\n\nOf course, Tulsi would have to tweak a couple of things, like her stance on abortion, but I think she’s reasonable enough that we could convince her of the horrors.\n\nBut in all seriousness, Tulsi is out there on the front lines right now battling these “woke” loons on her side of the “aisle” and the communist cancel culture that liberals are enforcing.\n\nWill you join President Trump's new social platform when it comes out? Yes No Email Address (required) By completing the poll, you agree to receive emails from WayneDupree.com and that you've read and agree to our privacy policy and legal statement Results Vote\n\nClose More from Wayne Dupree\n\nAnd she’s doing a much better job of it than most actual Republicans, and with a heck of a lot more passion too.\n\nThis short, but powerful clip from Steve Hilton is a perfect example.\n\nYou can watch the video below:\n\n>>>FOLLOW US ON GAB<<<\n\n.@TulsiGabbard: 'Cancel culture' stems from those who can't win in the free marketplace of ideas and need to resort to force and silencing You need to become a Republican pic.twitter.com/VdPQRmU9kB — CONNIE’S CORNER (@CRRJA5) April 5, 2021\n\nIt’s a sad, sad day in the GOP when a registered Democrat is making more of an effort to fight the left than they are.\n\nWe have some good R’s on our side, but even so, most don’t know how to fight the left.\n\n***FOLLOW US ON TELEGRAM***\n\nYou need to keep at them, hammer a message for eons before you can even start to make headway.\n\nBut GOP is easily distracted. They come out like gangbusters on an issue and then 5 minutes later, they’re distracted and on to something else, and that’s how Dems keep gaining ground.\n\nWe need consistent/constant messaging like this – on one topic – until they see results.\n\nThat’s the only way we’ll win.\n\nAttn: Wayne Dupree is a free speech champion who works tirelessly to bring you news that the mainstream media ignores. But he needs your support in order to keep delivering quality, independent journalism. You can make a huge impact in the war against fake news by pledging as little as $5 per month. Please click here Patreon.com/WDShow to help Wayne battle the fake news media."
        },
        {
          "link": "https://www.waynedupree.com/2021/04/scotus-save-nominee-process/",
          "published": "2021-04-05T16:25:54",
          "title": "Trump Supporter Just Figured Out How to Save SCOTUS...We Shoulda Thought of This Years Ago... - WayneDupree.com",
          "text": "I saw something online today and it just *clicked* with me, so I had to share it with you.\n\nTIRED OF THE ADS? BECOME A PREMIUM USER TODAY!!\n\nSo often, you hear conservatives say that the ONLY justice we can trust on the SCOTUS is Clarence Thomas.\n\nMORE NEWS: Justice Clarance Thomas Just Signaled That He’s Ready to Nuke Social Media\n\nAnd anyone who says that is 100 percent correct.\n\nWe need more “Clarence Thomas” justices – and less John Roberts – and sad to say, less Kavanaugh and ACB’s as well.\n\n>>>FOLLOW US ON GAB<<<\n\nThey don’t have that tried and true old-school conservative warrior spirit that Thomas has. They’re the new breed of “conservative,” who is weak and kowtows to the mob.\n\nDo you believe Justice Roberts is compromised? Yes, the Dems have got something on him No, I think he's just a cruddy globalist Email Address (required) By completing the poll, you agree to receive emails from WayneDupree.com and that you've read and agree to our privacy policy and legal statement Results Vote\n\nClose More from Wayne Dupree\n\nSo, how do we keep ending up with these weak justices?\n\nIt’s the nomination process we currently have that is to blame.\n\nIt’s not his fault, but President Trump relied on the Federalist Society for his SCOTUS nominations.\n\nThis is just how it goes…\n\nWhat is the Federalist Society?\n\nI will tell you:\n\nThe Federalist Society is a very powerful, nationwide organization of conservative lawyers who are instrumental in helping Republican presidents pick their next Supreme Court nominee.\n\nAnd these types of “conservatives” clearly don’t represent the changes that have occurred in the Republican Party.\n\nMORE NEWS: These 3 Sentences Best Explain The Real Reason Why GOP Keeps Losing to Dems\n\nIt’d be like asking Mitch McConnell to hand-pick all of our senators and Paul Ryan to pick our House reps. Would you do that?\n\nNo, of course not.\n\nTimes have changed, and we need to move on from stuffy, dusty failed ideas from the past.\n\nAnd that’s why this tweet really spoke to me.\n\nIt’s brilliant.\n\nHere’s what it says: “Get rid of the Federalist Society and just have Clarence Thomas pick every future Supreme Court Justice.”\n\nGet rid of the Federalist Society and just have Clarence Thomas pick every future Supreme Court Justice. — The Columbia Bugle 🇺🇸 (@ColumbiaBugle) April 5, 2021\n\nThe answer to our problems was sitting in front of our faces the entire time.\n\nIf we want more “Clarence Thomas” justices, we need to have people who think and believe like Justice Thomas help choose them.\n\n***FOLLOW US ON TELEGRAM***\n\nAfter all, we KNOW that Justice Thomas is 100 percent in line with our thinking, so we must turn to him, and those who emulate and support him, for guidance.\n\nImagine what SCOTUS would look like if we had done that from the get-go? An entire court filled with Clarence? My God, we’d seriously never stop winning.\n\nThat’s why we must stop relying on failed old policies and disingenuous people that let us down and start embracing those people who fight for us, and who we know will lead us to victory.\n\nBecause if we do that, decades from now this country could have a SCOTUS that is literally filled with “Clarence Thomas’s” — and all would be right with the world.\n\nAttn: Wayne Dupree is a free speech champion who works tirelessly to bring you news that the mainstream media ignores. But he needs your support in order to keep delivering quality, independent journalism. You can make a huge impact in the war against fake news by pledging as little as $5 per month. Please click here Patreon.com/WDShow to help Wayne battle the fake news media."
        },
        {
          "link": "https://www.waynedupree.com/2021/04/clarence-thomas-social-media-case/",
          "published": "2021-04-05T15:54:11",
          "title": "Justice Clarence Thomas Just Signaled That He’s Ready to Nuke Social Media - WayneDupree.com",
          "text": "Clarence Thomas is now signaling that he’s ready to nuke social media.\n\nTIRED OF THE ADS? BECOME A PREMIUM USER TODAY!!\n\nTwitter, to be exact.\n\nThomas is going after Section 230.\n\nHe’s now suggesting that social meida companies may not have a “First Amendment” right to regulate online speech.\n\nMORE NEWS: [VIDEO] Trump Supporter Just “Fixed” Jill and Joe’s “Easter Message” – You’ll Love It Now\n\nThomas is calling them “common carriers” and “places of public accommodation” in a stunning rebuke of the massive overreach that Twitter, Facebook, and other tech tyrants have used to impose their political ideologies on Americans.\n\nDo you believe Justice Roberts is compromised? Yes, the Dems have got something on him No, I think he's just a cruddy globalist Email Address (required) By completing the poll, you agree to receive emails from WayneDupree.com and that you've read and agree to our privacy policy and legal statement Results Vote\n\nClose More from Wayne Dupree\n\n>>>FOLLOW US ON GAB<<<\n\nChief Justice Thomas signals that he’s ready to nuke Twitter. Hell yeah https://t.co/9dlaKzgQ2M — Comfortably Smug (@ComfortablySmug) April 5, 2021\n\nBREAKING: Supreme Court Justice Clarence Thomas finds social media companies do not have First Amendment right to ban protected speech and that Section 230 is unconstitutional — Jack Posobiec (@JackPosobiec) April 5, 2021\n\nHere are more details on Thomas’s line of thinking from uber-liberal “journo” Mark Joseph Stern who writes for Slate. He’s nervous:\n\nIn other words, Clarence Thomas is inviting Congress to ban social media companies from engaging in content moderation by stripping them of their own First Amendment rights and transforming them, for legal purposes, into common carriers or public accommodations. You know the conservatives who have been arguing—unsuccessfully so far—that social media companies are so powerful that Congress can essentially override their own First Amendment rights and force them to host certain speech on their platforms? Thomas just endorsed that argument. !!! Thomas cites arguments that Section 230, which provides immunity to platforms for third-party content, *violates the First Amendment.* Legal scholars often talk about how fringe constitutional arguments go from “off the wall” to “on the wall.” Clarence Thomas just took a huge step toward moving arguments against social media companies’ right to engage in content modification “on the wall”—into the mainstream. I am confident that Clarence Thomas’ rallying cry for legislation overriding social media companies’ First Amendment rights and forcing them to host speech is *entirely* about right-wing fears that Twitter, Facebook, etc. are censoring conservative speech In other news, Gorsuch, joined by Alito, wants to expand employers’ obligation to grant religious accommodations to workers under Title VII. Kavanaugh and Thomas have suggested they support this move, as well. Back to Thomas: His position appears to be that corporations have a First Amendment right to spend an unlimited amount of money influencing elections—free of disclosure requirements—but no First Amendment right to disassociate with speech they do not like. Extraordinary.\n\nYou can practically see the fear dripping off these tweets from this liberal reporter.\n\nThomas is the only hope we have to help right these wrongs…and liberals know it. Check this out:\n\n***FOLLOW US ON TELEGRAM***\n\n“Just exactly what Trump and his wife want. We can’t afford to keep Thomas on the court.”\n\nThat’s a comment from a far-left loon, who supports the suppression of free speech.\n\nThey know that if Thomas takes this up – this could be the end for them.\n\nAttn: Wayne Dupree is a free speech champion who works tirelessly to bring you news that the mainstream media ignores. But he needs your support in order to keep delivering quality, independent journalism. You can make a huge impact in the war against fake news by pledging as little as $5 per month. Please click here Patreon.com/WDShow to help Wayne battle the fake news media."
        },
        {
          "link": "https://www.waynedupree.com/2021/04/jilljoe-easter-message-fixed/",
          "published": "2021-04-05T15:21:18",
          "title": "[VIDEO] Trump Supporter Just \"Fixed\" Jill and Joe's \"Easter Message\" - You'll Love It Now - WayneDupree.com",
          "text": "Jill and Joe delivered one of the most “godless” Easter messages you’ll ever see.\n\nTIRED OF THE ADS? BECOME A PREMIUM USER TODAY!!\n\nThe message to America did not even mention Jesus Christ – the entire reason for the holiday.\n\nMORE NEWS: [VIDEO] This Couple Spotted on a Train Must Be CNN’s #1 Viewers…There’s No Other Explanation\n\nIt was a secular message that focused on getting vaccinated – not on one of the most important and holy Christian holidays in the world.\n\nThat’s right, the so-called “devout Catholic” Joe Biden, talked about Easter without once mentioning Jesus Christ.\n\nIn case you didn’t realize it, Joe Biden’s “presidency” is as real as his “Catholic faith.”\n\nWill you join President Trump's new social platform when it comes out? Yes No Email Address (required) By completing the poll, you agree to receive emails from WayneDupree.com and that you've read and agree to our privacy policy and legal statement Results Vote\n\nClose More from Wayne Dupree\n\nAnd now, one very talented Trump supporter has “fixed” the video, and I have a sneaking feeling that you’ll like it a lot more now.\n\n>>>FOLLOW US ON GAB<<<\n\nYou can watch the video below:\n\nIt’s really hard to take these two goofs seriously, and their message was so insincere, and lacking any sense of what the spirit of Easter is about…\n\n***FOLLOW US ON TELEGRAM***\n\nSo, it’s nice to see that their “clown show” has been more properly represented.\n\nAttn: Wayne Dupree is a free speech champion who works tirelessly to bring you news that the mainstream media ignores. But he needs your support in order to keep delivering quality, independent journalism. You can make a huge impact in the war against fake news by pledging as little as $5 per month. Please click here Patreon.com/WDShow to help Wayne battle the fake news media."
        }
      ]
    },
    "tnr": {
      "rss": "http://www.nationalreview.com/corner/feed/",
      "link": "http://www.nationalreview.com/",
      "articles": [
        {
          "link": "https://www.nationalreview.com/corner/democratic-mayor-of-palm-beach-county-yeah-the-60-minutes-segment-is-a-lie/",
          "published": "2021-04-05T19:38:34",
          "title": "Ron DeSantis & 60 Minutes -- Democratic Mayor of Palm Beach County: Segment Is a Lie",
          "text": "Florida Governor Ron DeSantis speaks during a news conference at the Miami Beach Convention Center, Miami Beach, Fla., April 8, 2020. (Al Diaz/Reuters)\n\nHow false is the 60 Minutes story on Ron DeSantis and Publix? False enough that the Democratic mayor of Palm Beach County, Dave Kerner, has released a statement noting that it is not just based on “bad information” but is “intentionally false.” Mayor Kerner says that he offered to talk to 60 Minutes himself, but that CBS declined. He says Palm Beach County asked for the Publix relationship, and that CBS knew that but “left it out because it kneecaps their narrative.” He says that the media is “hellbent on dividing us.”\n\nAdvertisement\n\nKerner is the second Florida Democrat in as many days to push back publicly against CBS’s segment. Read his whole statement here."
        },
        {
          "link": "https://www.nationalreview.com/corner/the-return-of-earmarks/",
          "published": "2021-04-05T19:18:44",
          "title": "Earmarks & Congress -- Ponnuru's Bloomberg Opinon Column",
          "text": "My new Bloomberg Opinion column.\n\nAfter a 10-year hiatus, earmarks are coming back to the U.S. Congress. Democrats and Republicans alike repudiated the practice of letting congressmen direct federal spending to specific projects and enterprises around the start of President Barack Obama’s administration. Now both parties have decided to revive it, with reforms.\n\nThe decision should inspire mixed feelings. Earmarking isn’t the most noble activity a congressman can undertake, and it can even be corrupt. But the ban hasn’t lived up to the hopes that were invested in it. . . ."
        },
        {
          "link": "https://www.nationalreview.com/corner/boards-of-trustees-fiddle-while-their-schools-burn/",
          "published": "2021-04-05T18:43:06",
          "title": "Boards of Trustees Fiddle While Their Schools Burn",
          "text": "Control over state colleges and universities is in the hands of their boards of trustees. Their duties are not to get involved in the minutiae of operations, but to keep disastrous decisions by administrators at bay.\n\nIt’s not working. Boards seldom lift a finger in opposition to administration policies, especially if doing so would mean an unpleasant battle against politically zealous administrators, faculty, students, and the media. Most trustees just don’t want to bother.\n\nIn today’s Martin Center article, Jay Schalin looks at the way boards in the UNC system have reacted to the invasion of DEI (diversity, equity, inclusion) programs and policies in UNC institutions.\n\nHe writes, “Implementing the DEI agenda enfranchises a collectivist, racialized political theory that goes against almost everything our nation has long stood for. Consider a letter sent by the dean of the North Carolina State School of Veterinary Medicine to his school’s faculty, which states:\n\nWe must commit to our Values and to being a Values-Driven culture. We must support the cause of Black Lives Matter with more than just words, this is the time to commit to anti-racism and to demonstrate that commitment through action.”\n\nDEI ideology has been sweeping through UNC institutions (and much of the rest of higher education in America) for the last year. Have the boards done anything to stop or even slow it?\n\nNo, but why not?\n\nSchalin: “That reluctance to look out for the interests of the majority of North Carolinians raises some very basic questions. Why are the boards not up in arms when a disturbing political litmus test is imposed on the institutions they are sworn to defend? What human incentives are behind their inactivity: confusion, ignorance, cowardice, or corruption?”\n\nIt’s probably some of each. Whatever the reason, the UNC system is embracing a divisive and destructive ideology that can only damage the education that students and taxpayers are paying for."
        },
        {
          "link": "https://www.nationalreview.com/corner/joe-manchin-rejects-bidens-call-for-a-28-percent-corporate-tax-rate-but-still-wants-higher-taxes/",
          "published": "2021-04-05T18:26:44",
          "title": "Joe Manchin Rejects Biden’s Call for a 28 Percent Corporate Tax Rate, But Still Wants Higher Taxes",
          "text": "Senator Joe Manchin has rejected President Biden’s proposal to hike the corporate tax rate to 28 percent, which is a key way that the administration wants to raise money to partially offset the new infrastructure bill.\n\nBut it’s worth noting that Manchin has recently indicated he was broadly supportive of a large infrastructure package and would be open to raising the corporate income tax from 21 percent to “at least 25 percent.” And Manchin has even floated a value-added tax, which would incidentally be regressive, as consumption-based taxes tend to hurt lower-income individuals who spend a higher percentage of what they earn.\n\nAdvertisement\n\nSo it isn’t clear that Manchin has any hard principle at stake on taxes that would be a dealbreaker for Biden’s spending proposals. I mean, why be open to “at least 25 percent” but find 28 percent over the top? It seems as if he just wants to be seen as somehow less liberal than the median Democrat, even while voting with Democrats on most major issues when push comes to shove."
        },
        {
          "link": "https://www.nationalreview.com/corner/wait-when-did-corporate-ceos-become-the-new-heroes-in-american-politics/",
          "published": "2021-04-05T17:25:33",
          "title": "When Did Corporate CEOs Become the New Heroes in American Politics?",
          "text": "“American CEOs, forced into politics by cultural trends and staff demands in recent years, are hitting a new phase — actual lawmakers and rule-shapers,” Axios CEO Jim VandeHei wrote Saturday. Earlier this year at Axios, Felix Salmon wrote about “How CEOs became the 4th branch of government,” declaring, “CEOs must be considered a permanent political force, wielding awesome power. This week’s actions won’t be the last.”\n\nThere are a couple of problems with this generous analysis. First, the door seems to only swing one way.\n\nWhen was the last time you saw American CEOs organize a public-pressure campaign to punish a state for …"
        }
      ]
    },
    "trs": {
      "rss": "http://therightscoop.com/feed/",
      "link": "http://therightscoop.com/",
      "articles": [
        {
          "link": "https://therightscoop.com/spirit-airlines-crewmember-removed-after-trying-to-force-a-family-off-plane-because-2-yr-old-daughter-wouldnt-wear-mask/",
          "published": "2021-04-05T19:12:10",
          "title": "Spirit Airlines crewmember REMOVED after trying to force a family off plane because 2-yr-old daughter wouldn’t wear mask",
          "text": "\n\n\n\n\n\n\n\nA Spirit Airlines crewmember tried to force a Jewish family of three off the airplane in Orlando before takeoff because their just-turned 2-year-old daughter would’t wear a mask. She claimed the pilot wanted them off the plane:\n\nVIDEO: @SpiritAirlines staffer tells pregnant Mom that her young child needs to put on a mask despite eating or else police will be called. NOTE that the video shows the early moments of this incident, so @SpiritAirlines can’t pull here a he/she said. pic.twitter.com/DpJkXfvWJH — Yossi Gestetner (@YossiGestetner) April 5, 2021\n\nIt’s worth noting the mom was also 7 months pregnant with a special needs child.\n\nAfter the family wouldn’t leave, the crewmember said she would go get the police and have them removed.\n\n\n\n\n\n\n\nInstead, the entire complement of passengers were deplaned:\n\nORLANDO: HORRIFIC – Family with special needs child is kicked off @SpiritAirlines flight to NJ – along with entire plane – after their 2-year-old didn’t wear a mask. Police were called. pic.twitter.com/qTwQrrh2au — KolHaolam (@KolHaolam) April 5, 2021\n\n\n\nUnlike other incidents, this one does have a happy ending. The crewmember was removed and everyone let back on board, including the family:\n\nORLANDO: UPDATE: @SpiritAirlines flight attendant who ordered the family off the flight was removed, family allowed back on. Passengers are reboarding with a new flight crew. pic.twitter.com/MWSzUdi3eB — KolHaolam (@KolHaolam) April 5, 2021\n\nUnlike @FlyFrontier who kept dishing out insults and alleged lies against the victims of their abuse a few weeks back, @SpiritAirlines let everyone back onto the plane. (Possibly everyone except for the abusive – and potentially bigoted – crew member.) pic.twitter.com/7h4qA73ExD — Yossi Gestetner (@YossiGestetner) April 5, 2021\n\nJews face a lot of persecution just for being Jews. We don’t know the motivation of this crewmember, but it seems more than ironic that she was removed and the family was let back on the plane. Whatever the case, I’m glad Spirit Airlines did the right thing here."
        },
        {
          "link": "https://therightscoop.com/publix-slams-60-minutes-report-as-absolutely-false-and-offensive/",
          "published": "2021-04-05T18:35:38",
          "title": "Publix slams 60 Minutes report as “absolutely false and offensive”",
          "text": "Publix spoke out today after the hit job on Governor DeSantis last night from 60 Minutes, essentially calling the report from 60 Minutes “absolutely false and offensive”:\n\nHere’s the full statement:\n\nThe irresponsible suggestion that there was a connection between campaign contributions made to Governor DeSantis and our willingness to join other pharmacies in support of the state’s vaccine distribution efforts is absolutely false and offensive.\n\nWe are proud of our pharmacy associates for administering more than 1.5 million doses of vaccine to date and for joining other retailers…to do our part to help our communities emerge from the pandmeic."
        },
        {
          "link": "https://therightscoop.com/supreme-court-vindicates-trump-in-case-over-him-blocking-his-critics-on-twitter/",
          "published": "2021-04-05T15:35:46",
          "title": "Supreme Court vindicates Trump in case over him blocking his critics on Twitter",
          "text": "\n\n\n\n\n\n\n\nThe Supreme Court has just vindicated President Trump in the ridiculous case from Democrats over him blocking critics on Twitter:\n\nCNBC – The Supreme Court on Monday erased a federal appeals court decision holding that former President Donald Trump violated the Constitution by blocking his critics on Twitter. The justices vacated the decision from the 2nd U.S. Circuit Court of Appeals and sent it back to the lower court with instructions to dismiss the case as “moot,” or no longer active, now that Trump is a private citizen. The action means the lower court’s decision will no longer bind future judges. A three-judge panel of the 2nd Circuit held unanimously in 2019 that Trump was acting in his official capacity when he used Twitter’s block feature. By doing so, the court said, Trump was effectively excluding individuals from a public forum, in violation of the First Amendment. The announcement came in an order list and without a written explanation of the court’s reasoning. There were no noted dissents.\n\n\n\n\n\n\n\nWhile there were no dissents, there was a concurring opinion from Clarence Thomas:\n\nJustice Clarence Thomas wrote in a concurrence that he agreed with the decision to vacate the 2nd Circuit opinion given that Trump no longer held office. Thomas said that the petition highlighted the “principal legal difficulty that surrounds digital platforms— namely, that applying old doctrines to new digital platforms is rarely straightforward.” “Respondents have a point, for example, that some aspects of Mr. Trump’s account resemble a constitutionally protected public forum,” Thomas wrote. “But it seems rather odd to say that something is a government forum when a private company has unrestricted authority to do away with it.”\n\nAccording to some on Twitter, Thomas also suggested that social media companies are too powerful and can be regulated by Congress without violating the Constitution. This potentially spells bad news for Twitter and Facebook. You can read his full opinion here, starting on page 9. It goes for about 10 pages."
        },
        {
          "link": "https://therightscoop.com/former-state-democrat-who-runs-florida-emergency-mngmt-defends-desantis-says-cbs-60-minutes-piece-absolute-malarkey/",
          "published": "2021-04-05T15:07:14",
          "title": "Former state DEMOCRAT who runs Florida Emergency Mngmt defends DeSantis, says CBS 60 Minutes piece “absolute malarkey”",
          "text": "\n\n\n\n\n\n\n\nThis weekend we exposed how CBS 60 Minutes doctored an exchange between Florida Governor Ron DeSantis and their reporter in order to scandalize the store Publix, a former donor to DeSantis, getting a big vaccine contract.\n\nIn that exchange, which we originally posted in full here, DeSantis explained that after querying big retail pharmacies like Publix and Walmart, that Publix was the only store ready to run with the vaccines. They then did a trial run in three counties before rolling it out to a mega county like Palm Beach County, he met with officials in the county and they chose to go with Publix because the store is everywhere and most seniors live very close to the stores.\n\nNot scandalous whatsoever. But CBS 60 Minutes still tried to scandalize it last night with their hit piece:\n\nCampaign finance reports obtained by 60 Minutes show that weeks before Florida Governor Ron DeSantis announced a partnership with Publix grocery stores to distribute the vaccine in its pharmacies, Publix donated $100,000 to his PAC. https://t.co/bS3ZBeET1W pic.twitter.com/BSUlpVbXSP — 60 Minutes (@60Minutes) April 4, 2021\n\nAfter seeing the hit job last night Jared Moskowitz, a former 3-term Democratic state legislature who runs Florida’s Division of Emergency Management, came to Desantis’ defense saying that the Publix recommendation didn’t come from the governor’s office, but came from Florida’s Health Department and his Division of Emergency Management:\n\n@60Minutes I said this before and I’ll say it again. @Publix was recommended by @FLSERT and @HealthyFla as the other pharmacies were not ready to start. Period! Full Stop! No one from the Governors office suggested Publix. It’s just absolute malarkey. https://t.co/obkqYcbrzt — Jared MASKowitz 😷 (@JaredEMoskowitz) April 4, 2021\n\n\n\n\n\n\n\nAs you can see, this isn’t the first time Moskowitz made this statement. He also explained this in early March when the Miami Herald started pushing this nonsense, and his explanation sounds exactly like the explanation DeSantis gave a couple of weeks ago when CBS was hounding him over this fake story.\n\nWhy didn’t CBS interview Moskowitz for their show? Why didn’t they talk to him about it beforehand? He’d clearly made his opinion on this known. Because it would have completely derailed their hit job on DeSantis. They want to hurt him because he’s a rising star on the right with presidential aspirations:\n\nIf DeSantis were not perceived as a legit 2024 GOP contender for President, 60 Minutes would not be selectively editing footage to make him look bad. — Erick Erickson (@EWErickson) April 5, 2021\n\nBen Shapiro agreed:\n\nLies the media have promulgated about DeSantis because they fear his 2024 candidacy:\n\n1. His willingness to allow local officials to open beaches, etc., would lead to massive death (lie);\n\n2. He artificially deflated death statistics (lie); — Ben Shapiro (@benshapiro) April 5, 2021\n\n3. He boosted vaccines for rich allies (lie, he tranched them to the elderly);\n\n4. He allowed the largest grocery chain in Florida to distribute vaccines because he was bribed (lie). — Ben Shapiro (@benshapiro) April 5, 2021\n\nThe media are damned liars. They are not bad at their jobs. They're very good at their jobs. It's just that their job is not journalism. It's Democratic Party propaganda. — Ben Shapiro (@benshapiro) April 5, 2021\n\nThings normal people think because the media are damned liars:\n\n1. GA's voter law restricts voter access and is a new form of Jim Crow;\n\n2. DeSantis is both corrupt and dangerous;\n\n3. Hunter Biden is a soulful innocent gone wrong, and the laptop story was Russian disinformation. — Ben Shapiro (@benshapiro) April 5, 2021"
        },
        {
          "link": "https://therightscoop.com/must-watch-chris-christie-and-sarah-isgur-utterly-end-biden-dems-media-over-georgia-voting-law-with-facts-receipts/",
          "published": "2021-04-05T00:59:43",
          "title": "MUST WATCH: Chris Christie (and Sarah Isgur) UTTERLY END Biden, dems, media over Georgia voting law",
          "text": "This is completely amazing. It’s the best, total, utter, devastating takedown I’ve seen on the news in forever. It’s the must-watch clip of the year so far. Totally, totally fantastic.\n\nAnd I don’t want to hear even a whisper of whining from anyone about how Christie was mean to Trump or too nice to Biden or whatever your grievance is. This is way too important and way too good. You’ll watch it and you’ll like it. End of discussion.\n\nBecause Christie SMASHES the lies and myths about the law. The liberal panelists KNOW it. They become FRANTIC about it.\n\nHere’s an example: “Drop boxes now become a permanent part of the Georgia landscape, they were not prior to Covid. They are now,” he said. One of the libs pathetically tried to respond to that by saying there are not ENOUGH drop boxes.\n\nNot enough? They didn’t even get rid of them? In fact they ENABLED them PERMANENTLY?? That’s a preeetttttyyy long from “suppression” don’t y’all think?.\n\n“Minimum of 17 days of early voting, including two Saturdays and two optional Sundays,” he points out. So much for that “suppressing the black voter” myth about shutting down weekends.\n\n“You’re going to have all voters being able to have multiple ways to prove who they are, driver’s license, last four numbers of your Social Security number, even a utility bill or a free ID provided by the state of Georgia” he points out. So much for “African-American voters won’t know how to use numbers on their drivers license” bigotry from the left.\n\n“Stacey Abrams, by the way, Stacey Abrams was in New Jersey, in my state, praising Phil Murphy this week for a voting law where New Jersey early voting is nine days. Half, half of what Georgia is. Yet she’s on TV in New Jersey — I saw it myself — saying that this is one of the greatest voting expansion bills we’ve ever seen, but this is Jim Crow? I’m sorry, George.”\n\nThat is just a KABOOM.\n\nWhen Yvette Simpson says the stupid water thing it really gets crazy.\n\n“A hundred and fifty feet, where, in New Jersey, in Chicago and any place else in the country, you’re not — he’s saying partisan groups cannot do electioneering by giving out food and water. And in the Georgia bill says that there can be water provided by the state of Georgia, just not by partisan groups,” Christie explains to the libs.\n\nSarah Isgur says it may be a dumb provision but “it’s not a threat to democracy.”\n\nSimpson, giving the game away, says “Every time you try to restrict voting rights it’s a threat to democracy.”\n\nSee how they are trying to work it? Devious and evil. Isgur responds “But that’s not restricting voting rights.”\n\nRight. And yet the libs continue to say that it is, facts be damned.\n\nThe part where Christie just KEEPS calling Joe Biden a LIAR is also pretty great.\n\nHere’s the full transcript.\n\nCHRIS CHRISTIE, ABC NEWS CONTRIBUTOR: Listen, it’s just a symptom, George. It’s a symptom of what’s going on in our country right now.\n\nI mean, let’s talk about what the Georgia law is really about because we haven’t had much of that. Drop boxes now become a permanent part of the Georgia landscape. They were not prior to COVID. They are now.\n\nMinimum of 17 days of early voting, including two Saturdays and two optional Sundays. You’re going to have all voters being able to have multiple ways to prove who they are, driver’s license, last four numbers of your Social Security number, even a utility bill or a free ID provided by the state of Georgia, and voting is going to be until — from 7:00 a.m. to 7:00 p.m. as it is right now in Georgia.\n\nThis is what we —\n\nSTEPHANOPOULOS: So, what is this a symptom of? It sounds like you’re against —\n\nCHRISTIE: It’s a symptom of, it’s a symptom of this, George. And I hate to come in here this morning to say this because I sat here and listened to the president’s inaugural address. And I just want a couple of real quick points from it.\n\nPolitics need not be a raging fire that destroys everything in its path. Every disagreement doesn’t have to be a cause for total war, and we must reject a culture in which facts themselves are manipulated or made up.\n\nAnd Joe Biden’s broken his own rule, 84 days. And now, he’s lying to the American people, George. He’s lying about this bill. He’s lying to the American people about it to cause the raging fire he said he was going to put out. I’m very disappointed.\n\nSTEPHANOPOULOS: Yvette, he did make some misstatements about the bill. The bill basically, though, restricts access to early — not to early voting but to absentee ballots, but it does expand early voting.\n\nYVETTE SIMPSON, ABC NEWS CONTRIBUTOR: Well, I mean, it depends on how you think about it. You know, you have to pick between a Saturday or a Sunday and what we know about early voting is a lot of folks appreciate, expect and depend on that weekend voting. We know that Sundays are a time when a lot of churches do go.\n\nSo, the fact that you have to pick between the two is a challenge. It still does not address voter purging which is a big significant issue and there are not enough drop boxes, in fact. Part of the challenge was, yes, you’ve solidified it, but no, you have not provided sufficient drop boxes for folks.\n\nSo, it — let’s stop and back up and say, first, the motivation was not to do more. The motivation was actually to do less.\n\nWe know that voter fraud was not an issue. And so, this just the motivation enough was enough, and I don’t think this goes far enough. I think that, you know, what do we need to do to make sure early voting gets expanded? Seventeen days is not enough early voting.\n\nCHRISTIE: Well, Stacey Abrams, by the way, Stacey Abrams was in New Jersey, in my state, praising Phil Murphy this week for a voting law where New Jersey early voting is nine days. Half, half of what Georgia is.\n\nYet she’s on TV in New Jersey — I saw it myself — saying that this is one of the greatest voting expansion bills we’ve ever seen, but this is Jim Crow? I’m sorry, George.\n\nSTEPHANOPOULOS: She’s not — she’s not for moving the all-star game.\n\nBut, Sarah, one of the interesting things we’re seeing here is not just Major League Baseball. It’s Delta. It’s Coca-Cola. It does appear here that corporate America is out of step with the Republican base.\n\nSARAH ISGUR, ABC NEWS ANALYST: That’s certainly true, but I think that Republicans have stumbled on a pretty good message here which is Delta, Coke, et cetera, these corporations coming out and condemning the Georgia bill, which, as you said, is ridiculous compared to other states. Delaware, Joe Biden’s home state, didn’t even have early voting in 2020. They won’t have it until 2022. They’re condemning that. They’re condemning this Georgia bill without really understanding it. Joe Biden has been labeled a recidivist liar for what he has said about the bill by the fact checking organizations.\n\nAnd what about China? We have actual concentration camps going on in China and these corporations won’t say word one about it. And the hypocrisy of that, I think, is very clear to a Republican base that this isn’t about whether the feel strongly about a Georgia bill that doesn’t do what the Democrats are afraid it will do and it doesn’t do what the Republicans want it to do, by the way. But, at the same time, unwilling to say word one about China because that’s where the money is.\n\nGEORGE STEPHANOPOULOS, ABC “THIS WEEK” ANCHOR: They wouldn’t be doing it if it wasn’t in their corporate interest.\n\nYVETTE SIMPSON, DEMOCRACY FOR AMERICA CEO AND ABC NEWS CONTRIBUTOR: Yes.\n\nRAHM EMANUEL, (D) FORMER MAYOR OF CHICAGO AND ABC NEWS CONTRIBUTOR: Well, the — you’ve got to put this in a lineage. Also, if you go back four years ago, when North Carolina changed their laws as related to bathrooms, corporations then took a — pressure in isolating North Carolina. That’s also the situation here. It’s a shot across the bar to every other state that’s looking at changing the laws. They’re trying to fix the problem that did not happen.\n\nSIMPSON: Right.\n\nEMANUEL: And one of the worst part — that is the fundamental. There was no problem and they’re coming up — it’s like — they’re coming up with the solution to a problem that doesn’t exist. And it’s a shot across the bow to a bunch of other states. And the worst case that this bill, which none of you have mentioned, is the fact that the state legislature wants to overrule both the secretary of states (INAUDIBLE). They’re — for what — what other reason. I’ll repeat what I said last week, which is, if Donald Trump would have won Georgia, there’d be no change in the law. And the fact that because Joe Biden won that this is — look, it’s a, you know —\n\nISGUR: If Joe Biden and Stacey Abrams were saying that, I think we’d have a very frank (ph) conversation.\n\nCHRIS CHRISTIE, (R) FORMER GOVERNOR OF NEW JERSEY AND ABC NEWS CONTRIBUTOR: Right.\n\nEMANUEL: I have no problem fixing the — there’s a lot of problems to fix. This was not a problem to fix.\n\nISGUR: But they’re not. Joe Biden said, it ended early voting. It doesn’t end early voting.\n\nCHRISTIE: This is — it expands early voting in Georgia. The president said it ended it.\n\nListen, he’s what Joe Biden’s got to live with when he wakes up this morning on Easter morning. He is doing exactly what he sat around in the campaign and the transition and accused Donald Trump of doing. He is lying to cause racial divisions in this country. That’s what he accused Donald Trump of doing and he’s a liar and a hypocrite this morning (ph).\n\nEMANUEL: Yes, wait — so, hold on — hold on —\n\nSTEPHANOPOULOS: Then how do you explain why Major League Baseball is making the move?\n\nCHRISTIE: It’s a business judgment, George. It’s a business judgement. Major League Baseball has to make a decision about what is in their best business interest. And I’m sure that’s what —\n\nEMANUEL: Chris —\n\nCHRISTIE: I haven’t spoken to anybody there, but I’m sure it’s what this is (ph).\n\nSTEPHANOPOULOS: If it — if it’s in their best business interest, doesn’t that suggest that there’s something wrong with the law?\n\nCHRISTIE: No. What it suggests is that’s the climate in this country right now. That’s the climate of what it is.\n\nSIMPSON: You should ask the people who know. You should ask the people who know. I’ve been doing voter protection for 10 years. Just the idea that you can’t give people water in line. I know people’s babies —\n\nCHRISTIE: No, that’s just not true.\n\nISGUR: That is (INAUDIBLE) —\n\nCHRISTIE: That’s not true.\n\nSIMPSON: I have held people’s babies while they go in to vote in order to enfranchise the vote. Do it by — do it by all (INAUDIBLE).\n\nCHRISTIE: You can’t do electioneering — excuse me. That’s — I’m sorry, that’s just wrong.\n\nEMANUEL: I’m —\n\nSTEPHANOPOULOS: Well, within 20 — I think it’s within 25 feet.\n\nCHRISTIE: A hundred and fifty feet, where, in New Jersey, in Chicago and any place else in the country, you’re not — he’s saying partisan groups cannot do electioneering by giving out food and water. And in the Georgia bill says that there can be water provided by the state of Georgia, just not by partisan groups.\n\nEMANUEL: Two things, George.\n\nISGUR: Also, look, that’s a stupid part of the bill, but it’s not a threat to democracy.\n\nCHRISTIE: And this is the kind of stuff that —\n\nEMANUEL: Two things. Two things. Two things. Two things.\n\nSIMPSON: Every time you try to restrict voting rights it’s a threat to democracy.\n\nISGUR: But that’s no restricting voting right.\n\nCHRISTIE: (INAUDIBLE)\n\nEMANUEL: Two things.\n\nSIMPSON: And the fact that they didn’t address the elephant in the room, which is voter purging. A hundred an ninety-eight thousand African-Americans Georgians were purged from the rolls.\n\nEMANUEL: Well, wait —\n\nISGUR: But that’s now what Joe Biden and Stacey Abrams have been complaining of.\n\nCHRISTIE: Yes, look —\n\nSTEPHANOPOULOS: Rahm.\n\nEMANUEL: I feel like a middle child at a dinner or breakfast.\n\nSIMPSON: Always.\n\nSTEPHANOPOULOS: You really have a hard time getting in.\n\nEMANUEL: Two things.\n\nCHRISTIE: Yes, everyone feels bad for you, Rahm.\n\nEMANUEL: One is — one is you said that corporate America is out of step with the Republican Party. Corporate America has no home in the Republican Party anymore. And this is the first of many times where corporate America is going to make a clear decision. And it’s a wakeup call to every other state.\n\nSecond is, Joe Biden is not a liar.\n\nCHRISTIE: Yes, he is.\n\nEMANUEL: No, no, no.\n\nSIMPSON: (INAUDIBLE).\n\nEMANUEL: And coming from a — you know, we just spent four years with a person who had literally couldn’t find the truth if it actually — it went choo-choo in front of him in the morning.\n\nCHRISTIE: Is —\n\nEMANUEL: Joe Biden, you may disagree with his characterization.\n\nCHRISTIE: Did we restrict early voting?\n\nEMANUEL: He is not a lie.\n\nSIMPSON: It does restrict early voting.\n\nEMANUEL: You may disagree with his characterization. That bill is only done — passed for one reason, because Joe Biden won Georgia and the two senators won Georgia.\n\nCHRISTIE: He lied. He lied, Rahm, and he’s going to have to live with it.\n\nEMANUEL: That is not. He has not.\n\nCHRISTIE: Yes, he is."
        }
      ]
    },
    "rds": {
      "rss": "http://www.redstate.com/feed/",
      "link": "http://www.redstate.com/",
      "articles": [
        {
          "link": "https://redstate.com/brandon_morse/2021/04/05/morse-if-the-medias-attack-on-ron-desantis-seems-desperate-its-because-it-is-n355645",
          "published": "2021-04-05T15:00:21",
          "title": "Morse: If the Media's Attack on Ron DeSantis Seems Desperate, It's Because It Is",
          "text": "The 60 Minutes “report” on Ron DeSantis wasn’t just ridiculous, it was absolutely bizarre. Not only did the news show completely deny the science we know about how infectious the Coronavirus is to seniors, they completely left out key elements of the information they gathered to make him seem corrupt. Why are they doing this?\n\nThe reason is desperation. DeSantis is ruining everything the left is trying to accomplish both in narrative and agenda. I explain this and more in the video below.\n\nBe sure to LIKE and SUBSCRIBE for more content."
        },
        {
          "link": "https://redstate.com/jeffc/2021/04/05/the-beginning-of-the-black-exodus-from-the-republican-party-n355646",
          "published": "2021-04-05T14:30:32",
          "title": "The Beginning of the Black Exodus From the Republican Party",
          "text": "In a previous piece, I posted my livestream addressing the history between the Republican Party and the black community. I discussed the historical events and decisions that led African Americans to overwhelmingly support the Democratic Party.\n\nAs the initial video was three hours long, I decided to break it up into smaller chunks to make it easier to consume. In this first section, I discuss the Lily-White movement that arose in the GOP shortly after the end of Reconstruction and how it spread to southern states.\n\nIn the presentation, I detail how the movement eventually took power in various state’s Republican Parties and systematically began ousting black leaders in a bid to appeal to southern white voters. The movement led to the GOP’s alienating black voters to the extent that they began seriously considering the Democratic Party despite the fact that it was also full of southern whites who weren’t too keen on the notion that blacks should be a focal point.\n\nIn the next section, I will discuss how the movement pushed African Americans towards the New Deal policies of President Franklin Delano Roosevelt."
        },
        {
          "link": "https://redstate.com/bonchie/2021/04/05/u-s-grant-gave-money-to-the-wuhan-lab-to-enhance-coronaviruses-the-decision-wasnt-even-scrutinized-n355578",
          "published": "2021-04-05T14:00:38",
          "title": "U.S. Grant Gave Money to the Wuhan Lab to Enhance Coronaviruses, the Decision Wasn't Even Scrutinized",
          "text": "The United States gave a grant of $600,000 to the Wuhan Institute of Virology, and the decision wasn’t even scrutinized by the agency Dr. Anthony Fauci heads up. This per a new report from The Daily Caller which lays out in detail exactly how the transfer happened and the lack of oversight involved.\n\n(related Lawmakers Call for Investigation Into ‘Secretive’ NIH Payments to Wuhan Lab)\n\nAn oversight board created to scrutinize research that would enhance highly dangerous pathogens did not review a National Institutes of Health grant that funded a lab in Wuhan, China, to genetically modify bat-based coronaviruses. Experts say the NIH grant describes scientists conducting gain-of-function research, a risky area of study that, in this case, made SARS-like viruses even more contagious. Federal funding for gain-of-function research was temporarily suspended in 2014 due to widespread scientific concerns it risked leaking supercharged viruses into the human population.\n\nAs the report notes, this kind of research was suspended for several years due to concerns deadly viruses could leak out of these labs. Though that hasn’t been conclusively shown to be what happened with COVID-19, there has been circumstantial evidence to suggest an unintentional leak from the Wuhan lab was the cause.\n\nDespite the danger involved in studying bat-coronaviruses, the grant was not scrutinized by the P3CO commission, which exists to look into whether research enhancing pathogens is safe and worth the risk.\n\nHad EcoHealth’s grant been subjected to P3CO review, an HHS panel would have independently evaluated the grant and, if necessary, recommended additional biocontainment measures to prevent potential lab leaks — or even recommended that the grant be denied entirely.\n\nThere are a lot of different ways to take this news. Mine is fairly simple — why are we giving money to a communist laboratory in Wuhan, China in the first place? Forget all the theories or fights over how and why COVID-19 ended up a global pandemic. It would certainly be a big coincidence that the WIV was studying and enhancing bat-based coronaviruses at the same time one makes it into the general population, but I suppose it’s possible it actually came from a bat that exists in the wild hundreds of miles away\n\nRegardless, the use of federal funding in this instance should be heavily criticized. China is not our friend. Their goals are not our goals. We do not need the Chinese to study pathogens. There is no reason we should be giving them over half a million dollars of U.S. taxpayer money to do anything, much less do something as dangerous as enhancing coronaviruses.\n\nNone of this should be controversial, in my view. There needs to be a real reckoning at the appropriations level for how much money is given to foreign entities and why they are given it. Whether this grant played a direct role in creating what we now call COVID-19, we will likely never know. The Chinese aren’t going to allow a real investigation. But that this isn’t even a question is something that was completely preventable."
        },
        {
          "link": "https://redstate.com/brandon_morse/2021/04/05/morse-charles-barkley-defies-social-justice-narratives-on-race-n355610",
          "published": "2021-04-05T13:30:17",
          "title": "Morse: Charles Barkley Defies Social Justice Narratives on Race",
          "text": "NBA Legend Charles Barkley isn’t buying the social justice community’s narrative that we are a racist nation and instead blames divisive elements within both Republican and Democrat parties for the racial tensions we’re experiencing in America.\n\nBarkley isn’t the only one who has done such a thing. Rapper Lil’ Wayne also had some interesting things to say about racism not long ago that go directly against what mainstream narratives tell us about race. In my latest video, I talk about all this and more.\n\nBe sure to LIKE and SUBSCRIBE for more content!"
        },
        {
          "link": "https://redstate.com/nick-arama/2021/04/05/that-crazy-admission-that-hunter-biden-made-on-cbs-n355573",
          "published": "2021-04-05T13:00:30",
          "title": "That Crazy Admission That Hunter Biden Made on CBS",
          "text": "Democrats were always trying to spin conspiracies and things that were just flat-out nonsense about President Donald Trump and his family, the biggest, of course, being Russia collusion.\n\nJoe Biden and his family were going to bring back “normalcy,” they claimed.\n\nSome normalcy. They want to do away with laws at the border, rules in the Senate, pack the Supreme Court, eliminate state control of elections, just to name a few of the political things by which they seek to lock in their control.\n\nOh, and on the family front, Hunter Biden admitted in his CBS interview that he smoked parmesan cheese thinking it was crack.\n\nHunter Biden smoked more parmesan cheese than anyone you know pic.twitter.com/0T4J2S8647 — PG Howie (@pghowie3) April 5, 2021\n\n“I spent more time on my hands and knees picking through rugs smoking anything that resembled crack cocaine. I probably smoked more Parmesan cheese than anyone, than anyone you know, Tracy,” Hunter told CBS’s Tracy Smith.\n\nI mean let’s be honest, haven’t you smoked parmesan cheese when you were looking for the crack you misplaced or completely smoked up? Well, I mean, at least after you got the stripper pregnant and canoodled with your dead brother’s wife while allegedly sending raunchy texts to her sister? Trump’s kids are just pikers compared to this guy. And that’s not even getting into any of the political issues of his connections to foreign business partners and how much that might have compromised him and the big guy.\n\nBut hey, this is the “feel sorry for me” victim tour, where they dump out all the dirt, say he’s reformed, therefore we’re all “past” any Hunter questions. Just don’t look behind the curtain as to any of those foreign questions and what they might ultimately mean.\n\nBut some folks weren’t buying into this whole show, noting how, while Hunter appears to have skated on virtually anything he’s done, Joe Biden was moving to lock up folks for 5 years for having tiny pieces of crack. Where’s Hunter’s five years, fat?\n\nNo one should feel sorry for him ‼️ His father made sure everyone else’s son and daughter went to jail 😡 these ppl are sick 🤡sympathy tour 😠 https://t.co/QKZDH1Rlf7 — Debra✨👸🏽 (@Msdebra_01) April 5, 2021\n\nRemember when Joe Biden said that Hunter was the smartest person he knew? That’s when you knew we are truly up a creek without a paddle.\n\nBut hey, just remember, no mean tweets and “normalcy.” At least Hunter wasn’t cracking open the cheddar, right?"
        }
      ]
    },
    "hotair": {
      "rss": "http://hotair.com/feed",
      "link": "http://hotair.com/",
      "articles": [
        {
          "link": "https://hotair.com/archives/allahpundit/2021/04/05/joe-scarborough-open-damned-schools-already/",
          "published": "2021-04-05T15:25:14",
          "title": "Joe Scarborough: Open the damned schools already",
          "text": "The ironic thing about this clip is that it begins with him dumping on Ron DeSantis for prioritizing “owning the libs” in his policies, yet DeSantis’s most celebrated decision as governor was driven by the very point Scarborough makes here. He fought to reopen Florida’s schools last summer, believing it was riskier to keep kids home and do them lasting developmental damage than to bring them back and tolerate occasional small COVID outbreaks. The science has vindicated him on that risk calculation, as Morning Joe now allows.\n\nDeSantis’s reward for being ahead of the curve on one of the most important policy disputes of the pandemic is the eternal grudging disdain of the Beltway class for his Trump pedigree. Oh well.\n\nStill, two cheers for Scarborough for championing this cause. Few news shows are more influential among legislators and political media influencers than his; if he’s showing exasperation at the slow pace of school reopenings, that’ll signal to them that it’s a genuine problem rather than just a Republican talking point they might otherwise dismiss. He’s not stopping at schools either:\n\nAs the risk of COVID is on the decline, the mental health crisis across America is at a breaking point. The great progress made combating COVID demands a science-based plan to reopen cities like Boston sooner rather than later. Fools may rush in, but they often act too cautious. — Joe Scarborough (@JoeNBC) April 5, 2021\n\nSchools remain the chief concern, though, and not just because educating kids is an unusually high social priority. Businesses will reopen as soon as their communities let them, as their bottom lines demand it. Most or all will be operating this summer. Schools are different: Thanks to the power of the teachers unions and their bizarre, selfish hypercaution about returning to class, there’s still doubt about whether some school districts will reopen this fall — even though every teacher in America will have been eligible for vaccination for many months by then.\n\nConcerns of teachers, who have argued it is too dangerous to return to many buildings, probably will linger, and so may battles that consumed many districts this year. Some families are sure to prefer fully remote education — either because it is working for their children or because they fear going back. Many districts will continue to offer online options… Several district leaders said they are planning to reopen full time but they are not ready to commit. They say they cannot predict the path of the pandemic or whether their communities will do what is needed to bring and keep infection rates down. Some fear the spread of variants of the virus, against which vaccines may not be as effective, will lead to a fresh surge in cases and a new round of restrictions… “I’ve seen inequalities all my life, and the last thing we can afford to do at the end of a pandemic that has already disproportionately impacted our Black and Brown and Indigenous communities, the last thing we need to do is to say we did not take the time to do studies in their environments, in their schools,” [NEA President Becky Pringle] said. “We still have lots of questions.”\n\nIf your kid goes to a public school in a blue state and you can afford to either move or switch them to private, start thinking hard about it now. Don’t gamble on your state doing right by you by September. If they cared about your children, they’d already be in class, no?\n\nHaving said that, there *is* good news. The national picture has gotten much better since January:\n\nNEW: Well over 50 percent of K-12 students now have the option to attend in-person classes 5 days a week. https://t.co/Z4Co1JJGk8 pic.twitter.com/xx7mO1blBN — Jim Roberts (@nycjim) March 30, 2021\n\nMore than half of kids are in school full-time and more than 80 percent are in classrooms at least part-time. As COVID cases continue to decline this summer, more schools will shift to in-class instruction for the fall, leaving the ones that are still leaning towards virtual learning looking like extreme, embarrassing outliers by comparison. That pressure will help reopen some districts that are on the fence. It already has, in fact: Burbio’s state “index” for measuring how many kids are back in class finds blue states like Michigan, Connecticut, and Vermont already on par with some red ones. Kids are going back. The question now is whether some will need to wait until fall to do so or whether public pressure can get them back soon, before the end of the current school year. That’s what has Scarborough exercised. With cases low in so many parts of the U.S. right now, he says, why wait?\n\nWatch four minutes here. More of this, please."
        },
        {
          "link": "https://hotair.com/archives/jazz-shaw/2021/04/05/not-democrats-board-bidens-corporate-tax-hike-plan/",
          "published": "2021-04-05T15:02:22",
          "title": "Not all Democrats are on board with Biden’s corporate tax hike plan",
          "text": "In one of the rarer cases of President Joe Biden pushing an agenda item that he actually discussed on the campaign trail, he’s preparing to roll out a bunch of tax increases that he wants the Democrats to push through congress. Chief among these is a significant increase in the corporate tax rate from 21% to 28%. This would supposedly be an example of making employers “pay their fair share” and the revenue would go toward paying for Biden’s massive infrastructure proposal along with the rest of his staggering tax-and-spend plans. But if he thought the plan was just going to sail through smoothly, he may have overestimated the existing support for such a measure. The Wall Street Journal reports this week that a number of House Democrats are already getting cold feet and looking for different ways to finance their ambitions. (Subscription required)\n\nPresident Biden’s proposed tax increases on corporations as part of a $2.3 trillion infrastructure plan have drawn a skeptical reaction from some Democrats, who instead favor borrowing money to pay for the investments or raising other levies, like the gasoline tax, to do so. The proposal would raise the corporate tax rate to 28% from 21% and increase taxes on companies’ foreign earnings. The White House said the tax increases would, over 15 years, cover the cost of the $2.3 trillion package, which puts money toward improving roads, bridges, and transit systems, along with expanding broadband access and myriad other efforts. Republicans have widely rejected Mr. Biden’s proposed tax increases, but some Democrats are raising their own questions about the plan. With very narrow majorities in the House and Senate, Democrats will need nearly unanimous support in their party to advance the package without Republican votes, and many lawmakers are floating potential changes to the plan.\n\nNancy Pelosi is all in favor of Biden’s corporate tax hike as one might expect, but she’s also keenly aware that her majority margin in the House is now down to single digits. She’s going to have to do quite a bit of cat-herding to push that beast over the line and there are already signs of potential Democratic defectors making noises about not going along with the plan.\n\nCongressman Peter DeFazio (D., Ore.), who chairs the House Transportation and Infrastructure Committee, has already gone on record saying that he doesn’t believe funding the infrastructure bill entirely through tax hikes is necessary. He would prefer some combination of an increase in the federal gas tax and “borrowing” more money to cover it. (There’s that magical money tree again.) Richard Neal (D., Mass.) has similarly said that he expects to see “changes” in the tax hikes made by the House.\n\nJosh Gottheimer (D., N.J.) is quoted as saying that he doesn’t want to see a bill of this size forced through without at least some GOP support. He’s suggesting that his party look for “alternatives to the corporate tax increase” in order to bring some Republicans along. He and some other northeastern Democrats are suggesting that a new “mileage tax” paid by drivers of electric vehicles should be on the table. If nothing else, that would be a channel of revenue generated by people who are actually using the infrastructure that the bill is supposedly going to invest in.\n\nOf course, no discussion of hesitant Democrats would be complete without checking in on King Joseph over on the Senate side, right? As you might expect, the current proposal is a non-starter for him also.\n\nIn a radio interview with @HoppyKercheval, Sen. Manchin signals there are circumstances under which he won't vote to get onto the infrastructure bill. \"As the bill exists today, it needs to be changed,\" Manchin says. — Steven Portnoy (@stevenportnoy) April 5, 2021\n\nThe part that’s not being said aloud by many of these Democrats is that they’re very nervous about the idea of significantly hiking up the taxes paid by large corporations because those same corporations channel a lot of cash into political campaigns through various methods. Once you start biting the hand that feeds you, those contributions may begin drying up. There’s also the possibility of voter backlash if employers begin scaling back on hiring and benefits to make up for the additional revenue they lose to Uncle Sam.\n\nThe razor-thin margins the Democrats have in both chambers appear to be creating a trap for Chuck Schumer and Nancy Pelosi, along with Joe Biden as well. They can try to ram through all of these massive, budget-busting plans via reconciliation with no support from any Republicans and very likely suffer a beating at the polls next year like the one they experienced in 2010. Or they can significantly temper their expectations to gain some GOP support, but risk a revolt from the Squad and their own far-left flank. I’m sure that neither option is looking terribly appetizing at the moment."
        },
        {
          "link": "https://hotair.com/archives/ed-morrissey/2021/04/05/former-gaetz-aide-sure-look-like-media-cooking-narrative-gaetz/",
          "published": "2021-04-05T14:36:17",
          "title": "Former Gaetz aide: Sure looks like the media’s cooking a narrative on Gaetz",
          "text": "Is there real fire behind all of the smoke, or has Matt Gaetz fallen victim to a media smear campaign? As the tales have gotten more outlandish — not to mention recycled — the impulse is to lean toward the former. Perhaps, however, this eye-popping Twitter thread from Washington Post reporter Matt Zapotosky should have us demanding greater scrutiny to these claims, until extraordinary evidence for extraordinary claims finally emerges.\n\nZapotosky spoke with Gaetz’ former director of military affairs, who got questioned by the FBI about Gaetz. According to Captain Nathan Nelson, the agents informed him that “national media” sources had told them Nelson had quit over Gaetz’ alleged “illegal activities.” Not only was that untrue, Nelson had never even suggested any illegal activity on Gaetz’ part:\n\nBut by Nelson's account, that was not true. He told me he had no knowledge of Gaetz being involved in illegal activities, & had left the office for other reasons. “He’s always been very, very professional in his public life,” Nelson said of Gaetz. — Matt Zapotosky (@mattzap) April 5, 2021\n\nNelson has no issue with the FBI for following up on tips, but he clearly resents the rumors involving his supposed knowledge and the circumstances of his departure. He told Zapotosky that he would hold a press conference to “pre-empt” those rumors from getting into the media narratives, and to also call into question much of the reporting on Gaetz thus far:\n\nNelson said he wanted to hold the press conference essentially to pre-empt what he viewed as a false report that he knew about illegal activities involving Gaetz. He told me, though, that no media had contacted him about such a report; he was hearing that 2ndhand from the FBI — Matt Zapotosky (@mattzap) April 5, 2021\n\nNelson’s brief presser can be seen in this video, which apparently was filmed from someone’s 2003 version of a Palm Pilot. Nelson told the media that any suggestion that he left on bad terms or had ever expressed any concerns about Gaetz’ activities was entirely false. “I’m saying the allegations that named me were baseless,” Nelson told reporters, “that kind of reflects on the allegations against Congressman Gaetz.”\n\nLiterally the first question Nelson gets asked is for evidence to prove the negative, of course:\n\nIs this a definitive debunking of all the allegations against Gaetz? No, and that’s not quite what Nelson claims either. What he does point out is that the media is conducting a feeding frenzy with very little if any solid evidence behind it — and they got it spectacularly wrong in his case. How much else have they gotten wrong?\n\nEven worse, however, is that the FBI apparently got sent in his direction from a “national media” source. If that’s true, that suggests that at least some of this frenzy is media generated, not media covered. It’s also possible that the agents might have told Nelson that as a misdirection to protect a source. That doesn’t make any sense at all if Nelson never said anything of the sort to anyone, though, as he told the press today.\n\nAs an elected official, Gaetz’ conduct is fair game for media scrutiny. Before we stampede the man out of office, however, let’s make sure we’re seeing media scrutiny rather than a rumor-fueled witch hunt. Skepticism should be the default, especially as the claims get wilder while the evidence keeps failing to materialize."
        },
        {
          "link": "https://hotair.com/archives/john-s-2/2021/04/05/alison-collins-sues-school-board-87-million/",
          "published": "2021-04-05T14:00:45",
          "title": "Alison Collins sues school board for $87 million",
          "text": "For those who haven’t been following this saga, a recap. Alison Collins was the Vice President of the San Francisco school board. She supported the board’s effort to rename schools (based on shoddy research) and also voted to end selective admissions at San Francisco’s Lowell High School. Importantly, Lowell’s strict admissions had led to it being disproportionately Asian, and many Asian parents whose student attended were upset with the board’s decision.\n\nSome of the parents formed a group to oust Collins and two other members of the school board. They call themselves Recall SF School Board. About three weeks ago, that group was shown a thread of tweets which Alison Collins had published back in 2016. The old tweets contained some inflammatory comments about Asian parents and students. For instance:\n\nIn fact many Asian American Ts, Ss, and Ps actively promote these myths. They use white supremacist thinking to assimilate and \"get ahead\". — Alison Collins 高勵思 (@AliMCollins) December 4, 2016\n\nCollins issued a semi-apology but refused to resign or even to delete the tweets. Meanwhile, Mayor London Breed and nearly every member of the SF school district joined the push to oust Collins as did two members of the SF School Board. Eventually, even the LA Times editorial board called on Collins to resign. That culminated in a 5-2 vote by the school board to strip Collins of her title and her committee assignments. However, she is still a voting member of the board.\n\nLast week, in response to the vote, Collins filed an $87 million lawsuit against her colleagues on the board:\n\nA lawsuit filed by San Francisco school board member Alison Collins took everyone by surprise, including her own colleagues who are also being sued by her. Collins says her First Amendment Rights were violated after she received a vote of no confidence for posting derogatory remarks against Asian Americans. Collins has set a price, $87 million as punishment for allegedly having her first amendment rights violated.\n\nSo is this going anywhere? Mission Local wrote an amusing piece about the lawsuit Collins and her attorneys filed, calling it “an amazing document.”\n\nReading through Collins’ complaint, however, she may end up with nothing. This lawsuit is an amazing document, and not in a good way — and all the more so because three different law firms were involved in its crafting. That’s on par with four writers being credited with the screenplay of Dirty Dancing: Havana Nights… “This isn’t really a lawsuit,” summed up UC Davis law professor Ash Bhagwat. “It’s more of an op-ed pretending to be a lawsuit.” … Similarly, Collins’ claim of “intentional infliction of emotional distress” from her colleagues struck scholars as bizarre in the context of elected office. “This is absurd,” said Joel Paul, a UC Hastings professor. “You can’t complain when people express opinions about you that are hostile. That is part of the job of a public official.”\n\nIf you’re interested in reading the full document it’s here. Even putting aside some of the colorful language in it, Collins appears to have no real case. Mission Local notes there is a previous case from 2010 in which Ken Blair, a member of a school board in Washington state, was similarly stripped of his role as Vice President and sued the school board on First Amendment grounds. Here’s how that case turned out:\n\nBlair lost. At every level. The 9th Circuit panel ruled that Blair’s First Amendment rights were not chilled, and his colleagues were entitled to strip him of his leadership position in favor of a “vice president who better represented the board’s majority view.” The ruling finds that while “the First Amendment protects Blair’s discordant speech as a general matter; it does not, however, immunize him from the political fallout of what he says.”\n\nIn short, there is a nearly identical case decided a decade ago which went completely against the plaintiff. So the chance that judges are going to ignore that precedent and hand Alison Collins millions of dollars is somewhere near absolute zero. Her attorneys must know that but went ahead with this anyway. This has all the hallmarks of a made-for-media stunt. I’m sure working with Collins is going to fun from here on out."
        },
        {
          "link": "https://hotair.com/archives/allahpundit/2021/04/05/mcconnell-mlbs-georgia-boycott-woke-corporations-risk-serious-consequences/",
          "published": "2021-04-05T13:51:52",
          "title": "McConnell on MLB’s Georgia boycott: These woke corporations risk “serious consequences”",
          "text": "Meh. Even when they’re right to be angry, I disdain legislators threatening businesses for their politics. If McConnell wants to take away Major League Baseball’s antitrust exemption or raise corporate taxes to make sure companies pay their “fair share,” why does he need some cultural grievance to spur him to do it? Do it because it’s good economics.\n\nAnd if he doesn’t believe it’s good economics, why would he let a cultural grievance entice him into doing needless economic damage to some sector?\n\nIronically, I think the Republican politician who’s best handled the aftermath of MLB pulling the All-Star Game out of Georgia is Trump. He didn’t call for legislative action or make any policy threats; he called for a grassroots boycott of Major League Baseball by Republican voters. (He also insisted that the election was rigged, but what else is new?) That’s the way to do this. Set economic policy at the federal level according to whatever will encourage growth and punish the woke behemoths by encouraging righties to organize and throw their weight around as consumers. They’re woefully deficient about that relative to the left.\n\nStill, given the upset about MLB’s boycott, McConnell had to show the base he’s prepared to “fight” — especially after Trump’s statement this weekend. He’s strategically vague on what that would mean in practice here but the point is clear enough. He’s standing up for Georgia:\n\n“This disinformation [about Georgia’s law] has a purpose. Washington Democrats want to pass a sweeping bill that would let them rewrite all 50 states’ election laws and turn the Federal Election Commission into a Democrat-run partisan body. This power grab is impossible to defend, so the left wants to deflect. Instead of winning the debate, they want to silence debate by bullying citizens and entire states into submission. “It’s jaw-dropping to see powerful American institutions not just permit themselves to be bullied, but join in the bullying themselves. Wealthy corporations have no problem operating in New York, for example, which has fewer days of early voting than Georgia, requires excuses for absentee ballots, and restricts electioneering via refreshments. There is no consistent or factual standard being applied here. It’s just a fake narrative gaining speed by its own momentum. “Our private sector must stop taking cues from the Outrage-Industrial Complex. Americans do not need or want big business to amplify disinformation or react to every manufactured controversy with frantic left-wing signaling. “From election law to environmentalism to radical social agendas to the Second Amendment, parts of the private sector keep dabbling in behaving like a woke parallel government. Corporations will invite serious consequences if they become a vehicle for far-left mobs to hijack our country from outside the constitutional order. Businesses must not use economic blackmail to spread disinformation and push bad ideas that citizens reject at the ballot box.”\n\nHe’s not the first Republican to point out that New York, the home of Major League Baseball, has more restrictive voting laws than Georgia does:\n\nPerhaps the @MLB should take a look at the restrictive voting laws in their home state of New York before criticizing ours. pic.twitter.com/Vd6IuzlMsq — Governor Brian P. Kemp (@GovKemp) April 3, 2021\n\nOther states now competing to host the All-Star Game also have “problematic” voting laws. Colorado requires voter ID while Wisconsin forbids handing out food or drink to voters in line. The president’s home state also has harsher voting laws than Georgia. There’s no no-excuse early voting or absentee voting in Delaware, believe it or not. If Georgia is “Jim Crow on steroids,” what does that make Biden’s state? The Third Reich?\n\nMost of the public embarrassment will be reserved for MLB itself, though. This morning Marco Rubio sent a letter to the game’s commission, Rob Manfred, asking if he’ll forfeit his membership at Augusta to protest the new voting law. Fox also dinged the league this weekend by noting that their standards for Chinese outfits are less exacting than their standards for Georgia:\n\n[T]he MLB signed a deal with Tencent Wednesday, one of China’s largest tech companies. It’s one of the Chinese firms that briefly dropped NBA games in 2019 after former Houston Rockets general manager Daryl Morey publicly voiced support for pro-democracy protesters facing a Beijing-backed crackdown in Hong Kong. The new deal grants Tencent rights to stream MLB games in a number of Asian countries until 2023. Back in 2018, the MLB and Tencent reached another deal that granted the company streaming rights for 125 games within China.\n\nThat’s the way to do it. Skip the legislative threats; organize boycotts and focus on shaming them for their hypocrisy at every turn. Make political gestures such a headache for companies that they’ll risk making them only when the balance of equities in a particular political dispute is clear and egregiously lopsided. Which it isn’t in the case of Georgia’s law, as even some fair-minded liberals have begun to acknowledge:\n\nBad stuff:\n\n– shorter window to request absentee ballot\n\n– later mailing of absentee ballots\n\n– limiting drop boxes (The stated concern is security, but this is already addressed by moving them inside voting sites)\n\n– shorter runoffs, which could limit the window for early voting /2 — Will Saletan (@saletan) April 3, 2021\n\nOverhyped:\n\n– Only poll workers can give water to voters in line, and nobody can do it within 150 feet of polling place. The idea is to limit influence. Excessive IMO, but there are loopholes: poll workers, 150 feet, and \"third-party groups [can] have food and water available.\" /4 — Will Saletan (@saletan) April 3, 2021\n\nDebatable:\n\n– Government can no longer send unsolicited absentee ballot applications. IMO, the stated concern, risk of fraud, is solved by voter ID.\n\n– Drop boxes now accessible only during early voting hours. I think this is just because they now have to be inside voting sites. /6 — Will Saletan (@saletan) April 3, 2021\n\nTo my amazement, a Democratic member of the House admitted yesterday that his own side is exaggerating the risks from Georgia’s law:\n\nAfter studying the Georgia voting law, I believe it's not as good and necessary as Rs would like you to believe, nor as comprehensively horrible and unnecessary as Ds are arguing. In the spirit of objectivity, please read the law and have a look at @saletan's assessment, below: https://t.co/CIYfQu42BL — Rep. Dean Phillips 🇺🇸 (@RepDeanPhillips) April 4, 2021\n\nIt’s not even clear that the new law will reduce turnout.\n\nCasual news consumers coming to this debate without having read the statute are conflating two things, I think. They distrust the Georgia GOP’s motives in tinkering with election reform after the “stop the steal” campaign, and they should. How could they do otherwise after Trump pushed for months to try to overturn the results, replete with a call to Georgia’s secretary of state asking him to “find” enough votes to prove that he won? The fact that he and the GOP keyed in on swing-state cities with large black populations like Philly and Milwaukee as likely hotbeds of fraud made the effort smell even worse, as it was the suburbs where Biden improved most dramatically over Hillary. Democrats are fully justified in assuming bad intentions when they hear that a state that used to practice Jim Crow has suddenly changed how its citizens vote after three Democrats won statewide races with massive black support and the GOP baselessly howled about election-rigging the whole way.\n\nIt’s just that the assumption doesn’t stand up to scrutiny once you read the law, as Saletan did. We have an actual legislative product we can consult here instead of having to read Republicans’ minds, and questionable motives didn’t produce a sinister statute in the end. The most aggressive restrictions that were proposed, like ending no-excuse absentee balloting or eliminating Sunday voting to prevent black community leaders from organizing “Souls to the Polls” initiatives, didn’t make it into the final version. Democrats’ justifiable fears turned out to be unfounded. But since they’re heavily invested in passing H.R. 1 — partly because other Republican states are also overhauling their election laws to correct for the “cheating” that didn’t actually happen last year — they’re doubling down on their narrative that Georgia’s law is the worst thing since slavery. And lefty activists have strong-armed corporations like MLB, Delta, and Coca-Cola into backing them up.\n\nHere’s Chris Christie aptly condemning Joe Biden for resorting to the same behavior he condemned during the campaign, stooping to racial demagoguery to advance a policy priority."
        }
      ]
    }
  }
}